[
  {
    "name": "Leidos",
    "description": "<p>We Are Leidos\n\nFor 50 years we have been tackling some of the biggest problems that face our nation and our world. \n \nOur approach is holistic, looking at all the interconnected complexities of a problem. Our brand of science is collaborative, with knowledge shared across disciplines. And our focus is always on making the real world better. \n\nOUR MISSION\nThrough our culture of innovation and history of performance, we develop deep customer trust built on integrity and create enduring solutions that improve our world. Leidos is a science and technology solutions leader working to address some of the world’s toughest challenges in the defense, intelligence, homeland security, civil, and healthcare markets. The Company’s 32,000 employees support vital missions for our government and commercial customers. Leidos is headquartered in Reston, Virginia, and reported annual revenues of approximately $10.2 billion 2018.\n\nLeidos was cited for the meaningful work employees perform that is challenging, impactful, and aligned with our customers’ missions as reasons professionals want to work and stay at our company. Leidos has also been named to lists including Forbes’ Best Employers for Diversity, Forbes’ America’s Best Employers for Women, Military Times Best for Vets Employers, and Ethisphere Institute’s World's Most Ethical Companies®.\n\nEmployees enjoy career enrichment opportunities available through mobility and development and experience rewarding relationships with supportive supervisors and talented colleagues and customers. Employees appreciate our flexible work environment, allowing for and encouraging a true work-life balance. Our professionals are also excited about our Employee Resource Groups, like the newly launched Collaborative Outreach with Remote and Embedded Employees (CORE), which strives to create an environment where every employee, regardless of location, feels fully engaged as a valued employee of Leidos.</p>",
    "website": "http://www.leidos.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/lTKfkweVZPvVk5qj4KQWCHqnmG1YkeaxLYrg10ud.png"
  },
  {
    "name": "Leidos",
    "description": "<p>We Are Leidos\n\nFor 50 years we have been tackling some of the biggest problems that face our nation and our world. \n \nOur approach is holistic, looking at all the interconnected complexities of a problem. Our brand of science is collaborative, with knowledge shared across disciplines. And our focus is always on making the real world better. \n\nOUR MISSION\nThrough our culture of innovation and history of performance, we develop deep customer trust built on integrity and create enduring solutions that improve our world. Leidos is a science and technology solutions leader working to address some of the world’s toughest challenges in the defense, intelligence, homeland security, civil, and healthcare markets. The Company’s 32,000 employees support vital missions for our government and commercial customers. Leidos is headquartered in Reston, Virginia, and reported annual revenues of approximately $10.2 billion 2018.\n\nLeidos was cited for the meaningful work employees perform that is challenging, impactful, and aligned with our customers’ missions as reasons professionals want to work and stay at our company. Leidos has also been named to lists including Forbes’ Best Employers for Diversity, Forbes’ America’s Best Employers for Women, Military Times Best for Vets Employers, and Ethisphere Institute’s World's Most Ethical Companies®.\n\nEmployees enjoy career enrichment opportunities available through mobility and development and experience rewarding relationships with supportive supervisors and talented colleagues and customers. Employees appreciate our flexible work environment, allowing for and encouraging a true work-life balance. Our professionals are also excited about our Employee Resource Groups, like the newly launched Collaborative Outreach with Remote and Embedded Employees (CORE), which strives to create an environment where every employee, regardless of location, feels fully engaged as a valued employee of Leidos.</p>",
    "website": "http://www.leidos.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/lTKfkweVZPvVk5qj4KQWCHqnmG1YkeaxLYrg10ud.png"
  },
  {
    "name": "SAIC",
    "description": "<p></p><p><span>SAIC® is a premier Fortune 500® technology integrator solving our nation’s most complex modernization and readiness challenges across the defense, space, federal civilian, and intelligence markets. Our robust portfolio of offerings includes high-end solutions in systems engineering and integration; enterprise IT, including cloud services; cyber; software; advanced analytics and simulation; and training. With an intimate understanding of our customers’ challenges and deep expertise in existing and emerging technologies, we integrate the best components from our own portfolio and our partner ecosystem to rapidly deliver innovative, effective, and efficient solutions.</span></p><p><br></p><p><span>We are a team of 25,500 strong driven by mission, united purpose, and inspired by opportunity. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $7.1 billion. For more information, visit saic.com.</span></p><p></p>",
    "website": "http://www.saic.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/M065MKuiT8zs5fKQzblKO9pvCT1eODkRA9O8dM0e.jpg"
  },
  {
    "name": "FIS",
    "description": "<p></p><p><span>FIS is at the heart of the commerce and financial transactions that power the world’s economy. We are passionate about helping businesses and communities thrive by advancing the way the world pays, banks and invests, serving more than 20,000 clients and more than one million merchant locations in over 130 countries.</span></p><p></p>",
    "website": "http://www.fisglobal.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/6djcga9PocdqAFsazzaRREbEq0CXq2DOvrFjbgGs.jpg"
  },
  {
    "name": "Phase2",
    "description": "<p></p><p><span>Phase2 is a digital agency rooted in technology, passionate about customer experience, and driven by data and insights. We make digital products that inspire, engage, and create impact. Along the way, we guide industry leaders toward what’s next in their digital landscape.</span></p><p><br></p><p><span>Over the last two decades, we’ve grown our presence from coast to coast and offer hubs in the DC metro and the Pacific Northwest. Phase2 also has experts in our Everywhere office with nearly half of our employees working remotely. We are constantly driven by our values with one another and our clients: solve, collaborate, adapt, and create.</span></p><p></p>",
    "website": "http://www.phase2technology.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/4X7dJMXGcaFQOVMrKGyIQhSvgso47xkxTcvgQg5z.png"
  },
  {
    "name": "Red Ventures",
    "description": "<p></p><p><span>Founded in 2000, Red Ventures employs 3,000+ people in 10 cities across the US, Puerto Rico, Brazil, and the UK. We’re made up of dozens of nimble business teams focused on raising the bar, giving back, and challenging what’s possible.</span></p><p><br></p><p><span>Through our portfolio of influential brands, digital platforms, and strategic partnerships, we empower people to make confident decisions about things that matter most to them, whether it's strengthening their mental and physical health, investing, moving, pursuing higher education, traveling the world, or discovering new entertainment.</span></p><p><br></p><p><span>Core to who we are is our focus on giving back. Since 2013, more than 250 Red Ventures employees have volunteered mentorship and skills-training with Road to Hire, a 501(c)(3) founded by CEO Ric Elias, that connects underrepresented young adults with on-ramps to professional development and high-earning careers. Through Road to Hire programs, more than 1,300 hard-working students have found stable careers and financial stability in Charlotte, NC.</span></p><p><br></p><p><span>Learn more about who we are and what we do at www.redventures.com </span></p><p><span>Learn more about Road to Hire at https://roadtohire.org </span></p><p><span>Follow us on Twitter, Instagram and Facebook: @RedVentures</span></p><p></p>",
    "website": "http://www.redventures.com/",
    "location": "SC",
    "logo": "https://cdn.remote.work/companies/sYKNWG5wjs3SpKjQuUBd4oZsPoSzIC8cbAyNCHqz.jpeg"
  },
  {
    "name": "Optimizely",
    "description": "<p></p><p>At Optimizely (Episerver), we're on a mission to help people unlock their digital potential. With our leading digital experience platform (DXP), we equip teams with the tools and insights they need to create and optimize in new and novel ways. Now, companies can operate with data-driven confidence to create hyper-personalized experiences. Building sophisticated solutions has never been simpler. Optimizely’s 900+ partners and 1100+ employees in offices around the globe are proud to help more than 9,000 brands, including Peleton, Uber, AMEX, WSJ, Santander, KLM and Mazda enrich their customer lifetime value, increase revenue and grow their brands.</p><p><br></p><p></p>",
    "website": "https://www.optimizely.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/y58lc96ok73KC0KLHqtOfqCnLD2ou0O7flqo9avA.jpg"
  },
  {
    "name": "Steampunk",
    "description": "<p></p><p>Change is here....Anchored by a startup culture and human-centered delivery approach, Steampunk puts our Federal government clients in the center of everything we design, develop, and deliver to drive game changing mission impacts and user experience.</p><p><br></p><p></p>",
    "website": "https://steampunk.com/",
    "location": "Virginia",
    "logo": "https://cdn.remote.work/companies/QNKOLDgynvdMQnRjWOLuOEeSWB4p71qzAZktKobt.jpeg"
  },
  {
    "name": "Xero",
    "description": "<p></p><p><span>Xero connects you to all things business.</span></p><p><br></p><p><span>Xero provides a beautiful and easy-to-use cloud-based accounting software service for small businesses and their advisors around the world. Xero connects more than two million subscribers with an ecosystem of over 800 third-party apps and 200 plus connections to banks and financial service providers. </span></p><p><br></p><p><span>The IDC MarketScape recognised Xero as a Leader in the Worldwide SaaS and Cloud-Enabled Small Business Finance and Accounting Applications 2020 Vendor Assessment. </span></p><p><span>On the 2020 Financial Times High-Growth Companies Asia Pacific list, Xero was the largest company by revenue to come from New Zealand or Australia. </span></p><p><span>Xero has also been included in the 2020 Bloomberg Gender-Equality Index.</span></p><p></p>",
    "website": "http://www.xero.com/",
    "location": "NZ",
    "logo": "https://cdn.remote.work/companies/TGDPoIcgG7VL5TB9b40EhYP1RdfCUKc014CejFjq.png"
  },
  {
    "name": "Xero",
    "description": "<p></p><p><span>Xero connects you to all things business.</span></p><p><br></p><p><span>Xero provides a beautiful and easy-to-use cloud-based accounting software service for small businesses and their advisors around the world. Xero connects more than two million subscribers with an ecosystem of over 800 third-party apps and 200 plus connections to banks and financial service providers. </span></p><p><br></p><p><span>The IDC MarketScape recognised Xero as a Leader in the Worldwide SaaS and Cloud-Enabled Small Business Finance and Accounting Applications 2020 Vendor Assessment. </span></p><p><span>On the 2020 Financial Times High-Growth Companies Asia Pacific list, Xero was the largest company by revenue to come from New Zealand or Australia. </span></p><p><span>Xero has also been included in the 2020 Bloomberg Gender-Equality Index.</span></p><p></p>",
    "website": "http://www.xero.com/",
    "location": "NZ",
    "logo": "https://cdn.remote.work/companies/TGDPoIcgG7VL5TB9b40EhYP1RdfCUKc014CejFjq.png"
  },
  {
    "name": "Conduent",
    "description": "<p>Conduent delivers mission-critical ​services and solutions on behalf of businesses and governments – creating exceptional outcomes for its clients and the millions of people who count on them. Through people, process and technology, Conduent solutions and services automate workflows, improve efficiencies, reduce costs and enable revenue growth. It’s why most Fortune 100 companies and over 500 government entities depend on Conduent every day to manage their essential interactions and move their operations forward.\n \nConduent’s differentiated services and solutions improve experiences for millions of people every day, including two-thirds of all insured patients in the U.S., 10 million employees who use its HR Services, and nearly nine million people who travel through toll systems daily. Conduent’s solutions deliver exceptional outcomes for its clients including $17 billion in savings from medical bill review of workers compensation claims, up to 40% efficiency increase in HR operations, and up to 40% improvement in processing costs, while driving higher end-user satisfaction.</p>",
    "website": "https://www.conduent.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ztRyntuamyOCdGJ9KtVNwZAB7qVLynr0UKY3XlLo.jpeg"
  },
  {
    "name": "Devoted Health",
    "description": "<p></p><p><span>Devoted Health is a new healthcare company serving seniors.  Our mission is to build a health care plan that treats every member like they were one of our own family.   We are devoted to the health and wellness of our members by helping them navigate the healthcare system with personal guides, by utilizing world-class technology to enable a simplified experience, and by partnering with top providers for better health outcomes. </span></p><p></p>",
    "website": "https://www.devoted.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/oVSq9OcNSiH1CaeevW1B8N2xzb7c7nUuJLXXksbB.png"
  },
  {
    "name": "Neoscape",
    "description": "<p></p><p><span>Neoscape is a creative studio with offices in Boston, New York and San Francisco. Since 1995, we’ve been crafting branded experiences of built environments for discerning clients around the world.</span></p><p><br></p><p><span>Strategy    Branding &amp; Design    Film &amp; 3D    AR/VR/MR    Interactive    Digital Marketing</span></p><p></p>",
    "website": "http://www.neoscape.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/EULJLI536oCjMu1idKSokoKChYHg3ceYbJdzmFYD.jpeg"
  },
  {
    "name": "Athenahealth",
    "description": "<p>athenahealth partners with hospitals and ambulatory customers to drive clinical and financial results. We offer medical record, revenue cycle, patient engagement, care coordination, and population health services. We combine insights from our network of more than 160,000 providers and approximately 117 million patients with deep industry knowledge and perform administrative work at scale.</p>",
    "website": "http://www.athenahealth.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/tmoXFBkIRegyoheFY3v3TIWJRuB16J0rlr1PUpK6.png"
  },
  {
    "name": "BeneLynk",
    "description": "<p></p><p><span>BeneLynk’s integrated approach to impacting Social Determinants of Health serves Managed Care Organizations and their members. Our services drive risk adjusted and quality performance revenue and member retention while helping members to live their healthiest lives. </span></p><p></p>",
    "website": "http://www.benelynk.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/jDCX3T2x1l97IOcf8u1WurQsRzMx9ZaCH3RTaPns.png"
  },
  {
    "name": "Cigna",
    "description": "<p></p><p><span>At Cigna, we're more than a health insurance company. We are your partner in total health and wellness. And we’re here for you 24/7 – caring for your body and mind.</span></p><p><br></p><p><span>As a global health service company, Cigna's mission is to improve the health, well-being, and peace of mind of those we serve by making health care simple, affordable, and predictable.</span></p><p><br></p><p><span>Our values are the core of our culture. Our values guide how all 74,000 of us around the world work together, serve our customers, patients, clients, communities, and deliver on our mission.</span></p><p></p>",
    "website": "http://www.cigna.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/MiY6DYxDjPuNbIQYQYah3DWQfWlJqYJRVaKiCOT5.png"
  },
  {
    "name": "Meduit",
    "description": "<p></p><p><span>Meduit was born out of a drive for excellence and a passion for new ideas for improving revenue cycle management for healthcare organizations and the patients they serve. Today, Meduit is a parent organization where leading RCM companies, including MedA/Rx and Receivables Management Partners (RMP), collaborate to identify and measure best practices, leverage one another's unique strengths, collaborate for results, and serve healthcare clients on a unified solutions platform.</span></p><p></p>",
    "website": "https://www.meduitrcm.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/OcZA7DrReiYzoTCL7DGyDm7TmFGHGAKcyll3NB2x.png"
  },
  {
    "name": "Compassion",
    "description": "<p></p><p><span>Compassion International is a Christian child development ministry aimed at releasing children from spiritual, economic, social and physical poverty in Jesus’ name. </span></p><p><br></p><p><span>We are church-based: Compassion believes the Church is God’s chosen instrument to bring hope to a hurting world.</span></p><p><span>We believe the strategic placement of local churches makes them best suited to address the holistic needs of the children in their communities. And only they can effectively deliver the Jesus-based teaching and whole-life care that children in poverty deserve. Compassion partners with nearly 7,000 churches in 25 countries around the world to deliver our holistic child development program.</span></p><p><br></p><p><span>We are child-focused: Compassion’s ministry is focused on the individual child and his/her development. We offer this assistance irrespective of caste, creed, class or religion. At Compassion, we believe entire communities will feel the positive impact of our presence because what happens in the life of a child ripples throughout his or her environment. </span></p><p><br></p><p><span>We are Christ-centered: Jesus is the core of our ministry and his life and teachings shape our programs. They reflect the spiritual commitments of our staff. And they guide how we love people, respect communities and cooperate with nations.</span></p><p><br></p><p><span>We are committed to integrity: We hold ourselves to the highest professional and biblical principles in all aspects of our ministry and maintain the highest industry standards for our allocation of funds.</span></p><p><br></p><p><span>Compassion and Compassion International are registered trademarks of the United States government.</span></p><p></p>",
    "website": "http://www.compassion.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Jm1PccoxUWTVV7EdmQjslMjghDVWECTXJ9Z5Gr1k.png"
  },
  {
    "name": "Postman",
    "description": "<p></p><p><span>Postman is the collaboration platform for API development, used by 10 million developers and 500,000 companies worldwide. It's an elegant, flexible tool for building connected software via APIs quickly, easily, and accurately. Postman is a global company with headquarters in San Francisco, a large office in Bangalore (where the company was founded), and distributed team members on four continents. Postman is privately held, with funding from Nexus Venture Partners and CRV. Learn more at http://www.postman.com or connect with Postman on Twitter via @getpostman.</span></p><p></p>",
    "website": "http://www.postman.com/",
    "location": "California",
    "logo": "https://cdn.remote.work/companies/NiRf89tPdw1CMWkKP7iA0Q1Wcjt8JfdKth4lZpeH.png"
  },
  {
    "name": "Zimmer Biomet",
    "description": "<p></p><p><span>Zimmer Biomet has been based in Warsaw since it was founded in 1927. Today, Zimmer Biomet has operations in more than 25 countries around the world and sells products in more than 100 countries.</span></p><p><br></p><p><span>Our global team designs, manufactures and markets effective, innovative solutions that support orthopaedic surgeons and clinicians in alleviating pain and improving the quality of life for people  around the world. Our musculoskeletal technologies and a wide range of related products and services make us partners to healthcare providers in more than 100 countries.</span></p><p><br></p><p><span>We're building on a strong history of success to enhance the value we provide to healthcare providers and their patients. Zimmer Biomet maintains world-class scientific facilities and resources and collaborates with leading clinicians and researchers around the world. We share a commitment with healthcare providers to find the best technologies, treatments and solutions to deliver high quality, cost-effective patient care.</span></p><p><br></p><p><span>2020 Military Friendly Employer by VIQTORY</span></p><p><span>2019 Best-in-State Employer in Indiana by Forbes</span></p><p><span>2019 \"Best Places to Work in IT\"​ by ComputerWorld</span></p><p><span>2019 Fortune 500 Company by Fortune</span></p><p><span>2018 \"Best Places to Work in IT\"​ by ComputerWorld</span></p><p></p>",
    "website": "http://www.zimmerbiomet.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/fDFAztHPQKLo40jmFJglZuHWe8LchVlPmPmt9kZ8.png"
  },
  {
    "name": "Truveris",
    "description": "<p></p><p><span>Truveris helps drive transparency, affordability, and access across the pharmacy supply chain – a black box that is increasingly difficult to manage. With Truveris, payers, brokers, and manufacturers find confidence in a transformative strategy that can help navigate the complexities of pharmacy. Our people, process, and platform provide specific, unique and actionable insights to inform decisions, reduce costs, and improve access. Our single mission: to make prescription drugs more affordable and accessible through transparency so people can live healthier lives.</span></p><p><br></p><p><span>Check out our latest showing at HLTH!</span></p><p><span>https://vimeo.com/374482643</span></p><p></p>",
    "website": "http://www.truveris.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/mUMyRzE8DnFi8WiReVwVPrVHF9XAwN6yo2k3FVOX.jpeg"
  },
  {
    "name": "Titanbay",
    "description": "<p></p><p><span>At Titanbay, we believe in the power of private equity returns. Our investment platform enables institutional and private investors to invest in top-tier private equity, venture capital, and real estate funds with low minimums and low fees. With our portfolio construction tools, investors can build sophisticated private equity allocations with unparalleled insight.</span></p><p></p>",
    "website": "https://www.titanbay.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/EMb472IGj4HUv91nN1eFicaPcbHjusiAX3xmgHqI.png"
  },
  {
    "name": "WireWheel",
    "description": "<p></p><p><span>Founded in 2016 by a team of privacy and technology experts, WireWheel is</span></p><p><span>a leader in the privacy and data protection space. Leveraging the team’s deep privacy expertise, WireWheel has developed an easy-to-use software-as-a-service platform that enterprises, including large financial institutions,</span></p><p><span>telecoms, and consumer-facing brands use to manage their privacy programs.</span></p><p><br></p><p><span>Backed by some of the top investors in the country, including PSP Growth, New Enterprise Associates, and the Rise of the Rest Fund, WireWheel has built cutting-edge products in a collaborative environment, and with an expert team.  </span></p><p></p>",
    "website": "http://www.wirewheel.io/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/RljfPAeGAxThEH35XPVloE3UjGcP3lC3ZwQKOOY2.jpg"
  },
  {
    "name": "Sundae",
    "description": "<p></p><p><span>Sundae’s mission is to help homeowners get the best outcome when it’s time to sell a house that needs some love. </span></p><p><br></p><p><span>For far too long, homeowners without the time or resources needed to get a house market-ready have been taken advantage of when it comes time to sell if the house needs some love. We think this isn’t fair and we started Sundae to change this.</span></p><p><br></p><p><span>Sundae offers an alternative to the unpredictability of the traditional real-estate agent sales process. With Sundae you sell as-is, on your timeline. That means you do no clean up, repairs, showings, or any work at all. </span></p><p><br></p><p><span>Sundae was founded by seasoned finance and operations executives who helped build industry-leading technology and marketplace businesses. Together our founding team brings 35+ years of experience in real estate investment.</span></p><p><br></p><p><span>But we’re more than a real estate company. We’re a marketplace looking to bring more value, confidence and convenience to sellers, when they need it most. Joining Sundae means being part of the team that’s bringing compassion and transparency to the business of helping homeowners sell in their time of need. If you’re driven by making a positive impact in people’s lives and want to support our mission, we’d love to hear from you. Check out our open positions at sundae.com/careers</span></p><p></p>",
    "website": "http://www.sundae.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/I3cnVRZvFbO6HKdCppVvcmb0zxaIqp1XpKXm087G.jpg"
  },
  {
    "name": "Zedge",
    "description": "<p></p><p><span>Zedge is a content platform, and global leader in smartphone personalization, with more than 436 million app installs and 30 million monthly active users. </span></p><p><br></p><p><span>Zedge is the # 1 phone personalization app in the world and helps you make sure your phone reflects you.</span></p><p><br></p><p><span>From some of the top musicians in the world to local artists, we have it all on Zedge.</span></p><p></p>",
    "website": "https://careers.zedge.net/",
    "location": "New York",
    "logo": "https://cdn.remote.work/companies/nLCm8oBF7u6weyZrgQtO1iL1YN6kP72rOa9XZoYV.jpg"
  },
  {
    "name": "Roofstock",
    "description": "<p></p><p><span>Roofstock is building the world’s leading real estate investment marketplace. Our mission is to make ownership of investment real estate radically accessible, cost-effective and simple.</span></p><p><span>Our platform lets everyone from first-time investors to global asset managers evaluate, purchase and own residential investment properties with confidence from anywhere in the world. Since launch, we’ve surpassed $2 billion in transactions and continue to disrupt the industry with cutting edge technology and innovations.</span></p><p><span>At Roofstock, we are leveling the playing field by combining the smartest people in the business with the power of artificial intelligence and the efficiencies of institutional scale. We’re building a vibrant, proactive and cost-effective marketplace for real estate investing where the transparency of information is only matched by the ease of transaction.</span></p><p><span>It's a new model where everyone can participate, from anywhere, at any time. Because we believe that building wealth through real estate should be nothing short of radically simple.</span></p><p></p>",
    "website": "http://www.roofstock.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/wwfrui1TMMCvLKDj1pq76Ge3XN3oMdUySxqgm0N9.jpg"
  },
  {
    "name": "Kelly",
    "description": "<p></p><p><span>The world of work is changing, and we get it. The days of staying at one employer for an entire career are over. The next job, chapter in life, and quest for advancement means careers are continually in motion. People are choosing to work in nontraditional ways—temporary, contract, freelance, and as gig workers—to advance their careers and have flexibility to pursue their passions. For employers, the challenge is embracing this modern world of work and rethinking their talent strategy. </span></p><p></p>",
    "website": "https://www.kellyservices.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/zinyKbkMv0n7wVQkDi8sdtMElrG8qj7qMawPQOlk.jpg"
  },
  {
    "name": "Cayuse Holdings",
    "description": "<p></p><p><span>Cayuse Holdings and its subsidiaries employ more than 350 people who are stationed around the United States and overseas. For more information about the company, go to www.cayuseholdings.com. </span></p><p><br></p><p><span>Cayuse Technologies started in 2006 as a strategic alliance between the Confederated Tribes of the Umatilla Indian Reservation and Accenture to create a US-based alternative to offshore delivery centers. </span></p><p><br></p><p><span>Cayuse was expanded in 2018 by adding a holding company, which consists of 10 subsidiary companies, including Cayuse Technologies. Cayuse Holdings is headquartered near Pendleton, Oregon and has a regional office in Honolulu, Hawaii. Cayuse Holdings is wholly owned by the CTUIR and is a foremost provider of certified solutions for both commercial and government customers.</span></p><p><br></p><p><span>Our vision of Grow the People, Grow the Company supports career development and growth for our employees. We provide an excellent benefits package including wellness and 401k match programs.</span></p><p></p>",
    "website": "http://www.cayuseholdings.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ruMFHvwofqlVdwE12hxtP9xPcNHrtFtkpFzOorcM.png"
  },
  {
    "name": "Expel",
    "description": "<p>We create space for you to do what you love about security (even if it's not thinking about it).\n\n**Transparent managed security: 24 x 7 detection, response and resilience**\n\nWe’re eliminating the black box within which managed security service providers (MSSPs) operate. You can see and use the same interface our analysts use to deliver our service. There’s no “internal analyst console.” There’s no curtain to look (or hide) behind. With Expel, if you’re ever wondering what we’re doing for you or want to see how we’re making decisions, you can easily look for yourself and see it all.</p>",
    "website": "https://expel.io/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/6rrAej0cHTFmeSmN66KPuYP27mdaS4PTYdoMoa7H.png"
  },
  {
    "name": "SeedLegals",
    "description": "<p></p><p><span>Start, raise and grow faster with SeedLegals. We're the platform that automates the legals to help companies close funding rounds faster, hire, manage, allocate equity to their team and more...</span></p><p><span>We're the operating system for your company, and we've already transformed the way UK and French startups run their businesses.</span></p><p></p>",
    "website": "http://seedlegals.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/LCyBKGURLX9HSOSzKs9aOjtpJmAGajLSrvhBQEYV.jpg"
  },
  {
    "name": "Discord",
    "description": "<p></p><p><span>Your place to talk. Discord is a voice, video and text communication service to talk and hang out with your friends and communities. Discord was originally created for people who loved to play games, but these passionate people realized it could be enjoyed for more purposes. </span></p><p><br></p><p><span>Today, Discord is used by everyone from local hiking clubs, to art communities, to study groups. Discord has garnered 100 million monthly active users with 4 billion server conversation minutes per day on the platform. That's time spent hanging out together, talking, typing, and belonging on the platform. Discord is now where the world builds relationships with their communities and friends.</span></p><p><br></p><p><span>Discord gives everyone the power to belong. We want to make it easier for you to talk regularly with the people you care about, and diversity and inclusiveness are a critical part of how we get there. Everyone here believes that with diversity comes a better product, better decisions, and a better work environment. </span></p><p><br></p><p><span>We are committed to making Discord representative of the world we want to live and play in, and we've raised over $100M from top VCs like Benchmark, IVP, Spark Capital, Greylock, Greenoaks &amp; Index Ventures to continue these efforts. </span></p><p><br></p><p><span>And we're hiring! Check out https://discordapp.com/jobs for openings.</span></p><p></p>",
    "website": "http://www.discord.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/8NDS8fecyIjczA9zttie8uXvFKK3hJ0duDMU8ocp.jpg"
  },
  {
    "name": "Revolut",
    "description": "<p></p><p><span>When Revolut was founded in 2015, we had a vision to build a sustainable, digital alternative to traditional big banks. Our mission now is to help our customers improve their financial health, empower them to have more control, and promote financial cohesion across the communities in which we operate. </span></p><p><br></p><p><span>In 2019, Revolut was named Deloitte’s fastest growing UK FinTech company. With over 9 million Personal account users, and a quarter of a million Business users, the pace and scale of customer uptake demonstrates the vast need across the globe for better financial services. As our customer base has boomed in the last year, we’ve expanded our team to match that growth. We started 2019 with several hundred employees; we’re closing it out with almost 2000.</span></p><p><br></p><p><span>Revolut is being scaled up by people all around the world who share our vision. We’re looking for people who align with our four core values: we Never Settle, we Get It Done because we Think Deeper and we’re Stronger Together.  </span></p><p><br></p><p><span>So, are you ready to join our revolution?</span></p><p></p>",
    "website": "https://www.revolut.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/tZuthMK6mb1TXYUn6n64PlwzrxrzjxryAy1fq9ul.png"
  },
  {
    "name": "Revolut",
    "description": "<p></p><p><span>When Revolut was founded in 2015, we had a vision to build a sustainable, digital alternative to traditional big banks. Our mission now is to help our customers improve their financial health, empower them to have more control, and promote financial cohesion across the communities in which we operate. </span></p><p><br></p><p><span>In 2019, Revolut was named Deloitte’s fastest growing UK FinTech company. With over 9 million Personal account users, and a quarter of a million Business users, the pace and scale of customer uptake demonstrates the vast need across the globe for better financial services. As our customer base has boomed in the last year, we’ve expanded our team to match that growth. We started 2019 with several hundred employees; we’re closing it out with almost 2000.</span></p><p><br></p><p><span>Revolut is being scaled up by people all around the world who share our vision. We’re looking for people who align with our four core values: we Never Settle, we Get It Done because we Think Deeper and we’re Stronger Together.  </span></p><p><br></p><p><span>So, are you ready to join our revolution?</span></p><p></p>",
    "website": "https://www.revolut.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/tZuthMK6mb1TXYUn6n64PlwzrxrzjxryAy1fq9ul.png"
  },
  {
    "name": "Figma",
    "description": "<p></p><p><span>Figma is the first professional-grade online tool created specifically for interface design. Born on the Web, Figma helps the entire product team create, test, and ship better designs, faster.</span></p><p></p>",
    "website": "http://figma.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/ai8kmBxjttGVHqRUHvVKMvFJXFAi443gNDeN7A7A.jpeg"
  },
  {
    "name": "KONG",
    "description": "<p></p><p><span>Kong Inc. is a cloud connectivity company. Powering connections to build a reliable world.</span></p><p><br></p><p><span>We are best known as the creator and primary supporter of Kong, the most widely adopted open-source Microservice API gateway. We’re backed by a16z, Index Ventures, CRV, Jeff Bezos (Amazon), Eric Schmidt (Google), Stanford University, NEA and many others. </span></p><p><br></p><p><span>Join our team to connect the future of infrastructure.</span></p><p></p>",
    "website": "http://www.konghq.com/",
    "location": "California",
    "logo": "https://cdn.remote.work/companies/Gt78pXFnNenjxdrkQqfZcuigiac17vBivVbULCaS.jpeg"
  },
  {
    "name": "Doxel",
    "description": "<p></p><p><span>Landing a construction project on schedule and on budget is a herculean task– different teams, different designs, every single time. With hundreds of thousands of variables changing everyday, optimizing construction outcomes has gone past the point of human cognition. </span></p><p><br></p><p><span>Doxel is here to change that.</span></p><p><span> </span></p><p><span>Doxel is a Real Time Construction Optimization Platform. By contextualizing vast amounts of disparate project data across site, BIM, schedule, and budget, Doxel empowers teams with an objective view of their project today and an accurate prediction of where it will be tomorrow. Leveraging machine generated and prioritized risk analysis, teams are guided to the right problems in order to stay ahead of cost overruns, schedule delays, and quality issues. </span></p><p><br></p><p><span>Backed by Andreessen Horowitz and with a growing team of technologists, creatives, and industry veterans, we're focused on helping customers realize the best outcomes on their construction projects.</span></p><p></p>",
    "website": "http://doxel.ai/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/fzpGqo0dDdQsqT4ZBjwxGdJJGo2MWHZ6TTlsh3wi.jpg"
  },
  {
    "name": "Anaplan",
    "description": "<p>Anaplan is driving a new age of connected planning. Large and fast-growing organizations use Anaplan’s cloud platform in every business function to make better-informed plans and decisions and drive faster, more effective planning processes.</p>",
    "website": "http://www.anaplan.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/LEo2Hwd1GGJe7GjtWAWtErGdfMk0F2YbF69ja51w.png"
  },
  {
    "name": "Beamery",
    "description": "<p></p><p><span>Beamery's Talent Operating System (TOS) is the backbone of the modern enterprise. It allows talent functions to drive strategic transformation, reach diversity recruiting targets, identify and engage potential high performers, optimize the end-to-end talent experience, and identify the skills and capabilities they need to build their workforce of the future.</span></p><p></p>",
    "website": "https://beamery.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/Old0Xb2KlsizFZYmJCroZNyTahXCb7GDRfEui173.jpg"
  },
  {
    "name": "Huckleberry Labs",
    "description": "<p></p><p><span>Having experienced first-hand the toll of sleep deprivation and the lack of tailored and accessible help for parents, we set out to solve this problem in a new way with a team of sleep experts and data scientists.</span></p><p><span>Huckleberry's first product gets kids from newborns to 5 years old sleeping better and longer. After understanding your child's sleep scenario, our algorithms and sleep experts determine what will work for your situation. </span></p><p><span>Possible to achieve this without leaving your child to cry or medicating them? Yes indeed.</span></p><p></p>",
    "website": "https://huckleberrycare.com/",
    "location": "CA US",
    "logo": "https://cdn.remote.work/companies/x7VRaiRXiPMe5m1BpFNpsPtkNA8Q8XCT8ciuzEOM.png"
  },
  {
    "name": "StockX",
    "description": "<p></p><p><span>Come change the game.</span></p><p><br></p><p><span>We’re a live marketplace for buying and selling limited-edition sneakers, watches, bags, streetwear, trading cards, and collectibles. From Yeezy and Louis Vuitton to Rolex and Supreme, StockX has you covered, giving you unprecedented access to the ‘new luxury’ economy.</span></p><p><br></p><p><span>Our company values are broken down into what we call the Four T’s: Trucks. Trenches. Transparency. Transformation. They stand for making deadlines, being a team player, over-communicating everything, and turning everyone we work with into die-hard StockX fans. Each is a foundational tenet of not just our business, but the entire StockX culture. And as such they are an embodiment of what has made StockX one of the fastest-growing startups in the country.</span></p><p></p>",
    "website": "https://stockx.com/",
    "location": "Michigan US",
    "logo": "https://cdn.remote.work/companies/kMNAobQm5bA47eYcbzMOy4pFgbB7ecaANxCLt2uD.jpeg"
  }
]