[
  {
    "name": "Deloitte",
    "description": "<p></p><p>Deloitte drives progress. Our firms around the world help clients become leaders wherever they choose to compete. Deloitte invests in outstanding people of diverse talents and backgrounds and empowers them to achieve more than they could elsewhere. Our work combines advice with action and integrity. We believe that when our clients and society are stronger, so are we.&nbsp;</p><p></p>",
    "website": "https://www2.deloitte.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/5ZRUkjWFeMQiy5oqbOYXYNqbqmxcjKdxvlF2o90u.jpeg"
  },
  {
    "name": "WhiteHat Security",
    "description": "<p></p><p><span>WhiteHat Security is the leading advisor for application security with the most comprehensive platform powered by artificial and human intelligence. Trusted for nearly two decades by Fortune 500 organizations, WhiteHat Security helps organizations accelerate their digital future in our application-driven world. </span></p><p><br></p><p><span>The company is an independent, wholly-owned subsidiary of NTT Ltd. and is based in San Jose, California, with regional offices across the U.S. and Europe. For more information, visit www.whitehatsec.com.</span></p><p></p>",
    "website": "https://www.whitehatsec.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ABFjr7jx5ssFHIHdDcPK7c7dCeLYaatKydgeJMMq.jpg"
  },
  {
    "name": "Pearson",
    "description": "<p></p><p>We are the world’s learning company with more than 22,500 employees operating in 70 countries. We provide content, assessment and digital services to learners, educational institutions, employers, governments and other partners globally. We are committed to helping equip learners with the skills they need to enhance their employability prospects and to succeed in the changing world of work. We believe that wherever learning flourishes so do people.</p><p><br></p><p></p>",
    "website": "http://www.pearson.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/AlPEs7GcTapaUCdXShExE4xTAps9MHDwpx9BLP6L.png"
  },
  {
    "name": "Akraya",
    "description": "<p></p><p><span>Akraya is a preferred vendor for IT consulting and staffing services for many leading technology-based companies across the US. We've accomplished this for one simple reason. Our clients trust us. Our consultants believe in us. And our employees are laser-focused on empowering both to succeed. </span></p><p><br></p><p><span>Our services include MSP and VMS Staffing, Consulting Services, Diversity Recruiting, Payroll and Pass-Through.</span></p><p><br></p><p><span>We are community-conscious, sensitive to our environment, and devoted to human causes. We believe every human being has a right to clean air, water, food, and education without exception. Each of our employees hold one or more social causes dear and is empowered to contribute time, company-matched resources, and effort to them.</span></p><p></p>",
    "website": "https://www.akraya.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/2EHTCi3KWVozRrH6XB9QXypuit7dXBm38ea7fq9A.jpeg"
  },
  {
    "name": "Mobiquity Inc.",
    "description": "<p>Mobiquity is a digital consultancy that partners with the world's leading brands to design and deliver compelling digital products and services for their customers. Our approach balances human needs with usefully applied technology, unbound creativity with research and analytics, and agile development with strict engineering and security standards. We blend teams of consultants, analysts, designers, developers, and data scientists together to consider every dimension of a digital business.\n\nWe work closely with clients to understand, apply and engage technology in meaningful ways for both people and businesses. Our end-to-end services span marketing to IT, providing strategy, experience design, product engineering, cloud services and analytics.\n\nWe are an AWS Partner Network (APN) Premier Consulting Partner and have worked with AWS since 2011 to deliver 100% cloud-based innovation to its clients. Mobiquity leverages AWS tools and services to design and build secure, cloud-native solutions across web, mobile, IoT, chat and call center.</p>",
    "website": "http://www.mobiquity.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/N5D34eOyxwqOc9rdIWIgfU93DAmobtriSeSltUVP.png"
  },
  {
    "name": "JumpCrew",
    "description": "<p></p><p>JumpCrew is an outsourced sales and marketing partner. We partner with our clients to accelerate their revenue by building awareness, driving leads, and converting sales.</p><p>If your business would benefit from enhanced brand awareness, lead generation, or sales support and management, JumpCrew is the solution for you.&nbsp;Contact us to discuss your goals!</p><p>JumpCrew is headquartered in Nashville.</p><p></p>",
    "website": "https://www.jumpcrew.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/TuL8RDieAUwnW6oLer1lzupHMvqECj121zcIDwIw.jpg"
  },
  {
    "name": "Medium",
    "description": "<p></p><p><span>Medium's mission is to deepen readers'​ understanding of the world and to empower writers to share their best work and biggest ideas. We're a tight-knit group of 90 employees obsessing over our product that reaches 90 million readers every month. We're building a subscription publishing platform that connects expert writers with thoughtful readers, and we're growing fast.</span></p><p><br></p><p><span>Our product allows the best ideas to rise to the top and elevates the most passionate, diverse voices. Our company culture reflects the same values. We encourage employees to speak their mind, always do what's right for our users, and take ownership of their projects. We move quickly to get our ideas into the world, working in small, empowered teams, as we try to build a better place on the internet for ideas.</span></p><p></p>",
    "website": "https://medium.com/",
    "location": "California",
    "logo": "https://cdn.remote.work/companies/wEHZIS27R8tfFLuJhr7YypQeSvCgxLWSgGVRuqQ3.png"
  },
  {
    "name": "Lime",
    "description": "<p></p><p>Lime is revolutionizing micro mobility and empowering a new urban lifestyle. The mobile app lets riders easily find and unlock our fleet of shared smart bikes and scooters, providing them with a fun, efficient and sustainable way to move around the city. By partnering with local communities, Lime is working to not only improve transportation, but cultivate a culture centered around active, healthy and sustainable urban living. Lime is based in San Francisco, CA, and is funded by leading VC firms including Google Ventures, Fifth Wall and Andreessen Horowitz.</p><p><br></p><p></p>",
    "website": "http://li.me/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/FqE3EVep87E5FuOVjDl3wFOEWfqBBy5BhqZFBksW.jpg"
  },
  {
    "name": "Micro Focus",
    "description": "<p></p><p><span>From mainframe to mobile, we have the portfolio depth and breadth to cover challenges across DevOps, Hybrid IT, Security &amp; Risk, and Predictive Analytics.</span></p><p><br></p><p><span>We are a pure-play software company focused from the ground up on building, selling, and supporting software. This focus allows us to deliver on our mission to put customers at the center of innovation and deliver high-quality, enterprise-grade scalable software that our teams can be proud of. We help customers bridge the old and the new by maximizing the ROI on existing software investments and enabling innovation in the new hybrid model for enterprise IT. </span></p><p></p>",
    "website": "http://www.microfocus.com/",
    "location": "Berkshire",
    "logo": "https://cdn.remote.work/companies/2gtOolpVMJgfJrtkRIjm3YgSxQwIonAFZx3cWAlo.jpeg"
  },
  {
    "name": "Vacasa",
    "description": "<p></p><p><span>Vacasa is North America’s largest vacation rental management platform. We opened our doors in 2009 with a vision to drive unbeatable revenue for our homeowners and unforgettable experiences for our guests. </span></p><p><span>Today, we provide full-service care for more than 25,000 vacation homes in some of the most desirable vacation destinations across the world. </span></p><p><span>From laid-back beach cottages along the Oregon Coast to grand ski chalets in Vail to luxury apartments in Chicago, we match every guest with their perfect vacation rental. </span></p><p></p>",
    "website": "http://www.vacasa.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/nygYxMIsgRsQpkenvbIU4019NDot52VfuLXV2P9x.jpg"
  },
  {
    "name": "WebstaurantStore",
    "description": "<p></p><p><span>Since our start in 2004, WebstaurantStore.com has succeeded in creating and fostering an innovative, easy-to-use website that meets the purchasing needs of foodservice professionals throughout the world. Our six warehouses located across the United States mean that we are able to serve both North American and international customers with great speed – many items located in our warehouses are ready to ship within one business day! </span></p><p></p>",
    "website": "https://www.webstaurantstore.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/LYGxY6ODGTYvtgnxLf06LQnPxtnr8ypes6B2rurN.png"
  },
  {
    "name": "Tyler Technologies",
    "description": "<p></p><p><span>Tyler Technologies (NYSE: TYL) is a leading provider of end-to-end information management solutions and services for local governments. Tyler partners with clients to empower the public sector - cities, counties, schools and other government entities - to become more efficient, more accessible and more responsive to the needs of their constituents. Tyler’s client base includes more than 15,000 local government offices in all 50 states, Canada, the Caribbean, Australia, and other international locations. In 2017, Forbes ranked Tyler on its “Most Innovative Growth Companies” list, and Fortune included Tyler on its “100 Fastest-Growing Companies” list. More information about Tyler Technologies, headquartered in Plano, Texas, can be found at www.tylertech.com.</span></p><p><br></p><p><span>Tyler Technologies is proud to be an equal opportunity employer. All qualified applicants will receive consideration without regard to race, creed, gender/sex, marital status, sexual orientation, citizenship status, color, religion, national origin, age, disability, veteran status, or any other status protected under local, state or federal laws.</span></p><p></p>",
    "website": "http://www.tylertech.com/",
    "location": "TX",
    "logo": "https://cdn.remote.work/companies/PzsnDfu1jkrnHHjWM9QKkwJx3HbMVEmhfIOKWnfk.png"
  },
  {
    "name": "Siege Media",
    "description": "<p></p><p><span>As a content marketing agency with a specialty in SEO, we create and promote content that ranks, and also helps you rank. With offices in San Diego, CA and Austin, TX, we have a national reach and help some of the biggest and best brands on the web. We were named to the Inc 5000 in both 2017 and 2018. In 2018, we were also named one of Inc's \"Best Workplaces\"​. </span></p><p></p>",
    "website": "http://www.siegemedia.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/aDeHSl3VtUhTDlgaGE3ostNOI76Yx22IZ2u5xK9Y.png"
  },
  {
    "name": "The Dyrt",
    "description": "<p></p><p><span>The Dyrt is the fastest-growing camping app and publication in America.</span></p><p><br></p><p><span>Searching for campsites online should be fun. We give you a ground-level view of campsites through reviews, photos and videos. We want you to be able to share your favorite campgrounds with others, find new camping experiences through The Dyrt community, and make more memories.</span></p><p></p>",
    "website": "https://thedyrt.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/SwyP3iemDgZ3bBq6R1hp4QhYMADSIPkuVK0KfPSM.png"
  },
  {
    "name": "Crowe",
    "description": "<p></p><p><span>Crowe LLP is a public accounting, consulting and technology firm with offices around the world. Crowe uses its deep industry expertise to provide audit services to public and private entities. The firm and its subsidiaries also help clients make smart decisions that lead to lasting value with its tax, advisory and consulting services. Crowe is recognized by many organizations as one of the best places to work in the U.S. As an independent member of Crowe Global, one of the largest global accounting networks in the world, Crowe serves clients worldwide. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.</span></p><p></p>",
    "website": "http://www.crowe.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/muz1zsl5BueWsepTCvli3DK2S8GUCMQDHe8hGhmX.jpg"
  },
  {
    "name": "Veeva Systems",
    "description": "<p></p><p>Veeva Systems Inc. is a leader in cloud-based software for the global life sciences industry. Committed to innovation, product excellence, and customer success, Veeva has more than 800 customers, ranging from the world's largest pharmaceutical companies to emerging biotechs. Veeva is headquartered in the San Francisco Bay Area, with offices in Canada, Europe, Asia, and Latin America.</p><p><br></p><p></p>",
    "website": "http://www.veeva.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/SjKchgrEdU03zIqmG38Bv5wj7gcJdVgaoNxdEU2A.png"
  },
  {
    "name": "Blackbaud",
    "description": "<p></p><p><span>Blackbaud (NASDAQ: BLKB) is the world’s leading cloud software company powering social good. Serving the entire social good community—nonprofits, foundations, corporations, education institutions, healthcare institutions and individual change agents—Blackbaud connects and empowers organizations to increase their impact through software, services, expertise, and data intelligence. </span></p><p><br></p><p><span>The Blackbaud portfolio is tailored to the unique needs of vertical markets, with solutions for fundraising and CRM, marketing, advocacy, peer-to-peer fundraising, corporate social responsibility, school management, ticketing, grantmaking, financial management, payment processing, and analytics. Serving the industry for more than three decades, Blackbaud is headquartered in Charleston, South Carolina and has operations in the United States, Australia, Canada, and the United Kingdom.</span></p><p></p>",
    "website": "http://www.blackbaud.com/",
    "location": "South Carolina",
    "logo": "https://cdn.remote.work/companies/6Jmk0gu2TdCLPRoaeslY1KHFV82xL2GzRPYRfyea.png"
  },
  {
    "name": "Anthem, Inc.",
    "description": "<p></p><p>At Anthem, Inc., we believe that our health connects us all. So we focus on being a valued health partner and delivering quality products and services that give members access to the care they need. With more than 100 million people served by our affiliated companies including approximately 40 million enrolled in our family of health plans, we can make a real difference to meet the needs of our diverse customers.</p><p></p>",
    "website": "http://antheminc.com/",
    "location": "Indiana",
    "logo": "https://cdn.remote.work/companies/dhT4esYBoRcaEdqj6CUiCmuyiSCTieMlSy7z02OY.jpeg"
  },
  {
    "name": "Nuvento",
    "description": "<p></p><p><span>Nuvento, a ubiquitous niche boutique tech-consulting and advisory firm took shape in 2007. We specialize in Software design, and development, Information Management, Business Intelligence,Data Management, Reporting, Analytics. Headquartered in Overland Park, Kansas with offices in Cranbury, New Jersey and Cochin, India, Nuvento is continuously expanding and making its presence felt globally.</span></p><p><br></p><p><span>We continuously generate immense value through our unique delivery models based on Centers of Excellence (CoE) that focus on Business Intelligence with specialization in OBIEE, Microsoft BI, Insurance BI, Telecom BI, Social Media Analytics, Janrain (CIAM /GDPR), AI using Azure, Chatbots / RPA using AWS/Azure, Office 365/ SharePoint, Data Analytics, Google Cloud/ Big Query/ Predictive API.</span></p><p><br></p><p><span>Our pre-packaged product suite, BI Report Center (Web based OLAP Reporting platform using SSAS), ETL Center (Web based ETL Management Framework for SSIS), Implementation frameworks like Task Bolt (Open Source Portfolio Management Methodology), as well as expert SharePoint implementation consulting and development continuously develop and deliver client-specific products and services at a greater pace across the globe. We have a track record of industry subject matter expertise within the fields of telecom, engineering, insurance, finance, and logistics which is proven.</span></p><p><br></p><p><span>Our team has varied expertise in Telecom, Architecture, Insurance, Technology, Analytics (predictive modeling, sentiment analysis etc.) and Quality Assurance. We have delivered measurable and solid results to clients with more than 20 unique BI implementations and more than 10 unique Product engineering initiatives across North America and the Asia Pacific region.</span></p><p></p>",
    "website": "https://nuvento.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/egh889eWROfyPYkVsam1BsM5IuAl09PP1fdnv9gy.png"
  },
  {
    "name": "Ascensus",
    "description": "<p>We work hard every day to help millions of Americans save for what matters—retirement, education, and healthcare. This is both our passion and expertise. Through partnerships with financial institutions and financial professionals, our savings plans are designed to be smart, clear, personal, and most of all, effective. \n\nWe are the largest independent retirement and college savings services provider in the United States, supporting approximately 105,600 retirement plans, 4.7 million 529 college savings accounts, and administering more than 1.7 million IRAs and health savings accounts.\n\nWhen you choose Ascensus as a partner or a service provider, rest assured, you will always have a plan.</p>",
    "website": "http://www.ascensus.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/LCmcwpkkm2viIeZgzoSIzy7yIACPoceaFcWCwOlL.png"
  },
  {
    "name": "WebstaurantStore",
    "description": "<p></p><p><span>Since our start in 2004, WebstaurantStore.com has succeeded in creating and fostering an innovative, easy-to-use website that meets the purchasing needs of foodservice professionals throughout the world. Our six warehouses located across the United States mean that we are able to serve both North American and international customers with great speed – many items located in our warehouses are ready to ship within one business day! </span></p><p></p>",
    "website": "https://www.webstaurantstore.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/LYGxY6ODGTYvtgnxLf06LQnPxtnr8ypes6B2rurN.png"
  },
  {
    "name": "Hopper",
    "description": "<p></p><p><span>Hopper is the smart way to book travel on your phone. Combining massive amounts of data and advanced machine learning algorithms, Hopper predicts and analyzes airfare and accommodation to save users money and enable them to travel more often.</span></p><p></p>",
    "website": "http://www.hopper.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/7ivOpSZZYIlw7mZftYoxNrM4fcUloN6G9YPBSBew.png"
  },
  {
    "name": "Couchbase",
    "description": "<p></p><p>Unlike other NoSQL databases, Couchbase provides an enterprise-class, multicloud to edge database that offers the robust capabilities required for business-critical applications on a highly scalable and available platform. Couchbase is built on open standards, combining the best of NoSQL with the power and familiarity of SQL, to simplify the transition from mainframe and relational databases. </p><p><br></p><p></p>",
    "website": "http://www.couchbase.com/",
    "location": "California",
    "logo": "https://cdn.remote.work/companies/ReMvR8jsCD5aBzbeSXMm0QkS4wcvKTpFBcu97NVR.jpeg"
  },
  {
    "name": "Ferguson",
    "description": "<p></p><p><span>Ferguson is a diverse distributor with operations spanning multiple business groups. The company is the largest wholesale distributor of residential and commercial plumbing supplies and pipe, valves and fittings in the U.S. The company is also a major distributor of HVAC/R equipment, waterworks and industrial products and services.</span></p><p></p>",
    "website": "http://www.ferguson.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/sGI0HFi06EtzvTyFcI5Cj1A6eHayZaEV4MSj0nP7.jpg"
  },
  {
    "name": "Under Armour",
    "description": "<p></p><p><span>Under Armour has one mission: to make you better. The Brand was created on a football field in 1996 when University of Maryland special teams captain Kevin Plank looked down at his heavy, sweaty cotton T-shirt and thought: there has got to be something better. So, he made a T-shirt that keeps you cool, light, and dry, so you can push yourself further. And it changed the way athletes dress forever.</span></p><p></p>",
    "website": "https://www.underarmour.com/en-us/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Z294AGum4YZzKxBMETQFSVlPtdTcSLfojcdjEUsQ.png"
  },
  {
    "name": "GHX",
    "description": "<p></p><p><span>GHX is a software-as-a-service company that’s reducing the cost of doing business in healthcare by automating supply chain processes and improving visibility into the products used in patient care. We’ve built the GHX Global Network, the world’s largest community of healthcare trading partners, connecting supply chain, finance and clinical professionals with their suppliers. Our cloud-based technology makes it easier for customers to drive costs out of the healthcare supply chain. Since 2010, we’ve saved the healthcare industry $5+ billion. Today we’re expanding our solutions to further enhance data management and allow integration of clinical and business systems.</span></p><p><br></p><p><span>The Industry We Serve</span></p><p><span>Our focus is on the healthcare supply chain, through which hospitals and their suppliers buy and deliver the thousands of medical-surgical supplies that clinicians need to effectively care for patients. For most hospitals, supply chain costs are the second largest and fastest growing operational expense, so reining in these costs is imperative. </span></p><p><br></p><p><span>Our Products and Services</span></p><p><span>At the heart of GHX is the GHX Exchange, a platform that connects healthcare providers and suppliers so they can work together electronically. This helps lower costs and simplifies supply chain management by eliminating error-prone, manual order processes. </span></p><p><br></p><p><span>GHX solutions include:</span></p><p><span>•\tAn open and neutral electronic trading exchange</span></p><p><span>•\tProcurement and accounts payable automation</span></p><p><span>•\tContent, contract and inventory management</span></p><p><span>•\tBusiness intelligence and reporting</span></p><p><span>•\tStandards enablement and data synchronization</span></p><p></p>",
    "website": "http://www.ghx.com/",
    "location": "CO",
    "logo": "https://cdn.remote.work/companies/ZLPnRedg7rOcHA1pJEJvlPpb3xM2BQvuPTBDWAC7.png"
  },
  {
    "name": "Hyland",
    "description": "<p></p><p>Hyland is a leading content services provider that enables thousands of organizations to deliver better experiences to the people they serve. With more than 3,000 employees around the world, Hyland is widely known as both a great company to work for and a great company to do business with.</p><p><br></p><p></p>",
    "website": "https://www.hyland.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Q32GypV9UgEmMmLS5HwWnYPYEU4pPAVAGDE0vi2i.png"
  },
  {
    "name": "Ease",
    "description": "<p></p><p><span>Ease, Inc. - A concierge approach to remote talent management. Connecting the most talented people with the remote opportunities they were meant for.’ The first Remote talent community to use psychometric and cognitive assessments to match you with talent that’s the best for your success.</span></p><p><br></p><p><span>Our cloud-based workforce solution helps businesses manage their independent contractors and freelance workforce all in one place in addition to providing access to the top software developers, designers, copywriters, and digital strategists in the industry. </span></p><p><br></p><p><span>Ease offers a screened database of premium talent through a cloud-based workforce solution tool. This tool allows both the business and the freelancer to manage every step of the process in one place and from anywhere in the world.</span></p><p></p>",
    "website": "http://www.itsease.com/",
    "location": "WI",
    "logo": "https://cdn.remote.work/companies/IWAVDJjULRKvsxOZLICQjCxSlz2345nVH4locWMU.png"
  },
  {
    "name": "1Password",
    "description": "<p></p><p><span>Trusted by more than 60,000 businesses to protect their data, 1Password gives you complete control over passwords and other sensitive business information. </span></p><p><br></p><p><span>As an integral layer of the Identity and Access Management (IAM) stack, 1Password protects all employee accounts – even those you aren’t aware of. Give employees secure access to any app or service and safely share everything you need to work together – including logins, documents, credit cards, and more – while keeping everything else private.</span></p><p><br></p><p><span>1Password is easy to deploy and integrates with Azure AD, Okta, OneLogin, and Slack, so you can automatically provision employees using the systems you already trust. It’s simple to manage and fits seamlessly into your team’s workflow, so you can secure your business without compromising productivity.</span></p><p></p>",
    "website": "https://1password.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/ibGmDsSUvOeNAFveI7lW3stbkrfppkO80jcxPaJb.png"
  },
  {
    "name": "Khoros",
    "description": "<p></p><p>Khoros, formerly Spredfast + Lithium, is the leading customer engagement platform built to turn siloed knowledge into enterprise value, and customers into contributors. By connecting consumer insights across all departments, Khoros gives companies the ability to run their business with their customers, anticipating their needs, accelerating sales, loyalty, and innovation. With 2,000+ customers and 10 offices globally, Khoros powers approximately 500 million digital interactions every day. From social media to online communities and messaging to digital customer care, Khoros helps companies authentically connect with customers throughout their journey.</p><p><br></p><p></p>",
    "website": "https://www.khoros.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/960frue6zx5wn7x4Rb72Xrhzf8pwGe76r1fsW1e2.png"
  },
  {
    "name": "Medable",
    "description": "<p></p><p><span>Medable's mission is to get effective therapies to patients faster. We provide an end-to-end, global cloud platform with a flexible suite of tools that allows sponsors, patients, providers &amp; CRO's to work together as a team in clinical trials. Our solutions enable more efficient clinical research, more effective healthcare delivery, and more accurate precision and predictive medicine. </span></p><p></p>",
    "website": "http://medable.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Q0p05sxvPzZTHIZZslDS60bH6azDsW9NbQwYWCjJ.png"
  },
  {
    "name": "Zimmer Biomet",
    "description": "<p></p><p><span>Zimmer Biomet has been based in Warsaw since it was founded in 1927. Today, Zimmer Biomet has operations in more than 25 countries around the world and sells products in more than 100 countries.</span></p><p><br></p><p><span>Our global team designs, manufactures and markets effective, innovative solutions that support orthopaedic surgeons and clinicians in alleviating pain and improving the quality of life for people  around the world. Our musculoskeletal technologies and a wide range of related products and services make us partners to healthcare providers in more than 100 countries.</span></p><p><br></p><p><span>We're building on a strong history of success to enhance the value we provide to healthcare providers and their patients. Zimmer Biomet maintains world-class scientific facilities and resources and collaborates with leading clinicians and researchers around the world. We share a commitment with healthcare providers to find the best technologies, treatments and solutions to deliver high quality, cost-effective patient care.</span></p><p><br></p><p><span>2020 Military Friendly Employer by VIQTORY</span></p><p><span>2019 Best-in-State Employer in Indiana by Forbes</span></p><p><span>2019 \"Best Places to Work in IT\"​ by ComputerWorld</span></p><p><span>2019 Fortune 500 Company by Fortune</span></p><p><span>2018 \"Best Places to Work in IT\"​ by ComputerWorld</span></p><p></p>",
    "website": "http://www.zimmerbiomet.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/fDFAztHPQKLo40jmFJglZuHWe8LchVlPmPmt9kZ8.png"
  },
  {
    "name": "Under Armour",
    "description": "<p></p><p><span>Under Armour has one mission: to make you better. The Brand was created on a football field in 1996 when University of Maryland special teams captain Kevin Plank looked down at his heavy, sweaty cotton T-shirt and thought: there has got to be something better. So, he made a T-shirt that keeps you cool, light, and dry, so you can push yourself further. And it changed the way athletes dress forever.</span></p><p></p>",
    "website": "https://www.underarmour.com/en-us/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Z294AGum4YZzKxBMETQFSVlPtdTcSLfojcdjEUsQ.png"
  },
  {
    "name": "Medable",
    "description": "<p></p><p><span>Medable's mission is to get effective therapies to patients faster. We provide an end-to-end, global cloud platform with a flexible suite of tools that allows sponsors, patients, providers &amp; CRO's to work together as a team in clinical trials. Our solutions enable more efficient clinical research, more effective healthcare delivery, and more accurate precision and predictive medicine. </span></p><p></p>",
    "website": "http://medable.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Q0p05sxvPzZTHIZZslDS60bH6azDsW9NbQwYWCjJ.png"
  },
  {
    "name": "One Call Care",
    "description": "<p></p><p>We are passionate innovators providing comprehensive workers'​ compensation solutions. From our people to our products to our customers, we work to deliver the best possible outcomes by taking patients from Injured to Empowered. Follow our patient's journey's at https://onecallcm.com/about/empowered and learn how working with us gives you the ability to empower injured workers to return to work and life.</p><p><br></p><p>Join our team: https://onecallcm.com/about/careers</p><p><br></p><p></p>",
    "website": "https://onecallcm.com/",
    "location": "FL",
    "logo": "https://cdn.remote.work/companies/YdpfObtKulvxsPgZXNagxNOMY81rabYcgJeOnCrW.png"
  },
  {
    "name": "Root Insurance",
    "description": "<p></p><p>Simple pricing. Fair rates. All in an app.</p><p><br></p><p></p>",
    "website": "http://joinroot.com/",
    "location": "Not Listed",
    "logo": "https://cdn.remote.work/companies/livlHqvlrcvcbdh53FpYhUyJz0wVCiymG2EdYh2d.png"
  },
  {
    "name": "LendingTree",
    "description": "<p></p><p><span>LendingTree (NASDAQ: TREE) is the nation's leading online marketplace that connects consumers with the choices they need to be confident in their financial decisions. LendingTree empowers consumers to shop for financial services the same way they would shop for airline tickets or hotel stays, comparing multiple offers from a nationwide network of over 500 partners in one simple search, and can choose the option that best fits their financial needs. Services include mortgage loans, mortgage refinances, auto loans, personal loans, business loans, student refinances, credit cards and more. Through the My LendingTree platform, consumers receive free credit scores, credit monitoring and recommendations to improve credit health.</span></p><p></p>",
    "website": "https://www.lendingtree.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/HmIfLFJIuHBzlP0UdySYxy3Ksf7EPANQjWteiDmx.jpg"
  },
  {
    "name": "Cella",
    "description": "<p></p><p>Cella is an award-winning leader in consulting, staffing and managed solutions for creative, marketing, digital and proposal development teams. We help people build meaningful careers and partner with companies to help them win. Our secret sauce? The Cella trifecta: we have the right people, we understand our clients and we deliver results. Success requires a partner who offers all three. Together, we put passion to work.</p><p><br></p><p></p>",
    "website": "http://www.cellainc.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/5GDDzebeSzkXenza7PCoa9TajgCjsRm3a01vssGe.jpeg"
  },
  {
    "name": "Lenovo",
    "description": "<p></p><p><span>Lenovo (HKSE: 992) (ADR: LNVGY) is a US$50 billion Fortune Global 500 company, with 57,000 employees and operating in 180 markets around the world.  Focused on a bold vision to deliver smarter technology for all, we are developing world-changing technologies that create a more inclusive, trustworthy and sustainable digital society. By designing, engineering and building the world’s most complete portfolio of smart devices and infrastructure, we are also leading an Intelligent Transformation – to create better experiences and opportunities for millions of customers around the world. </span></p><p></p>",
    "website": "http://www.lenovo.com/",
    "location": "CN",
    "logo": "https://cdn.remote.work/companies/wP7culfQmI6qPW7uLL444EiPvbKSITfXMsSgQ6bq.jpg"
  },
  {
    "name": "Epsilon",
    "description": "<p></p><p>Positioned at Publicis Groupe's core, Epsilon is a leader in interaction management, empowering brands to transform ordinary customer experiences into meaningful, human experiences. Through a connected suite of products and services Epsilon combines leading-edge identity management, industrial strength data and technology expertise with big brand acumen gained over five decades working with the industry’s top brands. Our human-powered, data-led marketing delivers unmatched depth, breadth and scale to help brands turn meaningful human interactions into exceptional business outcomes. For more information, visit www.epsilon.com. Follow us on Twitter at @EpsilonMktg.</p><p><br></p><p></p>",
    "website": "http://www.epsilon.com/",
    "location": "Texas",
    "logo": "https://cdn.remote.work/companies/JXaCsfAC6y6azixuBcbKbQRfwfZE7dBf2BHhDSfi.jpeg"
  }
]