[
  {
    "name": "Luxoft",
    "description": "<p></p><p><span>Luxoft, a DXC Technology Company (NYSE: DXC), is a digital strategy and software engineering firm providing bespoke technology solutions that drive business change for customers the world over. Luxoft uses technology to enable business transformation, enhance customer experiences, and boost operational efficiency through its strategy, consulting, and engineering services. Luxoft combines a unique blend of engineering excellence and deep industry expertise, specializing in automotive, financial services, travel and hospitality, healthcare, life sciences, media and telecommunications.</span></p><p><br></p><p><span>DXC is the world's leading independent, end-to-end IT services company that drives digital transformations for clients by modernizing and integrating their mainstream IT. Together, DXC and Luxoft offer a differentiated customer-value proposition for digital transformation by combining Luxoft’s front-end digital capabilities with DXC’s expertise in IT modernization and</span></p><p><span>integration. </span></p><p><br></p><p><span>Please follow Luxoft for regular updates and insights into our business.</span></p><p></p>",
    "website": "http://www.luxoft.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/kw068DC04ZLR4PiRHmkEnA6i3W7auoXUWdbulVYv.png"
  },
  {
    "name": "Mimo",
    "description": "<p>With the Mimo app, learning to code is fun and simple. Become fluent in programming languages like HTML, JavaScript, and Python and start turning your ideas into apps, games, and websites. Mimo creates your personalized learning path of bite-size exercises that fit into your daily routine and keep you motivated.</p>",
    "website": "https://getmimo.com/",
    "location": "AT",
    "logo": "https://cdn.remote.work/companies/JupOkegHCpRRa5JPESWDnkRlECO9PVSgOkMZ0gVT.png"
  },
  {
    "name": "Alight Solutions",
    "description": "<p></p><p>With an unwavering belief that a company’s success starts with its people, Alight Solutions is a leading cloud-based provider of integrated digital human capital and business solutions. Leveraging proprietary AI and data analytics, Alight optimizes business process as a service (BPaaS) to deliver superior outcomes for employees and employers across a comprehensive portfolio of services. Alight allows employees to enrich their health, wealth and work while enabling global organizations to achieve a high-performance culture. Alight’s 15,000 dedicated colleagues serve more than 30 million employees and family members. Learn how Alight helps organizations of all sizes, including over 70% of the Fortune 100 at alight.com.</p><p><br></p><p></p>",
    "website": "https://alight.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/6m2GjChBPES7pLrwRD8DBOm8K8vXUjl9IWo5xSaG.png"
  },
  {
    "name": "Ferguson",
    "description": "<p></p><p><span>Ferguson is a diverse distributor with operations spanning multiple business groups. The company is the largest wholesale distributor of residential and commercial plumbing supplies and pipe, valves and fittings in the U.S. The company is also a major distributor of HVAC/R equipment, waterworks and industrial products and services.</span></p><p></p>",
    "website": "http://www.ferguson.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/sGI0HFi06EtzvTyFcI5Cj1A6eHayZaEV4MSj0nP7.jpg"
  },
  {
    "name": "Tekton Labs",
    "description": "<p></p><p>We are a Technology Consultancy and Software Development company with 12 years of experience finding digital solutions for complex business challenges.  Our experienced team of Consultants, UX Analysts, UI Designers, and Software Developers help companies achieve their goals regardless of the stage they are in.</p><p><br></p><p></p>",
    "website": "http://www.tektonlabs.com/",
    "location": "PE",
    "logo": "https://cdn.remote.work/companies/QfiQc2Ykm1gxjsfmAxJkdTChFDOyVKs45v3269kw.jpg"
  },
  {
    "name": "Xero",
    "description": "<p></p><p><span>Xero connects you to all things business.</span></p><p><br></p><p><span>Xero provides a beautiful and easy-to-use cloud-based accounting software service for small businesses and their advisors around the world. Xero connects more than two million subscribers with an ecosystem of over 800 third-party apps and 200 plus connections to banks and financial service providers. </span></p><p><br></p><p><span>The IDC MarketScape recognised Xero as a Leader in the Worldwide SaaS and Cloud-Enabled Small Business Finance and Accounting Applications 2020 Vendor Assessment. </span></p><p><span>On the 2020 Financial Times High-Growth Companies Asia Pacific list, Xero was the largest company by revenue to come from New Zealand or Australia. </span></p><p><span>Xero has also been included in the 2020 Bloomberg Gender-Equality Index.</span></p><p></p>",
    "website": "http://www.xero.com/",
    "location": "NZ",
    "logo": "https://cdn.remote.work/companies/TGDPoIcgG7VL5TB9b40EhYP1RdfCUKc014CejFjq.png"
  },
  {
    "name": "Mattermost",
    "description": "<p></p><p><span>Mattermost’s mission is to make the world safer and more productive by developing and delivering secure, open source collaboration software that is trusted, flexible and offers fast time-to-value. Mattermost’s first product is a collaboration platform built to accelerate DevOps workflows in high-trust environments by offering secure messaging across web, desktop and native mobile devices. </span></p><p></p>",
    "website": "https://mattermost.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/GQMIXSWc6rT822NazGh9U3vdd3XFoYwr6oyw6QBr.png"
  },
  {
    "name": "FranklinCovey",
    "description": "<p></p><p><span>FranklinCovey (NYSE: FC) is a global company specializing in performance improvement. We help organizations achieve results that require a change in human behavior.</span></p><p><br></p><p><span>Our Mission: We enable greatness in people and organizations everywhere.</span></p><p><br></p><p><span>Our expertise is in seven areas: </span></p><p><br></p><p><span>•\tLeadership: Exceptional Leadership At Every Level</span></p><p><span>•\tExecution: Executing Strategies In The Midst Of Daily Urgencies</span></p><p><span>•\tProductivity: The Skills Of Decision, Attention, &amp; Energy Management </span></p><p><span>•\tTrust: Using Trust To Decrease Costs &amp; Speed Results </span></p><p><span>•\tSales Performance: Transforming The Buyer/Seller Relationship </span></p><p><span>•\tCustomer Loyalty: Each Moment Counts When Creating A Loyal Customer </span></p><p><span>•\tEducation: Every Student Can Become A leader</span></p><p><br></p><p><span>Join our talent network and receive alerts with new job opportunities that match your interests. http://www.jobs.net/jobs/franklincovey/all-jobs/</span></p><p></p>",
    "website": "http://www.franklincovey.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/e0oMmWKdMPAY7axmNGma3B35qZY7VHfBvWf2h7Yc.jpeg"
  },
  {
    "name": "Openly",
    "description": "<p></p><p>Openly is proud to offer innovative, comprehensive homeowners insurance, wrapped in modern convenience.  We arm agents with the tools necessary to serve up a world class customer experience.</p><p><br></p><p></p>",
    "website": "https://openly.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/fE0rpiTpAdtXmYzfDkWC6t8oNEsd2nqh58mx2s7n.jpeg"
  },
  {
    "name": "StackCommerce",
    "description": "<p></p><p><span>StackCommerce is the leading product discovery platform for publishers and brands. Our award-winning solution allows users to discover and purchase products on the publisher sites they visit daily. We provide 2500+ merchants and retailers with unmatched exposure through product listings and shoppable articles. For publishers, we power white-labeled e-commerce shops with on-site checkout for readers. We’ve helped over 1,000 publishers monetize with commerce, including Yahoo!, CNN, Hearst, Mashable, NY Post, TMZ, MarketWatch, and more. </span></p><p></p>",
    "website": "https://www.stackcommerce.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Uz7ZbIefHU4vrZA9Y0xw9axyhYVxbPLXih8XxaMM.jpg"
  },
  {
    "name": "McGraw Hill",
    "description": "<p></p><p><span>At McGraw Hill, we empower the curious. Our market-leading innovations create a brighter future for learners, educators and institutions around the globe.</span></p><p><span>Our vision: Unlock the full potential of each learner.</span></p><p><span>Our mission: Accelerate learning through intuitive, engaging, efficient and effective experiences.</span></p><p><span>We have a collective passion for learning and thrive on meeting the evolving needs of students, educators and institutions. We're committed to answering challenges and finding creative solutions. Each and every one of us is proud to play our part by inspiring the next generation of learners.</span></p><p></p>",
    "website": "http://mheducation.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/22J007unOStlfBw9mcnJVDwEE3shwJQjK29ulJtB.jpg"
  },
  {
    "name": "Cash App",
    "description": "<p></p><p><span>Cash App is the fastest growing financial brand in the world. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic app with over 24 million monthly active users. We are bringing a better way to send, spend, invest, and save to anyone who has ever sought an alternative to the traditional banking system. </span></p><p><br></p><p><span>Loved by customers and pop culture, we’ve consistently held the top spot for finance in the App Store for many years, seeing more engagement with millions of followers across social media in a day than most brands see in a year. We are building an ecosystem to redefine the world’s relationship with money by making it universally accessible.</span></p><p><br></p><p><span>We want to hire the best talent regardless of location. Our employment model is distributed offering the opportunity to collaborate with teams across the world in San Francisco, New York, St. Louis, Portland, Toronto, Kitchener-Waterloo, Sydney, and Melbourne. </span></p><p><br></p><p><span>Interested in learning more?</span></p><p></p>",
    "website": "http://cash.app/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/wAsY7Do2u2vgczdLKRy8nNXkHa3ORCTWvSPLEN5X.png"
  },
  {
    "name": "Longitude",
    "description": "<p></p><p><span>Longitude, a Financial Times company creates real thought leadership, for brands and marketers with big ideas.</span></p><p><span>We help build campaigns that earn media exposure and boost your brand profile on the issues that matter. We create actionable insights that create a powerful platform to drive client acquisition and engagement. We build thought leadership strategies that boost your revenues and drive measurable results.</span></p><p><span>In February 2018, we were delighted to announce that the Financial Times had acquired a majority stake in the business, making Longitude part of one of the world’s most respected media brands. The acquisition represents the next phase of Longitude’s development, enabling us to accelerate our growth and deliver an enhanced set of products and capabilities to our combined multinational client base.</span></p><p></p>",
    "website": "http://longitude.co.uk/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/NiuBUgIOmQez1dGsTYFPbmrRRSSj4QvjHzCB3rdt.jpg"
  },
  {
    "name": "Jobscan",
    "description": "<p></p><p><span>Jobscan is a fast-growing start-up in Seattle, WA. Jobscan is web service that helps job seekers land more interviews by using AI to analyze one’s resume or LinkedIn profile against any job description.</span></p><p><span>We're building the next generation of job search tools to make job search easier. We’re user-funded, profitable, and growing exponentially.</span></p><p></p>",
    "website": "https://www.jobscan.co/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Fb9G4RdUEnql1h8ojiA4KWPglcKYXubMQWyPGdQF.png"
  },
  {
    "name": "Thomson Reuters",
    "description": "<p>Thomson Reuters is the world’s leading provider of news and information-based tools to professionals. Our worldwide network of journalists and specialist editors keep customers up to speed on global developments, with a particular focus on legal, regulatory and tax changes.    \n\nOur customers operate in complex arenas that move society forward — tax, law, compliance, government, media. In a disruptive digital age, we help professionals reinvent themselves.</p>",
    "website": "http://tr.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/R969gCoDtO51gneN5E2OHh47igihVDVeoA8o2Vkb.png"
  },
  {
    "name": "Automation Anywhere",
    "description": "<p></p><p><span>Welcome to Automation Anywhere. We’re on a singular and unwavering mission to democratize automation and create a better future for everyone, liberating people from mundane, repetitive tasks, and allowing them more time to use their intellect and creativity.</span></p><p><br></p><p><span>A leader in the Gartner Magic Quadrant, our AI-powered digital workforce platform optimizes the business processes of the world's largest enterprises and governments in virtually every industry including 85% of the top banks and ﬁnancial institutions, 90% of the top healthcare institutions, 85% of the top technology companies, and 80% of the top telecom companies.</span></p><p><br></p><p><span>Industry Awards and highlights:</span></p><p><br></p><p><span>· Named a leader each year of Gartner Magic Quadrant for Robotic Process Automation</span></p><p><br></p><p><span>· Named a leader in Forrester Wave</span></p><p><br></p><p><span>· Named a Leader and Star Performer in Everest Peak Matrix</span></p><p><br></p><p><span>· Named a leader in Nelson Hall NEAT Intelligent Automation Report</span></p><p><br></p><p><span>· G2 Crowd 2020 Best Software Company</span></p><p><br></p><p><span>· First Cloud-native digital workforce platform</span></p><p><br></p><p><span>· 850+ pre-built, intelligent automation solutions</span></p><p><br></p><p><span>· Bot security and IP protection</span></p><p><br></p><p><span>· SaaS packages</span></p><p><br></p><p><span>· Over 1M courses completed in Automation Anywhere University</span></p><p><br></p><p><span>· Free AI-powered Community edition</span></p><p><br></p><p><span>Try the world’s most advanced digital workforce platform today: https://bit.ly/startRPAtoday</span></p><p></p>",
    "website": "https://www.automationanywhere.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/VHexyl29UEatyoUt0zUNntQxPl5ubEKckhwsjbS6.png"
  },
  {
    "name": "Jacobs",
    "description": "<p></p><p><span>We deliver impactful global solutions to create a more connected, sustainable world — from intelligence to infrastructure, cybersecurity to</span></p><p><span>space exploration. Our 52,000 employees across 50 countries work every day, challenging the expectations of today to reinvent the way we’ll all live tomorrow.</span></p><p></p>",
    "website": "http://www.jacobs.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/On8jRboGvrqD6Rzl5EhpPQ4OWgWCAkprBjqdvw1W.jpg"
  },
  {
    "name": "WorkMotion",
    "description": "<p></p><p><span>WorkMotion is a global HR platform enabling companies to hire &amp; onboard their employees internationally, at the push of a button. It is our mission to create opportunities for anyone to work from anywhere. As work is becoming even more global and remote, there has never been a bigger chance to build a truly global HR-tech company.</span></p><p></p>",
    "website": "https://www.workmotion.com/",
    "location": "DE",
    "logo": "https://cdn.remote.work/companies/jAU5AkWkSo7SxknBZlXY54yHGuzvdJx6RtPAosZd.jpg"
  },
  {
    "name": "Anthem, Inc.",
    "description": "<p></p><p>At Anthem, Inc., we believe that our health connects us all. So we focus on being a valued health partner and delivering quality products and services that give members access to the care they need. With more than 100 million people served by our affiliated companies including approximately 40 million enrolled in our family of health plans, we can make a real difference to meet the needs of our diverse customers.</p><p></p>",
    "website": "http://antheminc.com/",
    "location": "Indiana",
    "logo": "https://cdn.remote.work/companies/dhT4esYBoRcaEdqj6CUiCmuyiSCTieMlSy7z02OY.jpeg"
  },
  {
    "name": "NAVEX Global",
    "description": "<p></p><p><span>Our ecosystem of governance, risk and compliance software provides customers with a better way to manage risks. We provide a system that automates processes, operationalizes big data, and provides real-time risk information to make your compliance program truly exceptional.</span></p><p><span>Today, we work with more than 14,000 customers around the globe, including 95 of the Fortune 100. More than 70 million employees have learned from our training courseware or felt empowered to use our hotlines to report an issue. NAVEX Global is committed to doing the right things right and believe we have the ability to help every organization to do the same. We were the first in the GRC space and strive every day to remain the best.</span></p><p></p>",
    "website": "http://www.navexglobal.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/dXeXBfGE9Lw8V0yw8avtlsvSd5n9tHfD6CmxST5v.png"
  },
  {
    "name": "Digital Diagnostics",
    "description": "<p></p><p>Digital Diagnostics is a pioneering AI diagnostics company on a mission to transform the quality, accessibility and affordability of healthcare. Founded and led by Dr. Michael Abramoff, an ophthalmologist, neuroscientist and computer engineer, Digital Diagnostics developed a patented biomarker-based approach to build autonomous algorithms that make clinical decisions without human intervention. Digital Diagnostics and its flagship product IDx-DR, an autonomous AI system FDA-authorized to diagnose diabetic retinopathy and diabetic macular edema, has proven that intelligent diagnostic platforms can be used safely, efficiently and equitably to improve patient outcomes. As it expands into other diagnostic capabilities, Digital Diagnostics has paved the way for automated diagnosis to become a new standard of care that will contribute significantly to democratizing healthcare.   </p><p></p>",
    "website": "https://dxs.ai/",
    "location": "Iowa",
    "logo": "https://cdn.remote.work/companies/BIv0miLC853tGqjCBSqh2NnvDuf3E5OVmhih2041.jpeg"
  },
  {
    "name": "Chorus One",
    "description": "<p></p><p><span>Chorus One is operating validating nodes and staking services for Proof-of-Stake blockchain networks. </span></p><p><br></p><p><span>Our products enable token holders to earn interest on their cryptoassets and to shape the evolution of the decentralized networks they are invested in.</span></p><p></p>",
    "website": "https://chorus.one/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Bev4J26HdPnXH5OWdtTulZ0ZWpBXdD8CIvOLeSgP.png"
  },
  {
    "name": "Humu",
    "description": "<p></p><p><span>To make work better, we have to make change easier. </span></p><p><br></p><p><span>Humu’s behavioral change technology helps organizations—and individuals— be the best they can be using small, personal steps based on people science, machine learning, and a little love. </span></p><p><span> </span></p><p><span>Our approach applies the findings of decades of research to help anyone grow into a better leader, manager, or teammate.</span></p><p><span> </span></p><p><span>The results? Higher productivity, better retention, more innovative, inclusive workplaces, and—most importantly—greater happiness.</span></p><p><br></p><p><span>Humu is a 2019 Gartner Cool Vendor for Employee Experience.</span></p><p></p>",
    "website": "http://www.humu.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/PJRje48DlyiMcROwdgog1F9zp7WjxvkWRswyMVKS.png"
  },
  {
    "name": "Seer Interactive",
    "description": "<p></p><p>At Seer Interactive, we don’t trust our gut, we trust data. With Services ranging from PPC, SEO, Analytics, Creative and Data Strategy, we leverage audience research and big data to find valuable insights at scale to solve our clients biggest business challenges. As a digital marketing agency, Seer values the person behind the search and aims to help them find the answers they’re looking for when they need them most.&nbsp;</p><p></p>",
    "website": "https://www.seerinteractive.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/EqYbekyMXSJ125vLuKD7aq7mhVtgJN19uzBM2aRu.png"
  },
  {
    "name": "MetLife",
    "description": "<p></p><p><span>We live in a time of unprecedented change. A time when economies, regulations, and social safety nets are all in flux.</span></p><p><br></p><p><span>Customers around the globe have told us they’re overwhelmed by the pace of change and are looking for a trusted partner to help them manage life’s twists and turns.</span></p><p><br></p><p><span>MetLife is committed to being that partner. That’s why we’re transforming our business: Delivering greater value for the people we serve by becoming a simpler, more focused, and future-facing company. We’ll be introducing new ways to meet our customers’ evolving needs, with flexible products; simpler, more intuitive experiences and a range of new services. </span></p><p><br></p><p><span>MetLife. Navigating life together.</span></p><p><br></p><p><span>For customer service: http://bit.ly/metlifeservice</span></p><p><br></p><p><span>For social media notices: http://bit.ly/2fpeYRC</span></p><p><br></p><p><span>MetLife, Inc. (NYSE: MET), through its subsidiaries and affiliates (\"MetLife\"​), is one of the largest life insurance companies in the world. Founded in 1868, MetLife is a global provider of life insurance, annuities, employee benefits, and asset management. Serving approximately 100 million customers, MetLife has operations in nearly 50 countries and holds leading market positions in the United States, Japan, Latin America, Asia, Europe, and the Middle East.</span></p><p></p>",
    "website": "http://www.metlife.com/",
    "location": "NY",
    "logo": "https://cdn.remote.work/companies/nuZIKMcNlipObkUeQGnDd35CS97f2h36hcStdCX6.png"
  },
  {
    "name": "The Standard",
    "description": "<p></p><p><span>StanCorp Financial Group, Inc., through its subsidiaries marketed as The Standard -- Standard Insurance Company, The Standard Life Insurance Company of New York, Standard Retirement Services, StanCorp Mortgage Investors, StanCorp Investment Advisers, StanCorp Real Estate and StanCorp Equities -- is a leading provider of financial products and services. StanCorp's subsidiaries serve approximately 7.5 million customers nationwide as of June 30, 2011, with group and individual disability insurance, group life and accidental death and dismemberment insurance, group dental and group vision insurance, absence management services, retirement plans products and services, individual annuities and investment advice.</span></p><p><br></p><p><span>The Standard is a marketing name for StanCorp Financial Group, INC. and its subsidiaries. Insurance products are offered by Standard Insurance Company of Portland, Ore. in all states except New York, where insurance products are offered by The Standard Life Insurance Company of New York of White Plains, N.Y. Product features and availability by state and company, and are solely the responsibility of each subsidiary.</span></p><p><br></p><p><span>Third-party articles, comments and links to websites are for general information purposes only and do not constitute an offer or solicitation of any kind. They are not intended, and should not be relied upon as investment, insurance or financial advice. The Standard and its affiliates make no representation as to the accuracy or completeness of any statements, statistics, data, opinions, forecasts, or predictions provided in any third-party article, comment or website content. For additional information regarding The Standard, please visit https://www.standard.com/legal-privacy</span></p><p></p>",
    "website": "https://www.standard.com/",
    "location": "Oregon",
    "logo": "https://cdn.remote.work/companies/2oVAUgx2GXCiV5DTGEdbpT583YTPpp8ulAuMab4r.png"
  },
  {
    "name": "InVision",
    "description": "<p>InVision is the Digital Product Design platform used to make the world’s best customer experiences. We provide design tools and educational resources for teams to navigate every stage of the product design process, from ideation to development. Today, more than 5 million people use InVision to create a repeatable and streamlined design workflow; rapidly design and prototype products before writing code, and collaborate across their entire organization. That includes 100 percent of the Fortune 100, and organizations like Airbnb, Amazon, HBO, Netflix, Nike, Slack, Starbucks and Uber, who are now able to design better products, faster.</p>",
    "website": "http://www.invisionapp.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ZSewJCsDeLFWFX3RTcZVOp7oPo13XalLYJSLtSj7.png"
  },
  {
    "name": "CurriculumAssociates",
    "description": "<p></p><p>Curriculum Associates, the makers of i-Ready, is a rapidly growing education company committed to making classrooms better places for teachers and students. We believe that all children have the chance to succeed, and this drives the decisions we make every day. Our research-based, award-winning products, including cloud-based i-Ready®, provide teachers and administrators with flexible resources that deliver meaningful assessments and data-driven, differentiated instruction for children. We serve millions of students with our i-Ready®, Ready®, BRIGANCE® and other programs because of our laser focus on educators’ needs over our own bottom line, and a belief that thoughtful and continuous innovation leads to a positive impact on classrooms and measurable growth for students.</p><p><br></p><p></p>",
    "website": "http://www.curriculumassociates.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/8238voRsO51eGIcdMBClagFIDbh9u0bZSr4wVz6s.png"
  },
  {
    "name": "Scope AR",
    "description": "<p></p><p><span>Scope AR is a global leader in developing augmented reality (AR) solutions and products for industrial clients focused around field maintenance, manufacturing, and training. As the pioneer of enterprise-class AR solutions, the company delivers work instructions and remote assistance on a single, integrated AR knowledge platform - WorkLink - so workers can get expert guidance when and where it’s needed.</span></p><p><br></p><p><span>The company is currently working with some of the world’s leading global enterprise companies including Lockheed Martin, Unilever, Prince Castle, and Becton Dickinson, among others.</span></p><p></p>",
    "website": "http://scopear.com/",
    "location": "California",
    "logo": "https://cdn.remote.work/companies/1X9T45ovDLhpeeJzyxdTlRLv0dtWl4A8pWk0MBP3.png"
  },
  {
    "name": "Blend",
    "description": "<p></p><p>Blend helps lenders streamline the customer journey for any banking product from application to close. Its Digital Lending Platform is used by Wells Fargo, U.S. Bank, and over 250 other leading financial institutions to acquire more customers, increase productivity, and deepen customer relationships. The company enables customers to process more than $3.5 billion in mortgages and consumer loans per day, helping millions of consumers get into homes and gain access to the capital they need to lead better lives. To learn more, visit blend.com.</p><p><br></p><p></p>",
    "website": "http://www.blend.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/aEBzIkcfRmZnpskp3lfsWWkiiQSqqAXIYrzC5nB3.jpeg"
  },
  {
    "name": "Grafana Labs",
    "description": "<p>Grafana Labs is the company behind Grafana, the leading open source software for visualizing time series data. Grafana Labs helps users get the most out of Grafana, enabling them to take control of their unified monitoring and avoid vendor lock in and the spiraling costs of closed solutions.</p>",
    "website": "http://grafana.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/idv9N2mGimhO6LN0SPgx8xeRnxq6tTeMuzRimB6M.jpeg"
  },
  {
    "name": "Gopuff",
    "description": "<p></p><p><span>Gopuff is the go-to delivery solution for immediate everyday needs. Through centrally located micro-fulfillment centers, we deliver more than 3,000 products right to your door. Since its founding in 2013, Gopuff has been committed to providing convenience and speed when you need it most.</span></p><p><br></p><p><span>As the fastest-growing, most affordable delivery service on the market, Gopuff operates from 12 pm to 4:30 am and 24/7 in some areas to bring you what you need, when you need it–we deliver ice cream, toilet paper, cold medicine and more. Gopuff also brings you all of the drinks you need–including wine, beer &amp; alcohol delivery in select locations to customers 21+. Gopuff’s model allows for fast delivery of daily essentials directly from facilities to your door, eliminating the middleman.</span></p><p><br></p><p><span>Headquartered in Philadelphia, Pennsylvania, Gopuff currently operates in more than 200 facilities in 500+ cities across the U.S., including Atlanta, Boston, Chicago, Dallas, Denver, Philadelphia, Phoenix, Seattle, Pittsburgh, Washington, D.C. &amp; many more.</span></p><p><br></p><p><span>Gopuff was founded in 2013 by Rafael Ilishayev and Yakir Gola, who met as business students at Drexel University. Today, the co-founders operate Gopuff on five core values: Make Moves, Be the GOAT, Change the Game, Win Together &amp; Sit Down, Be Humble. </span></p><p></p>",
    "website": "http://gopuff.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/RrThB3akK7deDQOgQI1ynBqMY9hkFL439hpgS1sM.jpg"
  },
  {
    "name": "Snyk",
    "description": "<p></p><p><span>Snyk’s mission is to help developers use open source code and stay secure.</span></p><p><span>The use of open source is booming, but security is a key concern (https://snyk.io/stateofossecurity/). Snyk’s unique developer focused product enables developers and enterprise security to continuously find &amp; fix vulnerable dependencies without slowing down, with seamless integration into Dev &amp; DevOps workflows.</span></p><p></p>",
    "website": "https://snyk.io/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/7vkHSbS4Ub3WAZjOEkybzgbccFfjjocAhGkcYy4E.jpg"
  },
  {
    "name": "Hyland",
    "description": "<p></p><p>Hyland is a leading content services provider that enables thousands of organizations to deliver better experiences to the people they serve. With more than 3,000 employees around the world, Hyland is widely known as both a great company to work for and a great company to do business with.</p><p><br></p><p></p>",
    "website": "https://www.hyland.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Q32GypV9UgEmMmLS5HwWnYPYEU4pPAVAGDE0vi2i.png"
  },
  {
    "name": "Symetra",
    "description": "<p></p><p><span>Symetra is a financial services company offering annuities, life insurance and employee benefits that help people create secure retirements, protect their families and get benefits at work. We are headquartered in Bellevue, Washington, and have offices in 20 cities across the country.</span></p><p></p>",
    "website": "http://www.symetra.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/o3aTAlNXneW0kB6gT9JtBT60A6jfKva7G0dW07CV.jpeg"
  },
  {
    "name": "Canonical",
    "description": "<p>Canonical and Ubuntu are at the forefront of cloud and IoT computing, helping customers master the challenge of operations on hybrid cloud, bare metal, and container-based systems. Our Graduate Field Software Engineers are at the heart of this process, demonstrating, designing and delivering exciting solutions to a range of customers, from startups to Fortune 500s.\n\nIf travelling around the globe and working with some of the smartest people in the industry sounds appealing, and if you like to dig into the code, Canonical might be the place you are looking for!</p>",
    "website": "https://canonical.com/",
    "location": "110 Southwark Street.",
    "logo": "https://cdn.remote.work/companies/gG5M5CqN1ZunVgmba31P4BAKRSGqWle3GcxsZOnv.png"
  },
  {
    "name": "Chili Piper",
    "description": "<p>Chili Piper helps businesses help their buyers. \n\nPeople interested in your business typically have to wait hours or days after filling out a form. Not anymore. \n\nOur intelligent assistant offers them a simple way to book a meeting or start a phone call immediately upon form submission.\n\nUnlike the traditional method of inbound lead management, Chili Piper uses smart rules to qualify and distribute leads to the right reps in real time. Our software also allows companies to automate opportunity distribution from their SDR’s to their AE’s, and book meetings from their marketing campaigns and live events.\n\nCompanies like Square, Twilio, DiscoverOrg, SalesLoft, and SiriusDecisions use Chili Piper to create an amazing experience for their leads, and in return experience higher conversions for their business.\n\nChili Piper is focused on helping Businesses help their Buyers - building a new category we call Buyer Enablement.</p>",
    "website": "http://www.chilipiper.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/iUdSIxfpbkyVK8zb3qHjQTkkxIxmpLGqV5LEK2Rv.png"
  },
  {
    "name": "Evernote",
    "description": "<p>Evernote is a free app for your smartphone and computer that stores everything you could possibly imagine losing track of, like a boarding pass, receipt, article you want to read, to do list, or even a simple typed note. The app works brilliantly, keeping everything in sync between your computer, smartphone, or tablet.</p>",
    "website": "http://www.evernote.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/frvPgnIqLEVUTdRdn3CUeaDnT6oapgrxgtjvSCRM.png"
  },
  {
    "name": "Concentrix",
    "description": "<p>Concentrix, a wholly-owned subsidiary of SYNNEX Corporation (NYSE: SNX), is a technology-enabled global business services company specializing in customer engagement and improving business performance for some of the world’s best brands. Every day, from more than 40 countries and across six continents, our staff delivers next generation customer experience and helps companies better connect with their customers. We create better business outcomes and differentiate our clients through technology, design, data, process, and people. Concentrix provides services to clients in ten industry verticals: automotive; banking and financial services; insurance; healthcare; technology; consumer electronics; media and communications; retail and e-commerce; travel and transportation; energy and public-sector. We are Different by Design.</p>",
    "website": "http://www.concentrix.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/JUlXLLOlqdK33YXk2lHZgAJcblhcSxIspwnuxRnS.png"
  },
  {
    "name": "CodeCombat",
    "description": "<p></p><p><span>CodeCombat is a multiplayer programming game for learning how to code. With thousands of schools and millions of students, we are bringing K12 computer science education to everyone, regardless of gender, race, or background. Everyone should have the opportunity to learn.</span></p><p><br></p><p><span>The ultimate goal of CodeCombat is to bring more users into the field of computer programming by making the logic and syntax more accessible and enjoyable to learn. The end game is to educate a whole new generation of computer programmers that started their journey by slaying ogres and defending their castles from oncoming enemy hordes.</span></p><p><br></p><p><span>We teach Python, JavaScript, and other languages directly in the browser. Teachers with no computer science background can get started in five minutes. In a world where all programmers have had to be second-language learners, do you want your students to become native speakers of code? Let's chat about bringing CodeCombat to your school!</span></p><p></p>",
    "website": "http://codecombat.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/6DcNSPABScg0wJ9sdHMilBSicAHZJrRxuMJgaXbW.png"
  }
]