[
  {
    "name": "DockYard, Inc.",
    "description": "<p>DockYard is a digital product agency offering custom software, mobile, and web application development consulting.  We provide exceptional professional services in strategy, user experience, design, and full stack engineering to bring brilliant digital ideas into being for avant-garde clients such as Netflix, Apple, Nasdaq, Fidelity Investments, Cars.com, McGraw-Hill, Harvard, Constant Contact, Zipcar, WNYC, and various startups.  DockYard helps organizations transform ambitious, complex ideas into fully deployed apps using Ember.js, React.js, Elixir, Ruby, and other technologies.  DockYard’s integrated approach allows us to solve problems quickly with stability, maintainability, and scalability.  Our firm is smart, experienced, and deeply knowledgeable about modern application UX, design, and architecture.  On the bleeding edge of technology, DockYard often pioneers the field, and invests heavily in the open source community.  We also offer testing and QA, project management, training, support, and staff augmentation.  And with consultants nationwide, we've got staff in key markets across the United States.</p>",
    "website": "https://dockyard.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/srB87LXsnvnLNAF6BUkm48ml5saO1F8ohNNe7SDa.png"
  },
  {
    "name": "Tylko",
    "description": "<p></p><p><span>We design modern, perfect-fit shelves that make organising simple. Our mission is to help bring harmony to your space so you can live a better life.</span></p><p><br></p><p><span>Tylko is a next-generation furniture company founded in 2015 in Warsaw, Poland. We specialise in providing high-quality personalised shelves that our customers can adapt down to the last detail. We meet the needs of their unique spaces through the use of our intuitive online configurator and augmented reality application.</span></p><p><br></p><p><span>Tylko’s team has reconsidered every step of the traditional furniture-buying process in order to create a better, seamless and more personal experience without the middle-man – with a quality product, simple online shopping, free doorstep delivery and effortless assembly.</span></p><p><br></p><p><span>To date, we have served over 20 000 satisfied customers, selling over 22 000 perfect-fit shelves across the world.</span></p><p></p>",
    "website": "http://tylko.com/",
    "location": "PL",
    "logo": "https://cdn.remote.work/companies/YDItBQyDpsc8bWrUY5LxduWwgunx0UYeu3TTxolf.png"
  },
  {
    "name": "Strategic Marketer",
    "description": "<p>At Strategic Marketer, we are passionate about providing a complete suite of best-in-class marketing automation software, strategies and support to empower businesses to start up or scale up. Whether you need paid traffic, sales automation funnels, video technology, reputation marketing or social media management – we’ve got everything you need to build a highly profitable business!</p>",
    "website": "http://www.strategicmarketer.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/I8UBxoOkK0oCwhlmYNl64nxbY4jvLAHlCD7breQl.png"
  },
  {
    "name": "Karsun Solutions",
    "description": "<p></p><p>Karsun Solutions is a fast-growing, innovative, enterprise modernization firm. The Virginia Chamber of Commerce, Washington Business Journal, and Inc. all recognize Karsun Solutions among the fastest-growing companies in the Washington, D.C. region. Karsun teams deliver software development, cloud, and advanced analytics solutions to customers at government agencies including the Department of Homeland Security, Federal Aviation Administration, and General Services Administration. It is an established firm, with a DCAA Approved Accounting System, CMMI Level 5 – DEV appraisal, and AWS Government Competency as well as ISO 9001, ISO 20000 and ISO 27001 certifications.</p><p><br></p><p></p>",
    "website": "http://www.karsun-llc.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/xX4GAQXL2IAchdKWbWkpqnK77aHQAuVg4Uan5jNi.png"
  },
  {
    "name": "Denken Solutions",
    "description": "<p></p><p><span>Denken Solutions, Inc is a USA based company offering consulting services in Enterprise Resource Planning, Customer Relationship Management, Supplier Relationship Management, Business Intelligence software implementation and support. We are specialized in business process design, solution implementation, business process optimization, software upgrades, and production support. </span></p><p><br></p><p><span>Denken’s expertise and energy is focused on implementing the software to meet your current and future needs with little or no maintenance. Our project managers, functional consultants, technical consultants and quality assurance engineers complement each other to build a successful project that is optimized to your business processes and software provider’s best practice recommendations.</span></p><p><br></p><p><span>Denken Solutions, Inc is recognized by Inc. Magazine as one of fastest growing private companies in America for years 2016/2017/2018/2019 ans 2020</span></p><p></p>",
    "website": "http://www.denkensolutions.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Gw0teCIy7fTvMlhD1USqNXDdAwj8A0uXp4J0Yl8q.png"
  },
  {
    "name": "Jobbatical",
    "description": "<p></p><p><span>Relocate international hires with zero hassle.</span></p><p><br></p><p><span>Onboard team members from anywhere in the world with our reliable, done-for-you immigration and settle-in services. Save time, cut back on paperwork, and stay one step ahead of unexpected issues.</span></p><p><br></p><p><span>Our mission is to think beyond borders and help the world work together.</span></p><p></p>",
    "website": "http://jobbatical.com/",
    "location": "EE",
    "logo": "https://cdn.remote.work/companies/kPW6uZgHMAUNLosj3XY8gMmjTpPg1KDr7JGAKlcw.png"
  },
  {
    "name": "bttr",
    "description": "<p></p><p><span>We teach brands to walk and talk for tomorrow. It’s our craft. One that demands relevant solutions for a savvy consumer. We strategize, campaign and influence, tapping into those cultural truths that shape your business.</span></p><p></p>",
    "website": "http://www.bttr-la.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/xMpCY9yBwqA1ZQdj8bpIf517bADfFEW9rhS1mKoP.png"
  },
  {
    "name": "bttr",
    "description": "<p></p><p><span>We teach brands to walk and talk for tomorrow. It’s our craft. One that demands relevant solutions for a savvy consumer. We strategize, campaign and influence, tapping into those cultural truths that shape your business.</span></p><p></p>",
    "website": "http://www.bttr-la.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/xMpCY9yBwqA1ZQdj8bpIf517bADfFEW9rhS1mKoP.png"
  },
  {
    "name": "Encore Semi",
    "description": "<p></p><p><span>Encore Semi is a successful Engineering Solutions company. We build Centers of Expertise to support our many customers from the semiconductor and electronics system industry in North America. Our teams of experts contribute to leading-edge projects in the areas of SoC design and embedded software. We provide high-value through acceleration, performance improvement, optimization, and risk mitigation.</span></p><p><br></p><p><span>We provide our engineering team members with continuous exposure to top advanced technologies &amp; tools, participation in challenging yet exciting projects, and direct collaboration with its industry-leading teams, customers, and long-term partners.</span></p><p></p>",
    "website": "https://www.encoresemi.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/0zSCNOSLarKKVfOEZ98zR0rnagKlTSU793sUjm7F.png"
  },
  {
    "name": "Boulevard",
    "description": "<p></p><p><span>Boulevard was founded with the fundamental belief that personal care should be convenient for all. Our mission is to maximize potential for salons and spas, as well as the clients they serve.</span></p><p><br></p><p><span>Developed in collaboration with industry-leading owners and operators, our scheduling and point of sale platform-as-a-service was carefully designed to drive revenue, automate workflows, and convert customers from visitors into valuable, long-term clients. By facilitating a better, personalized experience across every transaction and interaction, Boulevard’s technology not only helps businesses survive, but thrive. </span></p><p><br></p><p><span>As a venture-backed startup based in Los Angeles, we are innovating at the intersection of beauty and technology. We are thoughtfully unapologetic about challenging the status quo in pursuit to help people become the best version of themselves. We use technology, design, and style to unleash the untapped potential in all of us, drive real results, and we're just getting started.</span></p><p><br></p><p><span>You can learn more about Boulevard and join our movement by visiting https://joinblvd.com/careers</span></p><p></p>",
    "website": "https://joinblvd.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/FQWja24eln4pFZDiO5K4RvpsdJ99rDnzHBUArqEw.png"
  },
  {
    "name": "John Deere",
    "description": "<p></p><p>John Deere is a world leader in providing advanced products, technology and services for customers whose work is revolutionizing agriculture and construction — those who cultivate, harvest, transform, enrich and build upon the land to meet the world's increasing need for food, fuel, shelter and infrastructure.</p><p><br></p><p></p>",
    "website": "http://www.johndeere.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Lze2HppWi3vPUMC0zXIdegsYvIGhYaMrfvKrIN1w.png"
  },
  {
    "name": "Gannett",
    "description": "<p></p><p><span>Gannett is a subscription-led and digitally focused media and marketing solutions company committed to empowering communities to thrive. </span></p><p><br></p><p><span>We connect communities in meaningful ways through our powerful network, including local media brands in 46 states, iconic USA TODAY, digital marketing services and USA TODAY NETWORK Ventures division.​</span></p><p></p>",
    "website": "https://www.gannett.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/CANN33V12Rqayqui55y1lmtslS4Mc4Mo5EQn81st.png"
  },
  {
    "name": "Verve Group",
    "description": "<p></p><p><span>PubNative, now part of Verve Group, is a mobile publisher platform and programmatic ad exchange, providing advanced monetization solutions for mobile app developers. With its proprietary cross-format optimization technology and mobile in-app bidding solution, PubNative enables mobile publishers to maximize their programmatic advertising revenue via flexible integrations (API, SDK, JavaScript).</span></p><p></p>",
    "website": "https://verve.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/OxntvhT6phtS6xOa4XnW0YgsmeR6L6KOEzciaRpt.jpg"
  },
  {
    "name": "Westat",
    "description": "<p></p><p>Westat offers innovative professional services to help clients improve outcomes in health, education, social policy, and transportation. We are dedicated to improving lives through research.</p><p><br></p><p>Expertise</p><p><br></p><p>• Data Collection &amp; Management</p><p>• Clinical Trials</p><p>• Statistical Research &amp; Survey Methods</p><p>• Evaluation</p><p>• Communications &amp; Social Marketing</p><p><br></p><p>Staff and Locations</p><p><br></p><p>Westat’s staff of more than 2,000 are located at our headquarters in Rockville, Maryland, near Washington, DC. Additional staff are located at Westat’s data collection survey processing facilities, at our Telephone Research Center facilities, and throughout our nationwide field operations.</p><p><br></p><p>Westat also maintains research offices near our clients in Atlanta, Georgia; Cambridge, Massachusetts; Raleigh/Durham, North Carolina; Philadelphia, Pennsylvania; Houston, Texas; and San Antonio, Texas. We have international offices in Liberia, Costa Rica; Johannesburg, South Africa; and Bangkok, Thailand.</p><p><br></p><p>Westat is committed to providing accessible media on LinkedIn. Should you experience difficulties with any posted media, please send us a message at Section508Coordinator@westat.com. An alternative format will be provided upon request.</p><p><br></p><p></p>",
    "website": "http://www.westat.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/9fsm6hI2Gfvq8Z1dOrHmxn8nH9VI0eUlxQtlcdQb.png"
  },
  {
    "name": "Headspace",
    "description": "<p></p><p><span>Headspace was created with one mission in mind: to improve the health and happiness of the world. Reaching more than 65 million users in 190 countries, Headspace was one of the first meditation apps in the world and remains a leader in mindfulness and mental training. Headspace is committed to advancing the field of mindfulness through clinically-validated research, with one of the largest research pipelines of any digital health and wellness company. Headspace operates a B2B business (Headspace for Work) to offer its mindfulness products and services to more than 700 companies, such as Starbucks, Adobe, GE, Hyatt and Unilever, to help them build healthier, more productive cultures and higher performing organizations. Headspace supports government entities like New York State and the UK’s National Health Service (NHS) to offer digital mental health tools. </span></p><p></p>",
    "website": "https://www.headspace.com/",
    "location": "California US",
    "logo": "https://cdn.remote.work/companies/yDOemzu5SjU5JVhwqxksFjPDf4YMPfVftVfp2gv3.png"
  },
  {
    "name": "Eaton",
    "description": "<p></p><p><span>*Planes. Hospitals. Factories. Data centers. Vehicles. The electrical grid. These are things people depend on every day. And the companies behind them depend on Eaton to solve some of the toughest power management challenges on the planet.</span></p><p><span>Eaton’s mission is to improve the quality of life and the environment through the use of power management technologies and services. We provide sustainable solutions that help our customers effectively manage electrical, hydraulic, and mechanical power – more safely, more efficiently, and more reliably. Eaton’s 2019 revenues were $21.4 billion, and we sell products to customers in more than 175 countries. We have approximately 92,000 employees. For more information, visit Eaton.com.</span></p><p><span>Eaton is an Equal Opportunity and Affirmative Action Employer. Eaton is committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job-related reasons regardless of an applicant's race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability, marital status, genetic information, protected veteran status, or any other status protected by law.</span></p><p></p>",
    "website": "http://www.eaton.com/",
    "location": "IE",
    "logo": "https://cdn.remote.work/companies/E0Z4Lkn7kh4EltkJciXMopnQU4VCRlUimksbXwC0.jpg"
  },
  {
    "name": "Spotify",
    "description": "<p></p><p><span>Our mission is to unlock the potential of human creativity—by giving a million creative artists the opportunity to live off their art and billions of fans the opportunity to enjoy and be inspired by it.</span></p><p><span> </span></p><p><span>Spotify transformed music listening forever when it launched in Sweden in 2008. Discover, manage and share over 50m tracks for free, or upgrade to Spotify Premium to access exclusive features including offline mode, improved sound quality, and an ad-free music listening experience. </span></p><p><br></p><p><span>Today, Spotify is the most popular global audio streaming service with 286m users, including 130m subscribers across 79 markets. We are the largest driver of revenue to the music business today.</span></p><p></p>",
    "website": "http://www.spotify.com/",
    "location": "Stockholm County SE",
    "logo": "https://cdn.remote.work/companies/tqiDkfhHVSw60KBr4t36VZqkShlz71aXdGM0P0uk.png"
  },
  {
    "name": "Allobee",
    "description": "<p></p><p><span>Allobee is a platform designed with the overwhelmed entrepreneur and small business owner in mind. Whether in need of business support services like bookkeeping and tech assistance, or upleveling your visibility with podcast editing, website development, graphic design, or social media, Allobee is a one-stop business solution to give you time back when you need it most. Allobee’s algorithm connects business owners nationwide to a vetted, underutilized workforce of experienced, professional women who have left the traditional 9 to 5, and provides a seamless workflow to the logistics of hiring, paying, and managing projects to completion.</span></p><p></p>",
    "website": "http://www.allobee.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/wHT1meP04spG4LVp0LZqabXvUlvhvzMusXdszosv.jpg"
  },
  {
    "name": "Kandji",
    "description": "<p></p><p><span>Next-generation Apple device management for macOS, iOS, iPadOS, and tvOS.</span></p><p></p>",
    "website": "https://www.kandji.io/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/HK7h4AA291Bd5z6r37Rn2Q9ryhVA7fuRKtgnA4Or.jpg"
  },
  {
    "name": "CDW",
    "description": "<p></p><p><span>CDW (Nasdaq:CDW) is a leading multi-brand provider of information technology solutions to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. CDW is a Fortune 500 company and member of the S&amp;P 500 Index.</span></p><p><br></p><p><span>The company’s solution architects offer expertise in designing customized solutions, while its advanced technology engineers assist customers with the implementation and long-term management of those solutions. Areas of focus include software, network communications, notebooks/mobile devices, data storage, video monitors, desktops, printers and solutions such as virtualization, collaboration, security, mobility, data center optimization and cloud computing. CDW was founded in 1984 and employs approximately 10,000 coworkers. For the year ended December 31, 2020, the company generated Net sales over $18 billion. For more information about CDW, please visit www.CDW.com.</span></p><p></p>",
    "website": "http://www.cdw.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/GuoAdqWtNYHk96XNA1DFf8lyejvLOAtYRa8oY8BO.png"
  },
  {
    "name": "Playco",
    "description": "<p></p><p>As the world’s first instant play gaming company, we create games that billions of people can play together.</p><p><br></p><p><br></p><p></p>",
    "website": "http://www.play.company/",
    "location": "Japan JP",
    "logo": "https://cdn.remote.work/companies/3pm3f7CAkGc52qW85b8LO1YhdSaZTaqXIP1gAm4T.jpeg"
  },
  {
    "name": "Instructure",
    "description": "<p></p><p><span>Instructure is helping people grow from the first day of school to the last day of work. More than 30 million people use its Canvas and Bridge platforms for learning management and employee development.</span></p><p><br></p><p><br></p><p></p>",
    "website": "http://www.instructure.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/8CbKGxo1CSuET0EyHheWTJ1M5b0a5fa4vupHttnc.jpeg"
  },
  {
    "name": "Assurant",
    "description": "<p></p><p><span>Assurant is more than a place to work. It’s a place where your work matters. </span></p><p><span>Our employees are the heart and soul of our company. Our work environment fosters teamwork and collaboration. We provide ways to make meaningful contributions, learn and develop professionally. We encourage creativity and innovation. The more our employees succeed, the better we are able to serve our customers. </span></p><p><span>Assurant is the company that protects and secures the places people live and the things they buy. We’re a Fortune 500 company with approximately 16,000 employees in 21 countries across North America, Latin America, Europe and Asia-Pacific. We help keep life running smoothly for more than 300 million people around the world. Protecting 38 million mobile devices. 40 million motor vehicles. 80 million appliances. 36 million mortgages. And that's just the beginning. </span></p><p></p>",
    "website": "http://www.assurant.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/aAOIHtOfZUakK6eMnrvDHslwvBesfDvE3ChMZBz4.png"
  },
  {
    "name": "Paycor",
    "description": "<p>More than 30,000 medium-sized and small businesses trust Paycor to help them manage their most valuable asset—their people. Paycor is known for delivering modern, intuitive recruiting, HR and payroll solutions, but what makes us legendary is our singular focus on helping business leaders, entrepreneurs and HR professionals make a real difference in their organizations. Paycor’s personalized support and user-friendly, scalable technology streamlines every aspect of people management, giving our clients the peace of mind to focus on what they know best, their business and their mission. Paycor is recommended by today’s most innovative brokers, bankers, and CPAs.</p>",
    "website": "https://www.paycor.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/TNMAdWUeM6toXMXI20yBH6dQIo3elF44uZ2xXlC1.png"
  },
  {
    "name": "Paychex",
    "description": "<p></p><p><span>Supporting business owners and HR professionals to help make the complex simple. </span></p><p><br></p><p><span>Paychex, Inc. (NASDAQ: PAYX) is a recognized leader in the payroll, human resource, and benefits outsourcing industry, with a steadfast commitment to success and a record of achievement that continues a tradition of delivering excellence.</span></p><p><br></p><p><span>Paychex, Inc. (NASDAQ:PAYX) is a leading provider of integrated human capital management solutions for payroll, benefits, human resources, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by more than 45 years of industry expertise, Paychex serves approximately 670,000 payroll clients as of May 31, 2019 across more than 100 locations in the U.S. and Europe, and pays one out of every 12 American private sector employees. </span></p><p></p>",
    "website": "https://www.paychex.com/",
    "location": "NY",
    "logo": "https://cdn.remote.work/companies/0orahlUfvFlGFsCQI7OwgsqO7BGckpuvmyhpKOzo.png"
  },
  {
    "name": "Quora",
    "description": "<p></p><p><span>Quora is a Q&amp;A platform that empowers people to share and grow the world’s knowledge. </span></p><p><br></p><p><span>The vast majority of human knowledge is still not on the internet. Most of it is trapped in the form of experience in people’s heads, or buried in books and papers that only experts can access. More than a billion people use the internet yet only a tiny fraction contribute their knowledge to it. We want to democratize access to knowledge of all kinds—from politics to painting, cooking to coding, etymology to experiences—so if someone out there knows something, anyone else can learn it. Our mission is to share and grow the world's knowledge, and we're building a world-class team to help us achieve this mission.</span></p><p><br></p><p><span>Visit quora.com/careers to browse open roles and apply online.</span></p><p><br></p><p><span>Quora company blog: blog.quora.com</span></p><p><span>Engineering blog: engineering.quora.com</span></p><p><span>Design blog: design.quora.com</span></p><p><span>Data blog: data.quora.com</span></p><p></p>",
    "website": "https://www.quora.com/careers",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/qxQrHr0Mljkco17Hr8Ru1dzKjYfF6X0fd94ublD4.png"
  },
  {
    "name": "Alignable",
    "description": "<p></p><p><span>Alignable: The Small Business Network</span></p><p><span>With 6 million+ members, and 100 million+ connections across more than 30,000 local communities, Alignable is the online network where small business owners across North America drive leads and prospects, generate referrals, land new business, build trusted relationships, and share great advice.</span></p><p><span>Members use Alignable to get the industry answers they need, connect within their local business community or across the country, and increase buzz for their business.</span></p><p><span>Headquartered in Boston, Alignable is venture-backed by Mayfield Fund, Recruit Strategic Partners, Saturn Partners, NextView Ventures and Lead Edge Capital.</span></p><p></p>",
    "website": "http://www.alignable.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/tBkVpt9r4sAJpmF42fMvHDLVYYwzdPfn0gAXbCvr.jpg"
  },
  {
    "name": "Givebutter",
    "description": "<p></p><p><span>Givebutter is an online fundraising platform powering more than $100 million in donations per year for over 30,000 organizations and causes. Givebutter was founded in 2016 from a college dorm room with the goal of building a better crowdfunding platform for students and student groups, which grew rapidly thanks to key innovations such as being the first to offer Venmo-integrated fundraising. </span></p><p></p>",
    "website": "https://givebutter.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/F7HQY4d3gmJFjrRBrsee6HduJmVVYhqk5M5cKb5P.png"
  },
  {
    "name": "Algolia",
    "description": "<p></p><p><span>Our mission is to enable every developer and product team to build consumer-grade search for their users that is easy to implement, engaging, and high-performing. With Algolia, consumers are able to easily find and discover what they want across web, mobile, and voice. </span></p><p><br></p><p><span>Algolia is the search-as-a-service platform that enables companies of all sizes to deliver fast and relevant digital experiences that drive real results. More than 8,000 companies including Stripe, Discovery, Medium, LVMH, Lacoste, Zendesk and Birchbox rely on Algolia to manage 70 billion search queries a month. </span></p><p><br></p><p><span>Founded in 2012, we're backed by $184M in funding from Accel Partners, Alven, DAG Ventures, Founders Circle, Owl Rock Capital, Point Nine Capital, SaaStr Fund, Salesforce Ventures, Storm Ventures and World Innovation Lab. The team is headquartered in San Francisco with offices in Paris, London, Tokyo, New York, and Atlanta. </span></p><p></p>",
    "website": "https://www.algolia.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/0mnWxtjONCPxi8xKDpXFkUjV5Cg2R5HuAFJlF0Dr.png"
  },
  {
    "name": "EverCommerce",
    "description": "<p></p><p><span>EverCommerce is a portfolio company born from the leadership team of successful software startups, renowned private equity firms, and Fortune 500 enterprises. We seek out, acquire, and bring together best-of-breed solutions in the service sector, forming a combined service commerce platform. Our ecosystem provides tailwind, expertise, and resources to help software and solution companies penetrate markets, reach new targets, build efficiency &amp; scale, create revenue predictability, and ultimately reach new heights.</span></p><p></p>",
    "website": "https://www.evercommerce.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/zkNCtGQzFWvJtMYATahEjv5aKPGtTCUOU38yfzlC.png"
  },
  {
    "name": "JUUL Labs",
    "description": "<p></p><p><span>Juul Labs is a thriving team of scientists, engineers, designers and professionals who are committed to offering adult smokers alternatives to combustible cigarettes, while combating underage use of our products. JUUL products are designed to transition adult smokers from combustible cigarettes by providing a competitive nicotine experience.</span></p><p><br></p><p><span>Product</span></p><p><span>Juul Labs’ technology was developed in support of our mission. The JUUL product consists of two main components: e-liquid and the JUUL device. JUUL e-liquid aims to provide a nicotine experience similar to combustible cigarette use. The JUUL device is built to deliver this e-liquid as a vapor while maintaining a low temperature regulation system designed to minimize combustion.</span></p><p><br></p><p><span>Revolutionary thinking</span></p><p><br></p><p><span>Adam Bowen and James Monsees co-founded Juul Labs when they applied their background in product design to the challenge of finding a true alternative to smoking combustible cigarettes. As smokers for many years,  they could find no acceptable alternative. Adam and James recognized an opportunity to apply industrial design to the tobacco industry. The result was the JUUL product.</span></p><p><br></p><p><span>Our commitment</span></p><p><br></p><p><span>We understand that trust in our company and category has eroded with our stakeholders and it is our responsibility to earn back that trust through our actions. To earn a license to operate in society, we are putting stakeholder trust at the center of what we do and make choices that are informed by the views of our stakeholders, including and especially our regulators.</span></p><p><br></p><p><span>Our intent</span></p><p><br></p><p><span>Our customer base is the world’s one billion adult smokers. We do not want any non-nicotine users, especially those underage, to try our products as they exist only to transition the world’s one billion adult smokers away from combustible cigarettes. We believe smokers should first and foremost quit. But for those who cannot or will not quit, access to alternatives to combustible cigarettes and accurate information about those alternatives is critical.</span></p><p></p>",
    "website": "https://www.juullabs.com/",
    "location": "D.C.",
    "logo": "https://cdn.remote.work/companies/7f3aw9RUUG01B5Rpjwo4LzslZmyNY6DdQ2vdDOKq.jpg"
  },
  {
    "name": "Crowe",
    "description": "<p></p><p><span>Crowe LLP is a public accounting, consulting and technology firm with offices around the world. Crowe uses its deep industry expertise to provide audit services to public and private entities. The firm and its subsidiaries also help clients make smart decisions that lead to lasting value with its tax, advisory and consulting services. Crowe is recognized by many organizations as one of the best places to work in the U.S. As an independent member of Crowe Global, one of the largest global accounting networks in the world, Crowe serves clients worldwide. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.</span></p><p></p>",
    "website": "http://www.crowe.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/muz1zsl5BueWsepTCvli3DK2S8GUCMQDHe8hGhmX.jpg"
  },
  {
    "name": "KIND",
    "description": "<p></p><p><span>KIND is more than just a brand of whole nut and fruit bars made from ingredients you can see and pronounce®—it is also a movement and way of being. At KIND, we aim to make the world a bit kinder through all that we do and how we do it—from the products we create to the way we work, live and give back. And that may be why nutritionists, foodies and social leaders alike all agree that KIND is the best snack around!</span></p><p><br></p><p><span>We're looking for passionate, conscious collaborators to help us meet our goals: to inspire kindness, with one tasty snack (and good act) at a time. If that's you, check out our open positions: http://kindsnacks.submit4jobs.com/</span></p><p></p>",
    "website": "http://www.kindsnacks.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/qQFawlqyb45y7zDXTg3cM911MRW6yy826l9dhvtv.png"
  },
  {
    "name": "Under Armour",
    "description": "<p></p><p><span>Under Armour has one mission: to make you better. The Brand was created on a football field in 1996 when University of Maryland special teams captain Kevin Plank looked down at his heavy, sweaty cotton T-shirt and thought: there has got to be something better. So, he made a T-shirt that keeps you cool, light, and dry, so you can push yourself further. And it changed the way athletes dress forever.</span></p><p></p>",
    "website": "https://www.underarmour.com/en-us/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Z294AGum4YZzKxBMETQFSVlPtdTcSLfojcdjEUsQ.png"
  },
  {
    "name": "KeyBank",
    "description": "<p></p><p><span>At KeyBank we’ve made a promise to our clients that they will always have a champion in us. To deliver on our promise, we’re committed to building a team of engaged employees who do the right thing for our clients and shareholders, and help them achieve financial wellness each and every day.</span></p><p><span>Headquartered in Cleveland, Ohio, KeyCorp is one of the nation’s largest financial services companies. Key Companies provide investment management, retail and commercial banking, consumer finance and investment banking products to individuals and companies throughout the United States and, for certain businesses, internationally.</span></p><p></p>",
    "website": "https://www.key.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/nwSC4RHT3hKjjKjOEv0vieC0sCw1U1eBWPEGjIiP.jpg"
  },
  {
    "name": "SmartCommerce",
    "description": "<p></p><p><span>SmartCommerce empowers marketing teams at CPG brands like P&amp;G, Unilever and Nestle to own and drive their customers'​ buying experience.  </span></p><p><span>SmartCommerce's Click2Cart functionality lets shoppers drop products into digital store carts from anywhere - the brand's website, social media, email, ads, influencer blogs, and more.</span></p><p></p>",
    "website": "http://www.smartcommerce.co/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Obqog3JGg46nSEr5xZAOP5eWsaqjnLeXFvnfx1uU.png"
  },
  {
    "name": "SmartCommerce",
    "description": "<p></p><p><span>SmartCommerce empowers marketing teams at CPG brands like P&amp;G, Unilever and Nestle to own and drive their customers'​ buying experience.  </span></p><p><span>SmartCommerce's Click2Cart functionality lets shoppers drop products into digital store carts from anywhere - the brand's website, social media, email, ads, influencer blogs, and more.</span></p><p></p>",
    "website": "http://www.smartcommerce.co/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Obqog3JGg46nSEr5xZAOP5eWsaqjnLeXFvnfx1uU.png"
  },
  {
    "name": "SelectQuote",
    "description": "<p></p><p><span>We help you keep your promises by shopping many highly rated insurance companies to find you the right coverage at the right price. Call (800) 691-5006.</span></p><p><span>At SelectQuote, We Shop, You Save is our commitment to helping people like you keep their promises since 1985. SelectQuote shops many highly rated insurance companies to find you the best rates and have helped millions of families with their life, auto, home and Medicare insurance needs.</span></p><p></p>",
    "website": "https://www.selectquotecareer.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ZCi4YEoO22tE9v7nj02K9WQEbyT5qXsoMRJiWMtD.png"
  },
  {
    "name": "Gannett",
    "description": "<p></p><p><span>Gannett is a subscription-led and digitally focused media and marketing solutions company committed to empowering communities to thrive. </span></p><p><br></p><p><span>We connect communities in meaningful ways through our powerful network, including local media brands in 46 states, iconic USA TODAY, digital marketing services and USA TODAY NETWORK Ventures division.​</span></p><p></p>",
    "website": "https://www.gannett.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/CANN33V12Rqayqui55y1lmtslS4Mc4Mo5EQn81st.png"
  },
  {
    "name": "Pearson",
    "description": "<p></p><p>We are the world’s learning company with more than 22,500 employees operating in 70 countries. We provide content, assessment and digital services to learners, educational institutions, employers, governments and other partners globally. We are committed to helping equip learners with the skills they need to enhance their employability prospects and to succeed in the changing world of work. We believe that wherever learning flourishes so do people.</p><p><br></p><p></p>",
    "website": "http://www.pearson.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/AlPEs7GcTapaUCdXShExE4xTAps9MHDwpx9BLP6L.png"
  }
]