[
  {
    "name": "FireMon",
    "description": "<p></p><p><span>FireMon is the only agile network security policy platform for firewalls and cloud security groups providing the fastest way to streamline network security policy management, which is one of the biggest impediments to IT and enterprise agility. Since creating the first-ever network security policy management solution, FireMon has delivered command and control over complex network security infrastructures for more than 1,700 customers located in nearly 70 countries around the world.</span></p><p></p>",
    "website": "https://www.firemon.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/8wvyb5khxmHmiCLAXlA7xPKvxASCgeBxlqEHhHrd.jpg"
  },
  {
    "name": "Innovien Solutions",
    "description": "<p></p><p><span>High-Performers. Supercharged Solutions. On-Demand Talent.</span></p><p><br></p><p><span>Innovien Solutions is in the business of catapulting technology leaders and IT professionals to their next level of performance while making them look good in the process.</span></p><p><span> </span></p><p><span>We offer technology consulting, managed services, project implementation and staff augmentation for mid-sized to Fortune 500 companies.</span></p><p><span> </span></p><p><span>In an industry rife with reputation problems, we aim to please, developing deep and meaningful relationships with our clients and teams in order to serve and steward with trust. Working as partners, we're intentional and proactive, always looking for the next opportunity and the next win. Not one to rest on our laurels, were committed to consistency and we're disruptors of complacency. Obsessed with delivering remarkable client service, we don't forget the fundamentals, because the small stuff matters, too.</span></p><p></p>",
    "website": "http://www.innovien.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/MTvuuVfZEmlT6syQ5WvTTGOIuEMXtkwQyQFSt2jb.jpg"
  },
  {
    "name": "Provi",
    "description": "<p></p><p><span>Provi simplifies the beverage industry in the increasingly saturated business of booze. As a communication platform and open marketplace, Provi empowers thousands of buyers, distributors, and brands to streamline their operations and make better business decisions.</span></p><p></p>",
    "website": "https://provi.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/BjBfDC7DP2CezaQID6LnK7FwrmlbaQSoEqxPOBwk.jpg"
  },
  {
    "name": "Level Ex",
    "description": "<p></p><p>Level Ex® (a Brainlab company) creates industry-leading video games for physicians. The company uses state-of-the-art video game technology and cognitive neuroscience to capture the challenges of practicing medicine—revolutionizing the way healthcare professionals advance their clinical skills, earn CME, and keep up-to-speed on challenging cases, new medical devices, drug therapies, and clinical best practices. The company's medical video games run on phones, tablets, and web browsers with over 700,000 healthcare professionals playing its games. Top 20 pharmaceutical and medical device companies, national medical societies, and government organizations including NASA leverage Level Ex’s acclaimed platform for education and training.</p><p><br></p><p></p>",
    "website": "http://www.levelex.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/gBrKlhdvF5KItYPAac8d8tf5YuWop4iVXot8wKRF.jpg"
  },
  {
    "name": "Q-Centrix",
    "description": "<p></p><p><span>Q-Centrix is a quality data management solutions provider that comprehensively partners with health care providers to measurably improve the safety and quality of care they deliver while reducing costs. Combining modern technology with a team of top quality information experts throughout the country, we process in excess of 2 million quality data transactions annually.</span></p><p><br></p><p><span>Core Measures ▪ Registries ▪ Concurrent Review ▪ Mortality Review Infection Prevention ▪ Peer Review</span></p><p></p>",
    "website": "http://q-centrix.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/oxpxTRF8KdSOZyoYzjp7E2UO2cd6aneJyiEO1sIb.jpg"
  },
  {
    "name": "UKG",
    "description": "<p></p><p>At UKG (Ultimate Kronos Group), Our Purpose Is People. Built from a merger that created one of the largest cloud companies in the world, UKG believes organizations succeed when they focus on their people. As a leading global provider of HCM, payroll, HR service delivery, and workforce management solutions, UKG’s award-winning Pro, Dimensions, and Ready solutions help tens of thousands of organizations across geographies and in every industry drive better business outcomes, improve HR effectiveness, streamline the payroll process, and help make work a better, more connected experience for everyone. With more than 12,000 employees around the globe, UKG’s inclusive workplace culture has led to numerous awards, including consecutive years ranked as one of Fortune’s 100 Best Companies to Work For. To learn more, visit www.ukg.com.</p><p><br></p><p></p>",
    "website": "https://www.ukg.com/",
    "location": "Not Listed",
    "logo": "https://cdn.remote.work/companies/xTAIRN3HCE4Kf3xKWqm5Agx7RALjCHlyjW6uYfzH.jpg"
  },
  {
    "name": "InfoTrust",
    "description": "<p></p><p><span>InfoTrust is a digital analytics consulting, data governance, and technology company with a broad range of Google Partner Certifications. Our team works with many of the largest brands in the world. From San Francisco to Dubai, InfoTrust specializes in online measurement architecture for multi-brand companies, breaking down silos and validating data to ensure teams have the confidence to make data-backed decisions for their business.</span></p><p><br></p><p><span>InfoTrust is a certified Google Marketing Platform Sales Partner and Google Cloud Partner.</span></p><p><br></p><p><span>Our product division is the engineering team behind Tag Inspector, a tag audit platform designed for marketers who manage large sites or multi-brand enterprises.</span></p><p><br></p><p><span>Learn more about us at infotrust.com and check out our open positions at infotrust.com/careers.</span></p><p></p>",
    "website": "https://infotrust.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/tFEqdJfZ1zZm4vB2uzgwTv7xcOPBbnEBXpCz180N.png"
  },
  {
    "name": "Metova",
    "description": "<p></p><p><span>Metova is a privately held leading technology company creating custom world-class mobile, web, and Internet of Things technology services for customers looking to respond to a disruption in their industry or looking to make waves as the disruptor.</span></p><p><br></p><p><span>We build amazing things for companies that disrupt and innovate, have been building custom software solutions since 2006, and can help anyone do the same.</span></p><p><br></p><p><span>We help companies transform their business through technology to meet the growing expectations of the customers they have and the customers they want. By helping identify their needs, we can define and build the experiences they expect, align with business goals to streamline workflows, and increase revenues while delighting customers.</span></p><p></p>",
    "website": "http://metova.com/",
    "location": "http://metova.com/",
    "logo": "https://cdn.remote.work/companies/1gOb5QkDJdKId7ghpRJLCZeubYBpcC8O263qgLPX.png"
  },
  {
    "name": "Allscripts",
    "description": "<p></p><p>Allscripts (NASDAQ: MDRX) is a leader in healthcare information technology solutions that advance clinical, financial and operational results. Our innovative solutions connect people, places and data across an Open, Connected Community of Health™. Connectivity empowers caregivers to make better decisions and deliver better care for healthier populations. To learn more, visit&nbsp;www.allscripts.com, Twitter, YouTube and blog.allscripts.com.</p><p><br></p><p></p>",
    "website": "http://www.allscripts.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/xrSiPBqallHgV5Yv1M6sGtHorzVl1kNnWASOuU1V.jpg"
  },
  {
    "name": "Litmus",
    "description": "<p></p><p>At Litmus, we know the importance of continuous innovation. By staying in front of industry trends, we are able to provide cutting edge solutions for marketers around the world. With the latest release, simplify your workflow, create more effective emails, and get valuable insights that can inform and improve the results of your other marketing channels—all within one, seamless view. Major global brands across every industry and vertical trust Litmus to make email better and easier than ever, including 9 of the top 10 ecommerce brands, 7 of the top 10 technology companies, and 23 of the top 25 US ad agencies. Backed by Spectrum Equity, the new, redesigned Litmus makes it easier than ever for teams to quickly organize, build, test, and review emails in one centralized application, streamlining the production process and improving visibility and collaboration.</p><p></p>",
    "website": "http://litmus.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/3fgTUxeid2uV6IP2fuTN8TLMPvJBhuSw7NK76zzv.png"
  },
  {
    "name": "Zynga",
    "description": "<p></p><p>Zynga was founded in 2007 with the vision that play would become one of the core activities on the Internet. We pioneered social games with the belief that if we could make games simple, accessible and social the world would start playing. We are excited that games have grown to become the second most popular activity by time spent, even surpassing email. But we have a lot of hard work, innovation and growth ahead of us to create a future where social gaming is a daily habit for everyone.</p><p><br></p><p></p>",
    "website": "http://www.zynga.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/uC1CK8yL893teuUL8KG2pj2YfnFiUoQ0W1s73lcH.jpg"
  },
  {
    "name": "Lumen",
    "description": "<p></p><p><span>We are a global company of over 40,000 professionals, dedicated to empowering businesses to produce amazing things. Driven by the challenges and opportunities of the 4th Industrial Revolution, we’re helping to change how people interact and how companies acquire, analyze and act on data with flexible, intelligent, secure and collaborative solutions built for the next generation of business.</span></p><p></p>",
    "website": "https://www.lumen.com/en-us/home.html",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/oY3FNXN04As7GA77JXNCPLuYuIx9Y0MxFDoMWhPb.jpg"
  },
  {
    "name": "Highmark",
    "description": "<p></p><p>Highmark Inc. is among the ten largest health insurers in the United States and is the fourth-largest Blue Cross and Blue Shield-affiliated company. Highmark and its diversified businesses and affiliates operate health insurance plans in Pennsylvania, Delaware and West Virginia that serve 5.2 million members. Its diversified health businesses serve group customer and individual health needs across the United States through dental insurance, vision care and other related health businesses. Highmark is an independent licensee of the Blue Cross and Blue Shield Association, an association of independent Blue Cross and Blue Shield companies. For more information, visit www.highmark.com.</p><p><br></p><p></p>",
    "website": "http://www.highmark.com/",
    "location": "Not Listed",
    "logo": "https://cdn.remote.work/companies/Xw2ASpBELoZSLRUWzWmGDEH4SiDTol28kdQs5VuD.png"
  },
  {
    "name": "Relativity",
    "description": "<p></p><p>At Relativity, we make software to help users organize data, discover the truth, and act on it. Our platform is used by more than 13,000 organizations around the world to manage large volumes of data and quickly identify key issues during litigation, internal investigations, and compliance operations with SaaS platform RelativityOne and Relativity Trace. Relativity has users in 48+ countries from organizations, including the U.S. Department of Justice, and 199 of the Am Law 200. Relativity has been named one of Chicago's Top Workplaces by the Chicago Tribune for nine consecutive years.</p><p><br></p><p></p>",
    "website": "http://www.relativity.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/LBvbQwK4z78wGm46ULfAcC1mwlsN0MiyIfEZGipU.png"
  },
  {
    "name": "Thermo Fisher Scientific",
    "description": "<p></p><p><span>Thermo Fisher Scientific Inc. (NYSE: TMO) is the world leader in serving science, with revenues of more than $24 billion and approximately 70,000 employees globally. Our mission is to enable our customers to make the world healthier, cleaner and safer. We help our customers accelerate life sciences research, solve complex analytical challenges, improve patient diagnostics, deliver medicines to market and increase laboratory productivity. Through our premier brands – Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific and Unity Lab Services – we offer an unmatched combination of innovative technologies, purchasing convenience and comprehensive services. For more information, please visit www.thermofisher.com</span></p><p></p>",
    "website": "https://www.thermofisher.com/",
    "location": "MA",
    "logo": "https://cdn.remote.work/companies/M2yL74oFCXPthQNdL6n0SwGxBjfj13oJ4oLHwDDz.png"
  },
  {
    "name": "Pinterest",
    "description": "<p></p><p><span>Pinterest's mission is to bring everyone the inspiration to create a life they love. It’s the biggest dataset of ideas ever assembled, with over 100 billion recipes, home hacks, style inspiration and other ideas to try. More than 440 million people around the world use Pinterest to dream about, plan and prepare for things they want to do in life.</span></p><p></p>",
    "website": "https://www.pinterestcareers.com/",
    "location": "California US",
    "logo": "https://cdn.remote.work/companies/HNtwP418DsXt2JehpYlRJOLstkVQabas2xhg7Whx.jpeg"
  },
  {
    "name": "Magellan Health",
    "description": "<p></p><p><span>Magellan Health is a leader in managing the fastest growing, most complex areas of health, including special populations, complete pharmacy benefits and other specialty areas of healthcare. Magellan supports innovative ways of accessing better health through technology, while remaining focused on the critical personal relationships that are necessary to achieve a healthy, vibrant life. Magellan's customers include health plans and other managed care organizations, employers, labor unions, various military and governmental agencies and third-party administrators. For more information, visit MagellanHealth.com.</span></p><p><br></p><p><br></p><p></p>",
    "website": "http://www.magellanhealth.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/jjeEQc1JIAT8xPFipduHvA8mc9iVl1SFIaXI8gLh.png"
  },
  {
    "name": "Conduent",
    "description": "<p>Conduent delivers mission-critical ​services and solutions on behalf of businesses and governments – creating exceptional outcomes for its clients and the millions of people who count on them. Through people, process and technology, Conduent solutions and services automate workflows, improve efficiencies, reduce costs and enable revenue growth. It’s why most Fortune 100 companies and over 500 government entities depend on Conduent every day to manage their essential interactions and move their operations forward.\n \nConduent’s differentiated services and solutions improve experiences for millions of people every day, including two-thirds of all insured patients in the U.S., 10 million employees who use its HR Services, and nearly nine million people who travel through toll systems daily. Conduent’s solutions deliver exceptional outcomes for its clients including $17 billion in savings from medical bill review of workers compensation claims, up to 40% efficiency increase in HR operations, and up to 40% improvement in processing costs, while driving higher end-user satisfaction.</p>",
    "website": "https://www.conduent.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ztRyntuamyOCdGJ9KtVNwZAB7qVLynr0UKY3XlLo.jpeg"
  },
  {
    "name": "Jitterbit",
    "description": "<p></p><p><span>Jitterbit is the API transformation company that accelerates innovation by combining the power of APIs and integration. The Jitterbit API integration platform enables companies to rapidly connect SaaS, on-premise and cloud applications and instantly infuse artificial intelligence into any business process. With Jitterbit, integration moves at the speed of business as needs evolve. Jitterbit has been in business for more than 10 years and 50,000 users trust Jitterbit to connect the digital systems they use every day. A leader in the Gartner Magic Quadrant for Enterprise Integration Platform-as-a-Service, Jitterbit is also ranked #1 in Customer Satisfaction for Cloud Data Integration on G2Crowd.</span></p><p></p>",
    "website": "http://www.jitterbit.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/m9Eh0T5HwQFUEdwf3DvfQkY6eQ3Wbsyz0KCxIrNr.png"
  },
  {
    "name": "VSP Global",
    "description": "<p></p><p><strong>About Us</strong></p><p>At VSP Global, our vision is to provide access to affordable, high-quality eye care and eyewear to the world. VSP Global comprises five complementary businesses that combine eye care insurance, high-quality eyewear, lens and lens enhancements, ophthalmic technology, and connected experiences to strengthen the relationship between patients and their eye doctors. </p><p><br></p><p>Vision Care</p><p>VSP Vision Care provides global access to high-quality, affordable eye care and eyewear, partnering with more than 40,000 network doctors and nearly 90 million members worldwide.</p><p><br></p><p>Eyewear</p><p>Marchon® Eyewear is one of the world's largest designer manufacturers and distributors of quality eyewear and sun wear. Marchon includes Altair®, which supports independent optical retailers with an innovative approach to frame board management and desirable brands. </p><p><br></p><p>Optics</p><p>VSP Optics brings together ophthalmic technology and lab services to create custom lens solutions that meet the individual vision and lifestyle needs of millions of people every year.</p><p><br></p><p>Practice Solutions</p><p>Eyefinity is the industry leader in practice management and EHR software, offering solutions that integrate technology products and services, and help streamline the everyday complexities of managing a business.</p><p><br></p><p>Retail</p><p>VSP Retail creates connected consumer experiences designed to strengthen the relationship between patients and their eye doctors.</p><p><br></p><p>Eyes of Hope</p><p>Through Eyes of Hope, we support local communities around the globe through programs that bring access to eye care, eyewear, education, and disaster relief where they're needed most. Together with VSP network doctors, to date, VSP Global Eyes of Hope has provided access to no-cost eye care and eyewear for more than 2 million people in need worldwide.</p><p><br></p><p></p>",
    "website": "http://www.vspglobal.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/wd9wqqPH15XMingcMzBkA69wQZlkRtObqV5BUBxR.png"
  }
]
