[
  {
    "name": "Kin + Carta",
    "description": "<p></p><p><span>A global consulting firm built for the 2020s, Kin + Carta makes the journey to becoming a digital business tangible, sustainable and profitable. At Kin + Carta, our difference comes down to a simple belief: Highly specialized talent can be connected without being diluted. We bring 1,600 specialists across four continents closer together, delivering end-to-end digital services via three integrated pillars: Kin + Carta Advise, a tech-centric management consultancy; Kin + Carta Create, a next-gen software engineering studio; and Kin + Carta Connect, a digital marketing agency. </span></p><p><br></p><p><span>By building digital twins to replace existing analog processes, designing and launching new digital products and services, and unlocking future innovation through modernisation initiatives, Kin + Carta seamlessly integrates the strategic consulting, software engineering and marketing technology needed to help businesses Make It Happen.  </span></p><p><br></p><p><span>Headquartered out of London and Chicago, clients have access to a global ecosystem of 1,600 strategists, engineers and creatives across four continents.</span></p><p></p>",
    "website": "http://www.kinandcarta.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/kY0nJWbUpDYYuH4ZDDFm1G39ZFKU3kvq5J4klRWj.jpg"
  },
  {
    "name": "SAP",
    "description": "<p></p><p><span>At SAP, our purpose is to help the world run better and improve people’s lives. Our promise is to innovate to help our customers run at their best. SAP is committed to helping every customer become a best-run business. We engineer solutions to fuel innovation, foster equality, and spread opportunity across borders and cultures. Together, with our customers and partners, we can transform industries, grow economies, lift up societies, and sustain our environment. #TheBestRun</span></p><p><br></p><p><span>SAP privacy statement for followers: www.sap.com/sps</span></p><p></p>",
    "website": "http://www.sap.com/",
    "location": "BW",
    "logo": "https://cdn.remote.work/companies/wKECaDdDujSHb6U3qieChFMUTMA5XpyrNu4UiCYe.jpg"
  },
  {
    "name": "GEICO",
    "description": "<p></p><p><span>We know you know GEICO, but we want you to know that with us, you’ll find a rewarding career no matter which path you take. Our over 40,000 associates have been unexpectedly delighted to find that their jobs have turned into illuminating careers. You know us for insurance. Get to know us for great careers, too.</span></p><p><br></p><p><span>Just the Stats on GEICO</span></p><p><br></p><p><span>■ 16 million auto policyholders (and growing!)</span></p><p><span>■  Insures more than 20 million vehicles </span></p><p><span>■  Second-largest private passenger auto insurer in the United States (A.M. Best)</span></p><p><span>■  Employs more than 40,000 associates </span></p><p><span>■  Maintains 16+ offices around the country </span></p><p><span>■  Provides 24-hour service, 7 days a week, 365 days a year</span></p><p><br></p><p><span>GEICO's seven operating principles help create a workplace in which our associates can thrive. We're looking for great associates that share our ability to incorporate these values into our corporate culture and day-to-day business activities!</span></p><p><br></p><p><span>■ Respect, support and provide opportunity for all associates</span></p><p><span>■ Be fanatics for outstanding customer service</span></p><p><span>■ Be the low-cost provider</span></p><p><span>■ Operate with uncompromising integrity</span></p><p><span>■ Maintain a disciplined balance sheet</span></p><p><span>■ Make an underwriting profit while achieving optimum growth</span></p><p><span>■ Invest for total return</span></p><p><br></p><p><span>Career Opportunities at GEICO</span></p><p><br></p><p><span>■ Jobs in Sales, Customer Service and Claims in most major locations</span></p><p><span>■ Auto Damage Adjuster careers in most states </span></p><p><span>■ Information Technology jobs utilizing cutting edge technologies </span></p><p><span>■ Careers in Actuary, Product Management and Underwriting Research</span></p><p><span>■ Fast-track Leadership Programs for college graduates</span></p><p><span>■ Legal careers in headquarters and in many states</span></p><p><br></p><p><span>GEICO Has Office Locations In</span></p><p><br></p><p><span>■ Chevy Chase, Maryland (HQ)</span></p><p><span>■ Fredericksburg, Virginia</span></p><p><span>■ Woodbury, New York</span></p><p><span>■ Macon, Georgia</span></p><p><span>■ San Diego, California</span></p><p><span>■ Dallas, Texas</span></p><p><span>■ Lakeland, Florida</span></p><p><span>■ Marlton, New Jersey</span></p><p><span>■ Virginia Beach, Virginia</span></p><p><span>■ Buffalo, New York</span></p><p><span>■ Tucson, Arizona</span></p><p><span>■ Indianapolis, Indiana</span></p><p><span>■ North Liberty, Iowa</span></p><p><span>■ Honolulu, Hawaii</span></p><p><span>■ Houston, Texas</span></p><p><span>■ Seattle, Washington</span></p><p><span>■ Kansas City, Kansas</span></p><p></p>",
    "website": "http://www.geico.jobs/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ev01jrXlg9lkMPg6VORKMuVXlJTQWuWXNzyw44oP.jpg"
  },
  {
    "name": "McAfee",
    "description": "<p>McAfee is a global organization with a 30-year history and a brand known the world over for innovation, collaboration and trust. McAfee’s historical accomplishments are founded upon decades of threat and vulnerability research, product innovation, practical application and a brand which individuals, organizations and governments have come to trust.</p>",
    "website": "https://www.mcafee.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/336IL8FwPfe8zYX1a5DN4ijZlFZnZCbX75vG4iOm.png"
  },
  {
    "name": "SmartCommerce",
    "description": "<p></p><p><span>SmartCommerce empowers marketing teams at CPG brands like P&amp;G, Unilever and Nestle to own and drive their customers'​ buying experience.  </span></p><p><span>SmartCommerce's Click2Cart functionality lets shoppers drop products into digital store carts from anywhere - the brand's website, social media, email, ads, influencer blogs, and more.</span></p><p></p>",
    "website": "http://www.smartcommerce.co/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/Obqog3JGg46nSEr5xZAOP5eWsaqjnLeXFvnfx1uU.png"
  },
  {
    "name": "bttr",
    "description": "<p></p><p><span>We teach brands to walk and talk for tomorrow. It’s our craft. One that demands relevant solutions for a savvy consumer. We strategize, campaign and influence, tapping into those cultural truths that shape your business.</span></p><p></p>",
    "website": "http://www.bttr-la.com/",
    "location": "CA",
    "logo": "https://cdn.remote.work/companies/xMpCY9yBwqA1ZQdj8bpIf517bADfFEW9rhS1mKoP.png"
  },
  {
    "name": "Future PLC",
    "description": "<p></p><p>Future is a global platform for specialist media with scalable, diversified brands. We connect people to their passions through the high-quality content we create, the innovative technology we pioneer and the engaging experiences we deliver.</p><p></p>",
    "website": "https://www.futureplc.com/",
    "location": "GB",
    "logo": "https://cdn.remote.work/companies/9QsAa4mouzRm7zVpOJo7pZSxRdNL4gtNPGPw3jk8.png"
  },
  {
    "name": "WebstaurantStore",
    "description": "<p></p><p><span>Since our start in 2004, WebstaurantStore.com has succeeded in creating and fostering an innovative, easy-to-use website that meets the purchasing needs of foodservice professionals throughout the world. Our six warehouses located across the United States mean that we are able to serve both North American and international customers with great speed – many items located in our warehouses are ready to ship within one business day! </span></p><p></p>",
    "website": "https://www.webstaurantstore.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/LYGxY6ODGTYvtgnxLf06LQnPxtnr8ypes6B2rurN.png"
  },
  {
    "name": "Tetrate.io",
    "description": "<p></p><p>Enterprise Service Mesh</p><p><br></p><p></p>",
    "website": "http://www.tetrate.io/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/jBR60kNUsDudBg5fxwqDryoSo45MAfEMDrt0QrWv.jpeg"
  },
  {
    "name": "Valvoline",
    "description": "<p></p><p><span>Since its founding, Valvoline and its scientists have been innovating, creating and reinventing formulas for racing, high-mileage and synthetic recycled motor oils. To do this, we take pride in hiring the most innovative and creative minds and helping shape long-term careers. Explore our opportunities and take the step in joining us today for hands-on experience with Valvoline.</span></p><p></p>",
    "website": "http://www.valvoline.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/vAPMXaRUrl2OPdPQPV08xo56FCIMQwepptyNNS8U.png"
  },
  {
    "name": "Capgemini",
    "description": "<p></p><p>Capgemini is a global leader in consulting, digital transformation, technology, and engineering services. The Group is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms. Building on its strong 50-year heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services from strategy to operations. A responsible and multicultural company of 265,000 people in nearly 50 countries, Capgemini’s purpose is to unleash human energy through technology for an inclusive and sustainable future. With Altran, the Group reported 2019 combined global revenues of €17 billion. </p><p><br></p><p></p>",
    "website": "https://www.capgemini.com/",
    "location": "FR",
    "logo": "https://cdn.remote.work/companies/6gHLkGlAwXPn0sMMdznTfYzSg3Ndesx5keBjd6EM.jpg"
  },
  {
    "name": "New Incentives",
    "description": "<p></p><p><span>Helping mothers vaccinate their babies against deadly diseases in Nigeria</span></p><p><br></p><p><span>We are recruiting: https://new-incentives.breezy.hr/</span></p><p></p>",
    "website": "http://www.newincentives.org/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/ttrt1ZlbGtcJtdeYzlGN0g3LCF4nfU1pcLuclz4Z.jpg"
  },
  {
    "name": "LPL Financial",
    "description": "<p>LPL Financial is a leader in the retail financial advice market and the nation’s largest independent broker/dealer*. We serve independent financial advisors and financial institutions, providing them with the technology, research, clearing and compliance services, and practice management programs they need to create and grow thriving practices. LPL enables them to provide objective guidance to millions of American families seeking wealth management, retirement planning, financial planning and asset management solutions. LPL.com\n\nSecurities and Advisory Services offered through LPL Financial. A registered investment advisor, Member FINRA/SIPC.\n\nFollow us on Twitter @lpl.\n\n• Third party posts found on this profile do not reflect the views of LPL and have not been reviewed by LPL as to accuracy or completeness.</p>",
    "website": "https://www.lpl.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/eN4HspIm2von77Mv7r0plIKjFBwbc8uvgfZvTrKh.png"
  },
  {
    "name": "Tetrate.io",
    "description": "<p></p><p>Enterprise Service Mesh</p><p><br></p><p></p>",
    "website": "http://www.tetrate.io/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/jBR60kNUsDudBg5fxwqDryoSo45MAfEMDrt0QrWv.jpeg"
  },
  {
    "name": "Regen Network",
    "description": "<p>Regen Network is a community of actors engaging with ecological regeneration, ecological monitoring, verification, distributed computing and technology development, centered around Regen Ledger. Network members track specific changes of land, oceans and watersheds. By improving our understanding of ecosystems and enabling rewards for verified positive changes, Regen Network catalyses the regeneration of the earth's ecosystems.\n\nUsing distributed ledger technology, satellite remote sensing, and Ecological State Protocols, Regen Network monitors on-the-ground conditions and generates trusted attestations about ecological state. Regen Network provides an open platform designed specifically to run diverse applications such as Regenerative Carbon Credits, Supply Chain Transparency, Reforestation Monitoring, and investment vehicles such as Ecological Bonds. There may be nothing of more critical importance than the regeneration of global ecosystems. Regen Network brings together the tools and communities needed to incentivize actions aligned with planetary health.</p>",
    "website": "https://www.regen.network/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/HWrzzNr0zm1NVYROLToHcLjznGGbkgYmwUjKwjHa.png"
  },
  {
    "name": "Rockwell Automation",
    "description": "<p></p><p><span>At Rockwell Automation, we connect the imaginations of people with the potential of technology to expand what is humanly possible, making the world more intelligent, more connected and more productive. </span></p><p><br></p><p><span>Throughout the world, our flagship Allen-Bradley® and Rockwell Software® product brands are recognized for innovation and excellence.</span></p><p></p>",
    "website": "http://www.rockwellautomation.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/OffFDarJcLKucq1GybhCqvI82ilucxtE8uoB2iGu.png"
  },
  {
    "name": "Leadfeeder",
    "description": "<p></p><p><span>Leadfeeder is a website visitor analytics software that shows you the companies visiting your website, how they got there, and what pages they clicked. </span></p><p><br></p><p><span>Think of us like your lead generation, account-based marketing, and sales intelligence tool all rolled into one, like a burrito. </span></p><p><br></p><p><span>Simply install the Leadfeeder Tracker script in less than 5 minutes! The Leadfeeder Tracker will reveal up to 30% more companies in close to real-time (fresh leads every hour). </span></p><p><br></p><p><span>You can try Leadfeeder Premium free for 14 days (no credit card required).  </span></p><p><br></p><p><span>Plus, we integrate with multiple tools: </span></p><p><span>Google Analytics</span></p><p><span>MailChimp </span></p><p><span>Pipedrive</span></p><p><span>Salesforce</span></p><p><span>HubSpot</span></p><p><span>And, many more! </span></p><p><br></p><p><span>We are an international startup headquartered in Helsinki, Finland.</span></p><p></p>",
    "website": "https://www.leadfeeder.com/",
    "location": "FI",
    "logo": "https://cdn.remote.work/companies/fGnNOvmo5U4aCdO9gD9SgCV3D2YlASW9CT9H8NPn.png"
  },
  {
    "name": "LearnWorlds",
    "description": "<p></p><p><span>LearnWorlds is a powerful, easy-to-use and reliable training solution for individuals and enterprises. A fully customizable, white-label solution to train employees and associates, educate customers, or sell online courses to a wide audience.</span></p><p><span>Our cloud-based e-learning platform offers Professionals, Entrepreneurs &amp; Training Managers a solution tailored to their specific needs and a team of experts to help achieve your goals.</span></p><p></p>",
    "website": "https://www.learnworlds.com/corporate-training/",
    "location": "CY",
    "logo": "https://cdn.remote.work/companies/zmCWADA5MleRmuzT50aAPlXPprvYgdAD9lxuFx03.png"
  },
  {
    "name": "BD",
    "description": "<p></p><p><span>BD is one of the largest global medical technology companies in the world and is advancing the world of health by improving medical discovery, diagnostics and the delivery of care. The company supports the heroes on the frontlines of health care by developing innovative technology, services and solutions that help advance both clinical therapy for patients and clinical process for health care providers. BD and its 65,000 employees have a passion and commitment to help improve patient outcomes, improve the safety and efficiency of clinicians’ care delivery process, enable laboratory scientists to better diagnose disease and advance researchers’ capabilities to develop the next generation of diagnostics and therapeutics. BD has a presence in virtually every country and partners with organizations around the world to address some of the most challenging global health issues. By working in close collaboration with customers, BD can help enhance outcomes, lower costs, increase efficiencies, improve safety and expand access to health care. In 2017, BD welcomed C. R. Bard and its products into the BD family.</span></p><p></p>",
    "website": "http://www.bd.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/zakygukOIOTxlcqwTH0As7W7ayLZ2VNgHkR6LJhk.jpg"
  },
  {
    "name": "Turnitin",
    "description": "<p></p><p><span>Turnitin is a global company dedicated to ensuring the integrity of education and meaningfully improving learning outcomes. For more than 20 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Our products are used by educators to guide their students towards higher standards of integrity and by students, researchers and professionals to do their best, original work. </span></p><p><br></p><p><span>Turnitin has offices in Australia, India, Indonesia, Japan, Korea, Mexico, the Netherlands, the Philippines, Ukraine, the United Kingdom, and the United States. Over 15,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Gradescope, iThenticate, Turnitin Originality, Turnitin Similarity and ExamSoft.  </span></p><p></p>",
    "website": "http://www.turnitin.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/XiSmyymHYIBNHdZCeriJVYLiDpjQ12qHDqUbBm01.jpg"
  },
  {
    "name": "Openly",
    "description": "<p></p><p>Openly is proud to offer innovative, comprehensive homeowners insurance, wrapped in modern convenience.  We arm agents with the tools necessary to serve up a world class customer experience.</p><p><br></p><p></p>",
    "website": "https://openly.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/fE0rpiTpAdtXmYzfDkWC6t8oNEsd2nqh58mx2s7n.jpeg"
  },
  {
    "name": "WeTravel",
    "description": "<p></p><p><span>WeTravel is proud to work with thousands of multi-day travel companies on all five continents, helping them convert their bookings faster and grow their business. With hundreds of millions in payments processed throughout our platform every year, let WeTravel be the right payment solution for your multi-day travel company.</span></p><p></p>",
    "website": "http://www.wetravel.com/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/VPN50XXTiy9AOYJw05SRM3IzYtsPMcro5HhlKFYt.jpeg"
  },
  {
    "name": "ioby",
    "description": "<p></p><p><span>More than just crowdfunding. Community-led positive change.</span></p><p><br></p><p><span>ioby gives leaders the ability to organize all kinds of capital—cash, social networks, in-kind donations, volunteers, advocacy— to build real, lasting change from the ground up.  </span></p><p><br></p><p><span>Three ways we're different: </span></p><p><br></p><p><span>1. Fundraising support</span></p><p><span>ioby's high success rate for funded projects is rooted in a unique model of fundraising coaching. With ioby, you won't just put up a page, you'll work with our team to craft the most effective campaign, fundraising plan, timeline, and budget. We support and train leaders whether they are working on a $500, $5,000, or $50,000 goal.</span></p><p><br></p><p><span>2. Fiscal Sponsorship</span></p><p><span>Unlike other platforms, we support fully tax-deductible donations because we offer fiscal sponsorship to groups that are not established as a nonprofit. Our model encourages grassroots leadership regardless of incorporation status.</span></p><p><br></p><p><span>3. Community Building</span></p><p><span>ioby also believes in the power of offline connections. We can connect you with experts in subjects like urban planning, green infrastructure, and more for help implementing your project. And we hold regular in-person convenings and webinars so our community of changemakers can share knowledge, challenges and experiences.</span></p><p></p>",
    "website": "http://ioby.org/",
    "location": "US",
    "logo": "https://cdn.remote.work/companies/iKeoM2SxPDqR4Not1Jbk79y6ct8a6Ao5KjAluzBL.png"
  },
  {
    "name": "Qwilr",
    "description": "<p></p><p><span>Create the perfect proposal, pitch, sales quote and more with Qwilr.  Our document design and automation tool brings outstanding visual polish, together with intelligent tracking, automation, and integrations. </span></p><p><br></p><p><span>Launched in 2014, Qwilr is loved by sales teams in over 50 markets around the world. It is backed by Point Nine Capital, Right Click Capital and Macdoch Ventures. Qwilr is headquartered in Sydney, Australia, but believes in finding the best talent globally and supports flexible and remote working.</span></p><p></p>",
    "website": "http://qwilr.com/",
    "location": "AU",
    "logo": "https://cdn.remote.work/companies/BYIW2HnvLryV3AaeGbYC9L6nTwqz3EEsVqmvNuQo.jpeg"
  }
]