[
  {
    "title": "C#/.Net WPF Developer",
    "description": "<p></p><p><strong>Project&nbsp;Description</strong></p><p>The investment fund searches for highly skilled professionals to become a part of the Front office technology team that will build a state-of-the-art trading application from the ground up, based on:</p><p>.NET Framework 4.7+, .NET Core 2.0+</p><p>C# 7.0+</p><p>WPF, WinForms</p><p>DevExpress/Infragistics controls library</p><p>Kafka, Tibco, JMS or similar messaging interface</p><p>Microsoft Excel / VBA</p><p>gRPC, Protobuf, Flatbuffers</p><p><strong>Responsibilities</strong></p><ul><li>• Development of solution on C#.NET against the backlog</li><li>• Contribute to architecture and design, come up with creative ideas where possible</li></ul><p><strong>Skills</strong></p><p>Must have</p><ul><li>• 5+ years developing rich user interface applications based on .net C# WPF/WinForms.</li><li>• 5+ years developing multi-threaded, object-oriented solutions</li><li>• 5+ years developing custom/composite controls with rich graphics.</li><li>• 2+ years developing Add-In for Microsoft Excel</li><li>• Self-driven, design screen layout based on requirements and user feedback.</li><li>• Experience interacting with high performance caching layers is plus</li><li>• Proven experience in banking and capital markets</li></ul><p>Nice to have</p><ul><li>• Development in Xamarin, multi-platform/os rollout is a plus.</li><li>• Working knowledge of Java is a plus.</li></ul><p><strong>Languages</strong></p><p>English: C1 Advanced</p><p><strong>Seniority</strong></p><p>Senior</p><p></p>",
    "apply": "https://career.luxoft.com/job/c-net-wpf-developer/327519/",
    "company": "/companies/luxoft",
    "cName": "Luxoft",
    "location": "USA",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Android Developer",
    "description": "<p></p><p><strong>Android Developer</strong></p><p><strong>Job description</strong></p><p>At Mimo, we believe that coding can open doors to careers and opportunities like few other skills. That's why we've rallied around the common goal of making coding universally accessible.</p><p>With the Mimo app, we've made it easy and fun for more than 15 million beginners to start coding on the go and build up their confidence to pursue a career in tech. From bite-size coding exercises to full-fledged projects, we’re helping our learners form a habit of coding and reach university-level learning outcomes. And with the launch of cohort-based programs, we’re well on our way toward becoming the world’s largest tech school. To help millions more learn to code and eventually become developers, we're looking for an Android Developer.</p><p>If you, too, want to make coding accessible to everybody, this is your opportunity to shape the future of tech education.</p><p><strong>Your responsibilities</strong></p><ul><li>Collaborating within a cross-functional team of mobile and backend developers, product designers, and product managers</li><li>Working closely with other Android developers across teams, giving feedback on and reviewing PRs, engaging in pair programming sessions, and sharing knowledge</li><li>Specifying and breaking down features from idea to implementation</li><li>Writing unit tests for logic changes</li><li>Helping shape the product by participating in creative sessions and pitching ideas within your team</li><li>Co-sharing the responsibility of a continuous weekly test and release cycle</li></ul><p><strong>Some of the tools we use</strong></p><ul><li>Modern Kotlin stack including Coroutines and Flow</li><li>MVVM combined with a clean-architecture approach</li><li>A healthy dose of Jetpack, Firebase, and some open-source libraries</li><li>Bitrise/GitHub Actions as our CI/CD</li></ul><h3>Requirements</h3><ul><li>3+ years of experience in Android app development</li><li>Strong knowledge of Kotlin</li><li>Very good written and verbal communication skills in English for documentation, feedback, reviews, specifications, and other exchanges</li><li>Employing a life-long learning mindset and sharing your knowledge within bi-weekly talks, blog posts, and post-mortem processes</li></ul><p>At Mimo, we're not just accepting differences among team members – we're celebrating and promoting them. That’s why we’re committed to mitigating bias and providing equal opportunity in everything we do, including this hiring process.</p><p>By joining Mimo, you'll become part of a diverse, fun, and purpose-driven team with regular team activities like company retreats, hack weeks, and virtual breakfasts or coffee breaks. You'll also have access to great perks for your home office as well as your personal and professional development. We’re a distributed team, have flexible working hours, and there's no overtime. And while we have a small location in Vienna, Austria, most of us are spread over the world. Your annual salary will range from €52k to €80k, depending on your contract type and if you want to have an equity stake in Mimo, and will automatically increase by at least 5% every year.</p><p>If this role and workplace culture sound like you, we can't wait to hear from you!</p><p></p>",
    "apply": "https://jobs.getmimo.com/o/android-developer-3",
    "company": "/companies/mimo",
    "cName": "Mimo",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Application Developer-Angular",
    "description": "<p></p><p>As a leading provider of human capital solutions, we help our clients and their people navigate the complexity of health, wealth and HR. We combine data-driven, consumer-centered technology with personalized care and service to deliver a superior customer experience. Our dedicated colleagues across 28 global centers help 23 million people and their 11 million family members simplify work and life, both now and in the future. At Alight, we are reimagining how people and organizations thrive.</p><p>We’re growing our team of technologists to drive innovation to support hundreds of millions of employee interactions per year.&nbsp;We build highly scalable enterprise solutions with leading technologies and are developing a strategic roadmap to continue driving future innovations&nbsp;for web, mobile, and third-party integrations.&nbsp;</p><p>Be part of a team that is taking our enterprise solutions to the cloud!</p><p>The Java/Angular Developer is responsible for complete design, development and development testing for Angular widget software projects.&nbsp;</p><p>The developer should be deep in his/her technology, Angular widget, and have learning agility and versatility to learn technology outside his/her specialty to improve delivery.&nbsp;The Developer will perform quality review of the work of other team members. The developer should also have a team-first mentality and be willing to help other team members to improve the delivery success.&nbsp;</p><p><strong>Principal Duties and Responsibilities</strong></p><ul><li><strong>Requirements Elicitation, Understanding, Analysis, &amp; Management:&nbsp;&nbsp;</strong>Understand the&nbsp;<span>requirements/stories,</span>&nbsp;and perform the appropriate gap analysis for a&nbsp;<span>platform/technology.&nbsp;</span>&nbsp;Development experience with Angular widgets.</li><li><strong>Participation in Sprint Planning and Sprint Status:&nbsp;&nbsp;</strong>Participate in sprint planning meetings by estimating the tasks to design, build, and development test software. Attend daily huddles to report progress and barriers to progress.</li><li><strong>Design/Development/Development</strong><strong>&nbsp;Testing:&nbsp;&nbsp;</strong>Create the design for micro-service and Angular widgets that effectively meets the&nbsp;<span>requirements/stories.</span>&nbsp;This will involve ensuring the design integrates with other&nbsp;<span>platforms/technologies.</span>&nbsp;The design may be done directly in the code itself.&nbsp;Develop and test the software according to the functional specifications, design, maintainability, and coding and efficiency standards. Complete development tests within each sprint according to acceptance criteria and system component integration needs.&nbsp;Must have the ability to work effectively, independently as part of an overall project team.</li><li><strong>Testing &amp; Debugging:&nbsp;&nbsp;</strong>Work closely with the Solution Quality Analysts by providing debugging and testing assistance as needed to meet sprint objectives.</li><li><strong>Documentation and Deployment:&nbsp;&nbsp;</strong>Create technical documentation (assets) in the code per coding standards and assist as needed in the documentation creation for the products’ customers. Create the artifacts needed to ensure the software is migrated efficiently through the needed environment life cycles.&nbsp;</li></ul><p><strong>Experience</strong></p><ul><li><strong>Minimum 2 years of Java and Angular development.</strong></li><li>Full Stack Development is a plus but not required</li><li>Bachelor’s degree (with preferred concentrations in Computer Science, MIS, Engineering) or equivalent work experience.</li></ul><p><strong>**US Citizenship requirements- as this role supports services provided to the federal government and/or a federal government contractor, proof will be required to verify US citizenship status at time of hire.**</strong></p><p><strong>**Successful applicants for this position must be fully vaccinated against COVID-19 as a condition of employment. Proof of vaccination will be required.&nbsp;Alight complies with federal, state, and local laws with regard to accommodations related to this policy and will consider any accommodation request during the recruiting process. **</strong></p><p><strong>Background Check Required</strong></p><p>By applying for a position with Alight, you understand that, should you be made an offer, it will be contingent on your undergoing and successfully completing a background check consistent with Alight’s employment policies. Background checks may include some or all of the following based on the nature of the position: SSN/SIN validation, education verification, employment verification, and criminal check, search against global sanctions and government watch lists, fingerprint verification, credit check, and/or drug test. You will be notified during the hiring process which checks are required by the position.</p><p><strong>Equal Employment Opportunity</strong></p><p>Alight is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, ancestry, national origin, physical or mental disability, veteran or military status, or any other legally protected characteristics or conduct covered by federal, state or local law. In addition, Alight takes affirmative action to ensure that applicants are employed, and that employees are treated during employment, without regard to their race, color, religion, sex, sexual orientation, gender identity, protected veteran status, or national origin.</p><p><strong>Reasonable Accommodations</strong></p><p>Alight provides reasonable accommodations to the known limitations of otherwise qualified employees and applicants for employment with disabilities, sincerely held religious beliefs, practices and observances, unless doing so would result in an undue hardship. Applicants for employment may request a reasonable&nbsp;<span>accommodation/modification</span>&nbsp;by contacting his/her recruiter.</p><p><strong>Diversity Statement</strong></p><p>At Alight, we believe that diversity should be visible, valued, and sustained throughout the organization. Alight provides equal treatment and employment opportunities to all employees and applicants for employment without regard to any protected status or other protected characteristic.</p><p><strong>Authorization to Work in the United States</strong></p><p>Applicants for employment in the United States must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Alight.</p><p></p>",
    "apply": "https://careers.alight.com/us/en/job/ALIGUSR15822EXTERNALENUS/Application-Developer-Angular",
    "company": "/companies/alight-solutions",
    "cName": "Alight Solutions",
    "location": "USA",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Java Developer",
    "description": "<p></p><p><strong>Job Description: </strong></p><p>At Build with Ferguson, creative thinking and collaboration are the keys to our success, and we're looking for individuals who want to grow with us. The Build with Ferguson team is committed to helping our customers make every project a success. Our mission is to simplify home improvement by providing a best-in-class shopping experience, the best selection of products from top brands, and exceptional customer service. Build with Ferguson has access to the strongest distribution network in America, so we can get you what you need, when you need it.</p><p>Ferguson/Build.com has an exciting opportunity for a Java developer!</p><p>We consider our software engineers to be the heart of our team. We are an Agile development group consisting of teams of individual software engineers, working in a fast-paced environment. We are embarking on a large migration and consolidation of multiple eCommerce sites, and you will play a role in the execution, delivery, and maintenance of both the new and existing eCommerce sites as we migrate platforms. As a member of our eCommerce team, you will be responsible for developing features &amp; functionality as well as data integrations between eCommerce systems and organization platforms.</p><p>Location: This role is approved for 100% remote work.</p><p><strong>Responsibilities:</strong></p><ul><li>Adhere to industry best practices, to write well-designed, modular, performant, and well-tested code.</li><li>Determine operational feasibility by evaluating and analyzing problem definitions, requirements, and proposed solutions.</li><li>Make informed technical decisions that provide solutions to business challenges.</li><li>Contribute to technical feasibility assessments done prior to starting development, to help business gauge the viability and priority of product improvements.</li><li>Participate in code review sessions as part of a thorough, PCI-compliant quality assurance process</li><li>Communicate clearly to various partners, ensuring that problems are being addressed efficiently and business needs are being met in a timely and satisfactory fashion</li><li>Meet all quality and specification requirements by working closely with the QA Team, End Users, Product Managers, and Project Managers</li></ul><p><strong>Qualifications:</strong></p><ul><li>Bachelor’s degree in Computer Science, Information Systems, Mathematics, or an Engineering discipline. Equivalent experience will be considered.</li><li>Proven ability to work creatively and analytically in a problem-solving environment.</li><li>Ability to work in both an individual and team-based environment.</li><li>Ability to organize, prioritize and perform multiple tasks simultaneously.</li><li>At least 5 years of professional java development experience.</li><li>Recent experience working with Java 8+ and Spring Boot.</li><li>Used Rest Controller in Spring framework to create RESTful Web services and JSON objects for communication.</li><li>Proficiency in industry standard technologies, such as Web Services, JSON and XML</li><li>Excellent collaboration and interpersonal skills</li><li>Experience working in Agile development teams and processes</li><li>Experience with SQL, (NoSql is a plus).</li><li>Experience using Git/GitHub for source control.</li><li>Experience developing asynchronous processes and use of message queues a plus.</li><li>Experience working in the cloud (AWS, GCP, AZURE) a plus.</li><li>Experience with supporting and/or implementing public-facing eCommerce websites a plus.</li><li>Experience with JavaScript and some JS framework is a plus. (Node.js, Angular.js, React)</li><li>DevOps mindset, familiar with CI-CD concepts and tools</li></ul><p>Build with Ferguson is dedicated to providing meaningful benefits programs and products to our associates and their families—geared toward benefits, wellness, financial protection, and retirement savings. Build with Ferguson offers a competitive benefits package that includes medical, dental, vision, retirement savings with company match, paid leave (vacation, sick, personal, holiday, and parental), employee assistance programs, associate discounts, community involvement opportunities, and much more!</p><p>#LI-REMOTE</p><p>-</p><p><em style=\"background-color: transparent;\">The Company is an equal opportunity employer as well as a government contractor that shall abide by the requirements of 41 CFR 60-300.5(a), which prohibits discrimination against qualified protected Veterans and the requirements of 41 CFR 60-741.5(A), which prohibits discrimination against qualified individuals on the basis of disability.</em></p><p><em style=\"background-color: transparent;\">Ferguson Enterprises, LLC. is an equal employment employer&nbsp;F/M/Disability/Vet/Sexual&nbsp;Orientation/Gender Identity.</em></p><p></p>",
    "apply": "https://ferguson.wd1.myworkdayjobs.com/en-US/Ferguson_Experienced/job/Remote/Java-Developer_R-091127",
    "company": "/companies/ferguson",
    "cName": "Ferguson",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "SemiSenior .NET Developer",
    "description": "<p></p><p>We are a US software development company delivering high-quality, cost-effective custom application development to clients worldwide. As a technology consulting company, we also help our clients with their digital transformation process.</p><p><strong>Currently, we are seeking a&nbsp;Fullsack&nbsp;.Net Developer Bilingüe</strong></p><p>Minimum of 4 years of experience designing, developing and implementing enterprise grade software systems using .NET framework - Likeable Personality –</p><p>· Demonstrated experience in design and coding standards, analysis and debugging multi-tiered applications –</p><p>· In-depth knowledge of ASP NET, OOP (C#) and back end technologies</p><p>· Experience with IIS, SQL Server, Continuous Integration and Continuous Development experience</p><p>· Ability to identify system bottlenecks with strong troubleshooting, problem solving &amp; reasoning skills.</p><p>· Worked with high volume, highly scalable SaaS infrastructures - TFS, Build definitions, branches, merging.</p><p>· Scaling Applications - Excellent communication skills - Bachelor’s degree in a related field required</p><p>· Technology Stack: - C#, API Development and Integration - HTML5, Twitter Bootstrap, jQuery, Vue.js -&nbsp;<a href=\"http://asp.net/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">ASP.NET</a>, MVC, Web API,</p><p>. Web Form - Enterprise Library, Entity Framework, Linq, T4 - SQL, SSRS, SQL Server 2019, Redis - Azure</p><p>· Pluses: - FinTech - Systems administration experience, including work in large scale computing environmen</p><p>. Web Form - Enterprise Library, Entity Framework, Linq, T4 - SQL, SSRS, SQL Server 2019, Redis - Azure</p><p>· Pluses: - FinTech - Systems administration experience, including work in large scale computing environmen</p><p></p>",
    "apply": "https://tekton-labs.breezy.hr/p/5688ea90a00b-semisenior-net-developer",
    "company": "/companies/tekton-labs",
    "cName": "Tekton Labs",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Product Designer",
    "description": "<p></p><p>Xero is a beautiful, easy-to-use platform that helps small businesses and their accounting and bookkeeping advisors grow and thrive.&nbsp;</p><p>At Xero, our purpose is to make life better for people in small business, their advisors, and communities around the world. This purpose sits at the centre of everything we do. We support our people to do the best work of their lives so that they can help small businesses succeed through better tools, information and connections. Because when they succeed they make a difference, and when millions of small businesses are making a difference, the world is a more beautiful place.</p><p><strong>How you’ll make an impact&nbsp;</strong></p><p>Xero Product Designers are responsible for designing beautiful, enabling and meaningful experiences that solve genuine customer problems. As a Product Designer you’ll work on small-medium scale projects within a product area of a portfolio and contribute to larger scale projects as part of a team.</p><p><strong>What you’ll do&nbsp;</strong></p><p>Design practice and thinking&nbsp;Work with your Design Manager and more senior product designers to understand the Product Design vision and direction and build your design practice, focusing on consistency and quality of execution within your product design delivery.&nbsp;</p><p>● Promote the value of design and collaborative practice across spheres of influence and participation&nbsp;</p><p>● Conduct desk research including domain and competitor analysis, interaction/design trends and 'best of' examples&nbsp;</p><p>● Analyse relevant considerations such as research insights (when not directly involved), product strategy and roadmaps, technical environment and constraints&nbsp;</p><p>● Contribute to the definition and articulation of ‘the problem’&nbsp;</p><p>● Create simple frameworks such as wireframes low/high-fi, visual frameworks, which articulate the components, journeys and elements required to solve 'the problem'&nbsp;</p><p>● Explore ideal future concepts that meet customer needs in the best possible way&nbsp;</p><p>● Work with others to develop phased design solutions that bridge the gap between a future state and current patterns, XUI design system and other relevant constraints and considerations&nbsp;</p><p>● Create prototypes which tangibly demonstrate a proposed concept or solution&nbsp;</p><p>● Collaborate with other designers to test ideas, share challenges, seek feedback and build quality in your practice&nbsp;</p><p>● Collaborate with content designers to ensure content within an experience is consistent, 'fit for purpose' and meets customer needs&nbsp;</p><p>● Develop detailed interactions and interfaces which are smart and contextually relevant&nbsp;</p><p>● Present and communicate design work to a range of different audiences&nbsp;</p><p>● Create effective handover materials which clearly communicate how the design should look and behave throughout interaction flows and journeys (e.g. User flow diagrams, design specifications, experience/interaction specifications etc)&nbsp;</p><p>Design research and testing&nbsp;Contribute to identifying research opportunities, planning and undertaking research and testing relevant to your product area.&nbsp;</p><p>● Participate in generative user research to understand customer underlying goals, needs,&nbsp;behaviors&nbsp;and pain points (where necessary)&nbsp;</p><p>● Participate in the synthesis of research data, drawing out and articulation of insights&nbsp;</p><p>● Participate in user testing&nbsp;</p><p><strong>Relationship management&nbsp;Develop effective cross functional relationships and build influence&nbsp;</strong></p><p>● Participate in cross functional team workshops&nbsp;</p><p>● Collaborate with cross functional teams to ensure proposed solutions balance user needs, business strategy and technical constraints&nbsp;</p><p>● Collaborate with development teams during sprints to provide design QA and problem solve issues as they arise</p><p><strong>Success looks like</strong></p><ul><li class=\"ql-indent-1\">You’re delivering designs on schedule against agreed deadlines, to the highest quality standards.&nbsp;</li><li class=\"ql-indent-1\">You’re consistently delivering high quality solutions to meet customer and business problems&nbsp;</li><li class=\"ql-indent-1\">You’re collaborating and contributing to your Design, Product, and Development teams</li></ul><p><strong>What you’ll bring with you</strong></p><ul><li class=\"ql-indent-1\">Track record of delivering quality design experiences&nbsp;</li><li class=\"ql-indent-1\">Track record of solving customers' problems through design&nbsp;</li><li class=\"ql-indent-1\">Excellent communication skills&nbsp;and experience working directly with engineering and research teams</li><li class=\"ql-indent-1\">A portfolio that demonstrates high-quality design outcomes, contributing to user experience and business value&nbsp;</li><li class=\"ql-indent-1\">Skill and experience across the design process from uncovering customer needs and pain points, to executing elegant interfaces</li></ul><p>As a permanent remote worker at Xero we want to ensure you are getting the same #beautiful employee experience as our in-office Xero’s. Permanent remote Xero’s will benefit from a virtual ergonomic work assessment and funding to assist with the improvement of your at home work setup. Xero will also fund up to 4 trips a year to your most relevant region Xero office. You are part of our #team and we want to see you thrive!</p><p><strong>About Xero?</strong></p><p>Diversity of people brings diversity of thought, and we like that. A collaborative and inclusive environment is important to us. Working at Xero will provide you with a diverse and inclusive environment alongside people who will respect, challenge and support you to have fun while you do the best work of your life. We are a place where personal development, innovation, and well-being are not just inspired but celebrated.</p><p>We value our people and offer a wide range of compelling benefits and perks, including Xero shares and great parental leave policies.&nbsp;&nbsp;Xero’s collaborative culture is underscored by our values - #Ownership, #Challenge, #Beautiful, #Human and #Team - which empower us to understand and serve customers, attract top talent and continuously innovate.&nbsp;From the moment you step through our doors, you’ll feel welcome and supported to do the best work of your life.</p><p><em>Please note that we currently require all employees and contractors to be vaccinated against COVID-19 in order to work from a Xero office, or engage in any face-to-face Xero business.&nbsp;Xero will work with anyone who is not vaccinated, or prefers not to disclose their vaccination status, to determine if any reasonable accommodations can be provided to ensure their role can be performed safely whilst the restriction is in place.</em></p><p></p>",
    "apply": "https://jobs.lever.co/xero/190752f3-9305-4f11-9845-e8ac66251600",
    "company": "/companies/xero",
    "cName": "Xero",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Senior Product Designer – Cloud",
    "description": "<p></p><p>Mattermost is an open source platform for secure collaboration across the entire software development lifecycle. Hundreds of thousands of developers around the globe trust Mattermost to increase their productivity by bringing together team communication, task and project management, and workflow orchestration into a unified platform for agile software development.&nbsp;</p><p>Founded in 2016, Mattermost’s open source platform powers over 800,000 workspaces worldwide with the support of over 4,000 contributors from across the developer community. The company serves over 800 customers, including European Parliament, NASA, Nasdaq, Samsung, SAP, United States Air Force and Wealthfront, and is backed by world-class investors including Battery Ventures, Redpoint, S28 Capital, YC Continuity. To learn more, visit&nbsp;<a href=\"http://www.mattermost.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">www.mattermost.com</a>.</p><p>We value high impact work, ownership, self-awareness and being focused on customer success. If these values match who you are, we hope you'll learn more about&nbsp;<a href=\"https://handbook.mattermost.com/company/about-mattermost\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">working at Mattermost</a>&nbsp;and apply!</p><p>Mattermost is seeking a Senior Product Designer - Self-serve who will help us build a seamless buyer experience for our customers, and someone who thrives at the intersection of product design and analytics to accelerate product-led growth. You will lead product design for all self-serve transaction experiences - including purchase, expansion, and renewal - and help improve overall GTM efficiency that enables rapid growth at scale. Our ideal candidate is a strong, multi-disciplined designer with an outstanding eye for detail and the ability to produce high-quality responsive interfaces across multiple platforms. Every day, you’ll work with product managers, developers, and members of our open source community to create intuitive and engaging user experiences.</p><p><strong>Responsibilities:</strong></p><ul><li class=\"ql-indent-1\">Proactively look for opportunities to improve the design and user experience of our product with a focus on our cloud product tiers</li><li class=\"ql-indent-1\">Establish detailed usability and design guidelines for product development based on industry best practices and competitive benchmarking</li><li class=\"ql-indent-1\">Create and maintain a library of design and interface resources for use by product teams</li><li class=\"ql-indent-1\">Work closely with product managers, engineers, customers, and other stakeholders to gather requirements and understand usability concerns and areas for improvement</li><li class=\"ql-indent-1\">Produce designs of various fidelity depending on needs, ranging from sketching to mockups and prototypes</li><li class=\"ql-indent-1\">Plan and conduct user research and usability tests, documenting, communicating, and acting upon the results</li><li class=\"ql-indent-1\">Build relationships across product lines and functional groups to raise the standard for good design across the company</li></ul><p><strong>Required Background/Skills:</strong></p><ul><li class=\"ql-indent-1\">5+ years of hands-on user experience and visual design in the software industry with a strong focus on responsive design for cloud-first desktop/browser applications</li><li class=\"ql-indent-1\">Experience working on B2B collaboration products; ideally in SaaS and product-led growth environments</li><li class=\"ql-indent-1\">Strong background in interaction design, with the ability to effectively articulate the rationale behind design decisions</li><li class=\"ql-indent-1\">Strong visual design sense and impeccable attention to detail, with a drive to speak up when something is not implemented to your standards</li><li class=\"ql-indent-1\">Intensely curious, with a good understanding of analytics and a desire to learn from the data</li><li class=\"ql-indent-1\">Proficient in various research and design techniques such as qualitative research methods, personas, wireframing, task analysis, journey mapping, sketching, prototyping, usability testing, etc</li><li class=\"ql-indent-1\">Embody our company values:&nbsp;<a href=\"https://mattermost.com/about-us/#leadership-principles\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">https://mattermost.com/about-us/#leadership-principles</a></li></ul><p><strong>Preferred Background/Skills:</strong></p><ul><li class=\"ql-indent-1\">Design for SaaS products</li><li class=\"ql-indent-1\">Understanding of plugins/integrations</li><li class=\"ql-indent-1\">Experience with the latest web technologies and frameworks (e.g. React, Vue)</li></ul><p>Mattermost is a remote-first company with staff living and working across the globe.&nbsp;We are currently hiring staff in these countries/regions:</p><p></p>",
    "apply": "https://jobs.lever.co/mattermost/cf0c3235-0a19-46b8-8627-0b2ec954834b",
    "company": "/companies/mattermost",
    "cName": "Mattermost",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "GRAPHIC DESIGNER",
    "description": "<p></p><p><strong>Job Summary</strong></p><p>Our mission is to discover what FranklinCovey but has never been seen before.</p><p>In order to do this, our vision is to become world-class digital storytellers, by creating profit-generating, design-driven miracles built around a premium, intuitive, highly covetable user experience that fans can’t get enough of.</p><p><strong>Essential Functions</strong></p><p>The Creative Lab Graphic Designer is responsible for print and interactive design of a wide variety of curriculum, promotional, advertising, and marketing collateral to support the practices, regions, and marketing efforts of FranklinCovey.&nbsp;Your design responsibilities include review, analyze, and modify existing designs to support existing materials and programs as well as creating new impact-driven creative. A wide degree of creativity and latitude is expected and may lead or direct the work of others.</p><p><strong>JOB REQUIREMENTS</strong></p><ul><li>BFA in Graphic Design</li><li>Minimum of 5-10 years professional graphic design and web experience within an organization’s creative communications, marketing communication department, or advertising agency.</li><li>Design effective, results-oriented curriculum, promotional, advertising, and sales–oriented marketing pieces for a wide range of assignments, including training and sales collateral (web and print), direct mail, print proposals, and training curriculum.</li><li>Adobe Creative Cloud 2021</li></ul><p>Multimedia or equivalent experience<strong><em>.&nbsp;</em></strong>Proven ability to design layouts, develop document templates, and source imagery for documents all while leading a highly creative team. Advanced experience with Adobe Creative Cloud for teams.</p><p>We are looking for motivated team players with a strong work ethic and the ability to work in a fast-paced environment.&nbsp;Qualifying portfolio including print and web samples are required.</p><p><strong>Company Information</strong></p><p><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.franklincovey.com%2F%3Futm_source%3Dpr%26utm_medium%3Dpress%2520release%26utm_campaign%3Dtraining-industry%26utm_term%3Dtop-20&amp;esheet=52272507&amp;newsitemid=20200825005375&amp;lan=en-US&amp;anchor=Franklin+Covey+Co.&amp;index=15&amp;md5=d475f9970ea7c562beef0cc1996e9b46\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(19, 128, 185);\">Franklin Covey Co.</a>&nbsp;(NYSE: FC) is a global, public company, specializing in organizational performance improvement. We help organizations achieve results that require lasting changes in human behavior. Our world-class solutions enable greatness in individuals, teams and organizations and are accessible through the FranklinCovey All Access Pass® available in multiple modalities and in 21 languages. Clients have included the<em>&nbsp;Fortune 100, Fortune 500</em>, thousands of small- and mid-sized businesses, numerous government entities, and educational institutions. FranklinCovey executes over 15,000 client engagements each year reaching into 160 countries and territories.&nbsp;Our mission statement is “We enable greatness in people and organizations everywhere”.&nbsp;We fulfill this mission by hiring “Achievers with Heart”.</p><p></p>",
    "apply": "https://careers.franklincovey.com/en-US/job/graphic-designer/J3R2VV62BZT2R8VK8XL",
    "company": "/companies/franklincovey",
    "cName": "FranklinCovey",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Graphic Designer",
    "description": "<p></p><p>Openly is rebuilding insurance from the ground up. We are re-envisioning and enhancing every aspect of the customer experience. Doing this requires a rapidly growing team of exceptional, curious, empathetic people with a wide range of skill sets, spanning technology, data science, product, marketing, sales, service, claims handling, finance, etc.</p><p><strong>Now is the perfect time to join the journey. Here’s why</strong></p><ul><li>It’s working. We’re in multiple states and on our way to operating countrywide. We have thousands of agents selling our product and millions of dollars of annual customer premiums.</li><li>We’re well backed &amp; stable. We closed our $40M Series B fundraise. We are supported by some of the top investors globally, including Google’s “<a href=\"https://www.gradient.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">Gradient</a>” AI-focused fund,&nbsp;<a href=\"https://obvious.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">Obvious Ventures</a>&nbsp;(Beyond Meat, etc.), and&nbsp;<a href=\"https://www.avp.vc/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">Advance Venture Partners</a>.</li><li>It’s not too late! Despite this traction and stability, we’re still early enough in the journey that there’s time to make a real difference during Openly’s formative period.</li></ul><p>If you’d like to understand more about Openly’s mission, consider checking out this&nbsp;<a href=\"https://vimeo.com/267654520\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">video</a>&nbsp;from a company pitch we gave several years ago at Techstars.</p><p><strong>Job Details</strong></p><p>Openly is looking for a Graphic Designer with exceptional multi-channel design skills who will support the marketing team and cross-functional teams by managing and implementing the design process for multi-channel campaigns.</p><p><strong>Key Responsibilities</strong></p><ul><li>Manage Openly’s visual brand standards and ensure that the visual identity is applied consistently across all channels</li><li>Create visual designs for multi-channel marketing campaigns, including emails, social media, digital ads, landing pages, and print materials</li><li>Manage and implement the design process from start to finish (wireframe, concepts, design iterations, and final product)</li></ul><p><strong>Requirements</strong></p><ul><li>Bachelor's or Associate’s degree in relevant area of study</li><li>5-8 years of experience in graphic design roles</li><li>HTML coding experience</li><li>Hubspot experience</li><li>A track record of campaign designs that drove conversions</li><li>Ability to integrate UX and UI principles in landing page design</li><li>Strong attention to detail</li><li>Design experience related to financial services is a plus</li><li>Ability to work well in a growth stage company environment</li><li>Excels in a fast-paced, demanding environment; able to manage multiple tasks and juggle several time-sensitive demands, while adapting to changing priorities</li></ul><p>Candidates should be&nbsp;<em>self-starters</em>&nbsp;who possess strong graphic design skills, demonstrate creativity, and excel at working cross-functionally. The ideal candidate will be able to demonstrate a track record of creating effective and engaging visual content.&nbsp;<u>Candidates should provide a portfolio in addition to a resume.</u>&nbsp;Portfolio should include at least one example from each of the following categories: landing page, email, infographic, digital ad design, and print material.</p><p><strong>Benefits &amp; Perks</strong></p><ul><li>Competitive salary, corporate bonus program, equity position in a start-up company</li><li>Company-sponsored medical, dental, vision insurance plans, short-term and long-term disability, life insurance, 401k with corporate contribution, and FSA plan</li><li>Company-paid 12 weeks parental leave policy</li><li>The company fully embraces the “work-from-anywhere” mentality, even before COVID restrictions.</li><li>Paid Time Off</li><li>Fun, fast-paced, start-up environment</li></ul><p>U.S. Citizens, Green Card Holders, and those authorized to work in the U.S. for any employer will be considered.</p><p>Openly is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, sex, gender identity or expression, age, religion, national origin, ancestry, ethnicity, disability, veteran status, genetic information, sexual orientation, marital status, or any characteristic protected under applicable law. Openly is an E-Verify Employer in the United States. Openly will make reasonable accommodations for qualified individuals with known disabilities under applicable law.</p><p></p>",
    "apply": "https://openly.breezy.hr/p/396667b03d5a-graphic-designer",
    "company": "/companies/openly",
    "cName": "Openly",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "UX – UI Designer",
    "description": "<p></p><p><strong>Who We Are:</strong></p><p>StackCommerce is the leading product discovery platform for publishers and brands. Our award-winning solution allows users to discover and purchase products on the publisher sites they visit daily. We provide 2500+ merchants and retailers with unmatched exposure through product listings and shoppable articles. For publishers, we power white-labeled e-commerce shops with on-site checkout for readers. We’ve helped over 1,000 publishers monetize with commerce, including Yahoo!, CNN, Hearst, Mashable, NY Post, TMZ, MarketWatch, and more.</p><p><strong>The Role:</strong></p><p>We are looking for an experienced UX/UI Designer for our team. As our ideal candidate, you are dynamic, results-driven and enjoy a high-change environment that is evolving to meet the needs of our customers, internal stakeholders, and business partners. This role is a member of the Product team.</p><p><strong>What You’ll Do:</strong></p><ul><li><strong>UX/UI Design</strong>. Create and enforce design quality standards that lead to cohesive and delightful user experiences. You will guide the design initiatives across various applications including eCommerce shops, internal admin platform, external facing partner platform, and various others.</li><li><strong>Collaborate.&nbsp;</strong>Close coordination with the Product team to develop a shared vision of a product or feature and then lead a process to define the design to deliver on the product’s objectives. Close communication with the Engineering team to ensure delivery of features meet design requirements.</li><li><strong>Think creatively.</strong>&nbsp;Don't be afraid to explore non-conventional approaches to address conventional problems.</li><li><strong>Problem-solve.</strong>&nbsp;Strategize &amp; execute on how design helps solve complex problems across multiple apps. Evaluate quality on both design-centric and data driven metrics in regular reviews.&nbsp;&nbsp;</li></ul><p><strong>About You:</strong></p><ul><li><strong>Passionate.</strong>&nbsp;You live and breathe design. You regularly stay up to date on current design trends and enjoy learning new skills as a designer. You have a passion for the user’s experience and the ability to execute that with meaningful and elegant design. Love what you do and have fun in the process.</li><li><strong>Analytical.&nbsp;</strong>You have deep knowledge of user-centered design and usability best practices.&nbsp;You understand and respond to performance data (metric tests, usability studies), and steer the direction of future creative designs. You are able to backup your design decisions with meaningful data or reasoning.</li><li><strong>Experienced</strong>.&nbsp;Experience in managing workload against resources and competing priorities, successfully working with leadership and cross-functional teams. You have a great UX/UI portfolio, demonstrating outstanding design, execution, and problem solving skills.</li><li><strong>Collaborative.&nbsp;Have conviction to champion your perspective but able to successfully collaborate with other points of view.&nbsp;&nbsp;Effortlessly collaborate with a multidisciplinary team to provide concept visualizations, prototypes, specifications, and ultimately high-resolution assets for beautiful user interfaces in a fast-paced environment</strong></li></ul><p><strong>What You'll Bring:</strong></p><ul><li>Experience designing for large-scale eCommerce or SaaS platform</li><li>Proficiency with design tools such as Figma, Adobe Creative Suite, Sketch, Invision</li><li>An online portfolio demonstrating conceptual thinking and creative problem solving</li><li>Ability to translate wireframes into outstanding visual/UI design</li><li>Advanced understanding of CSS and HTML</li><li>BA/BS degree in Design or similar background or equivalent practical experience</li><li>Minimum of 5 years of experience in UX/UI design</li><li>Experience managing multiple projects and the ability to meet aggressive deadlines</li><li>Ability to work cross-team and synthesize feedback from multiple teams/owners</li><li>Experience designing for responsive platforms</li></ul><p><strong>Big Pluses:</strong></p><ul><li>Ability to prototype interactions/designs</li><li>Experience building and managing design systems across multiple products</li><li>Experience with Atomic Design Principles &amp; Methodology</li><li>Experience using analytical tools such as Google Analytics and/or Looker</li><li>Experience using Jira, Confluence, and GitHub Issues</li></ul><p><strong>What to Expect:</strong></p><ul><li><strong>Intro Call:&nbsp;</strong>You’ll hop on a quick call with the hiring manager so we can get to know you better — and you can learn a little more about the role.&nbsp;</li><li><strong>Homework Assignment:</strong>&nbsp;We send over a quick exercise that challenges you to solve a problem and come up with a creative solution. Get a feel for what you’ll be doing on a daily basis!</li><li><strong>Remote-Team Interview:</strong>&nbsp;You’ll be meeting with 7 team members on a video call. This is your chance to ask questions and see who this role interacts with on a daily basis.</li><li><strong>Final Video Call:&nbsp;</strong>This is a great opportunity to get to know our President over video.</li><li><strong>Offer: We send over an offer and you (hopefully) accept! Welcome to Stack!</strong></li></ul><p><strong>Benefits + Perks:</strong></p><p>As a company, we have a lot to offer for the right candidate:</p><ul><li><strong>Competitive Compensation Package:&nbsp;</strong>Equity, 401(k) &amp; Health Insurance</li><li><strong>Super Flex Time:</strong>&nbsp;Run errands as needed, just get your stuff done</li><li><strong>Unlimited Vacation:&nbsp;</strong>Take time to unwind</li><li><strong>Learning Budget:&nbsp;</strong>Dollars towards eLearning courses, eBooks, and more</li><li><strong>WFH Office:</strong>&nbsp;Home office stipend and internet dollars to set you up for success</li><li><strong>Events:&nbsp;</strong>Happy hours, company trips, team bonding budgets and team culture events (even while remote!)</li></ul><p><strong>Stack Highlights</strong>:</p><p>By the numbers...</p><ul><li>We’ve paid our publisher and merchant partners&nbsp;<strong>$150+ million&nbsp;</strong>and counting!</li><li>We’ve been a profitable business from&nbsp;<strong>day 1</strong>.</li><li>We work with&nbsp;<strong>1k+&nbsp;</strong>media publishers including Mashable, TMZ, CNN, NY Post, &amp; others.</li><li>We’ve been a ‘BuiltinLA Best Place to Work in LA’ for<strong>&nbsp;2 years</strong>&nbsp;straight.</li><li>We’re currently a fully-remote team with&nbsp;<strong>110 teammates</strong>. Are you next?</li></ul><p><em>StackCommerce is an equal opportunity employer. Applicants will not be discriminated against because of race, color, creed, sex, sexual orientation, gender identity or expression, age, religion, national origin, citizenship status, disability, ancestry, marital status, veteran status, medical condition, or any protected category prohibited by local, state or federal laws.</em></p><p></p>",
    "apply": "https://boards.greenhouse.io/stackcommerce/jobs/4269799",
    "company": "/companies/stackcommerce",
    "cName": "StackCommerce",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Sr. Editor",
    "description": "<p></p><p><strong>Come Science With Us!</strong></p><p>Our team thrives on building meaningful relationships with leading science experts and helping students achieve their highest levels of success. With that comes the unique opportunity to touch lives across the across the world and experience first-hand the difference your hard work makes.&nbsp;We’re looking for a&nbsp;<strong>Sr. Editor</strong>&nbsp;to join our team. This is a remote position and can be based anywhere within the United States.</p><p><strong>How can you make an impact?&nbsp;</strong></p><p>The Sr. Editor will be responsible for developing content for a prestigious digital science reference product as part of a small editorial team.</p><p><strong>What you will be doing:</strong></p><p>– Building and managing a network of subject matter experts (SME) consisting of college faculty as well as professional scientists and engineers in specific subject areas.</p><p>– Following progress in assigned subject areas and working with SMEs to curate content within a digital database.</p><p>– Regularly reviewing existing content in subject areas for needed updates and corrections.</p><p>– Soliciting manuscripts from SMEs and editing those manuscripts to an appropriate reading level for college undergraduates.</p><p>– Writing short, engaging articles on timely science topics that direct the reader back into the database’s related resources.</p><p>– Locating and/or specifying and minor editing of visual resources to support new and existing content.</p><p>– Using various digital content management systems to edit and publish content of excellent quality.</p><p>– Building and maintaining collaborative relationships with internal stakeholders and external suppliers, including sales and marketing staff, copyeditors, proofreaders, and compositors.</p><p>– Working with acquisitions editors to develop appropriate book proposals and oversee correlations to the digital product.</p><p><strong>We’re looking for someone with:</strong></p><p>·&nbsp;Bachelor’s degree required.</p><p>– Five + years of experience in science journalism, science education, or scholarly publishing.</p><p>– Proficiency working within digital environments.&nbsp;</p><p>– Project management experience plus strong interest in/knowledge of biology, biochemistry, or biomedical sciences.</p><p>– Outstanding writing and editing skills, as well as experience with scientific writing that may be complex or technical.&nbsp;</p><p>– Attention to detail and a dedication to factual accuracy.&nbsp;</p><p>– Knowledge of basic HTML, digital image editing skills, familiarity with online video publishing, and an understanding of issues associated with web accessibility.</p><p>As an education innovation company, we’re proud to play our part by inspiring learners around the world. If you bring your curiosity, we’ll help you grow in a collaborative environment where everyone shares a passion for success.</p><p>Are you ready for a new challenge? Apply for a career at McGraw Hill and together, we’ll impact the world.</p><p></p>",
    "apply": "https://careers.mheducation.com/job/15891366/sr-editor-remote-new-york-ny/",
    "company": "/companies/mcgraw-hill",
    "cName": "McGraw Hill",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Product Writer",
    "description": "<p></p><p><strong>Company Description</strong></p><p>It all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic app, bringing a better way to send, spend, invest, borrow and save to our millions of monthly active users. With a mission to redefine the world's relationship with money by making it more relatable, instantly available and universally accessible, at Cash App you'll have the opportunity to make a real-world impact with your career.</p><p>Today, Cash App has thousands of employees around the world with a culture geared toward creativity, collaboration and impact. We’ve been a distributed team since day one, and continue to value working across time zones and continents both remotely and in our Cash App offices.</p><p>Our offices are great, but many of our roles can be done remotely from the countries where Block operates. We tailor our experience to champion our employees’ creativity and productivity wherever they are.</p><p>Check out our locations, benefits and more at cash.app/careers.</p><p><strong>Job Description</strong></p><p>We’re looking for skilled writers/content designers to join us in crafting our product experiences, shaping our voice, tone and style, and building out our practice. We believe good writing is crucial for Cash app--clear and approachable language helps people understand what’s going on with their money and feel empowered to take on everything from taxes to bitcoin.</p><p>As a product writer, you’ll:</p><ul><li>Work alongside other writers, designers, researchers, product managers, analysts, and engineers to understand customer needs, define requirements, and align on business goals&nbsp;</li><li>Develop a UX and content strategy point of view and communicate recommendations in order to influence the product development process from ideation to launch</li><li>Find intuitive and elegant content solutions, crafting experiences that resonates with our growing audience and provides measurable value to the business</li><li>Seek feedback on your work, build consensus among your team, and bring stakeholders along with your recommendations</li><li>Get to know the Cash brand and work with product writers and copywriters to keep refining our voice and building out our style guide</li></ul><p><strong>Qualifications</strong></p><p>You have:</p><ul><li>4+ years experience in content strategy, UX writing, content design (or whatever you happen to call it)</li><li>Exceptional writing skills and passion for the craft</li><li>Strong UX and systems thinking, plus insight into product strategy</li><li>Experience building successful cross-functional partnerships</li><li>The ability to work pretty independently but also ask for help when you need it</li><li>A portfolio that showcases your writing, any relevant work on mobile apps, and a range of content strategy deliverables</li></ul><p><strong>Additional Information</strong></p><p>We’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.&nbsp;</p><p>We believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible.&nbsp;<strong><em>Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our&nbsp;</em></strong><a href=\"https://squareup.com/us/en/about/diversity?utm_source=job_description\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 112, 205);\"><strong><em>I+D page</em></strong></a><strong><em>.&nbsp;</em></strong></p><p>Additionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.</p><p><em>Block, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.</em></p><p></p>",
    "apply": "https://jobs.smartrecruiters.com/Square/743999829198136-product-writer",
    "company": "/companies/cash-app",
    "cName": "Cash App",
    "location": "USA",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Editorial: Freelance writers",
    "description": "<p></p><p>Longitude is seeking experienced freelance writers who can support our in-house editors and researchers across a range of topics and projects.</p><p>In particular, we are keen to work with writers who have experience and knowledge of financial services topics, including ESG, asset management and cryptocurrencies. A high level of data literacy, and the ability to identify the headline stories from data, is essential.</p><p>As well as providing the opportunity to work on high-profile thought leadership campaigns for some of the world’s best-known brands, we pay competitive rates and can offer a steady pipeline of work to the right candidates.</p><p>Please note – Due to the expected volume of applicants we may not be able to send you a personal response but only communicate with you if your application is successful.</p><p></p>",
    "apply": "https://www.longitude.co.uk/our-careers/editorial-freelance-writers/",
    "company": "/companies/longitude",
    "cName": "Longitude",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Content Writer",
    "description": "<p></p><p>At Jobscan, we’re passionate about empowering job seekers to land more interviews with AI technology. We have helped over 2 million job seekers get more interviews in 100+ countries. Jobscan’s platform benefits job seekers, employers, universities, and communities. We're a fast-growing remote startup. We are completely customer-funded, profitable, and growing exponentially!</p><p>We are looking for a full-time&nbsp;Content Writer&nbsp;to join our Marketing team to grow to drive new customer acquisition. 3-10 years of experience required.</p><p><strong>What you'll be doing</strong></p><ul><li class=\"ql-indent-1\">Brainstorming, researching, and developing article topics that are highly relevant to job seekers - specifically around how to get more interviews. E.g. resume optimization, linkedin optimization, resume keywords, application tracking systems, etc.</li><li class=\"ql-indent-1\">Generating content topics that maximize organic trafficSourcing and co-producing content with outside authors and subject matter experts from across the industry.</li><li class=\"ql-indent-1\">Ghostwriting and editing content for leaders.</li><li class=\"ql-indent-1\">Creating engaging content and copy across different marketing channels and mediums.</li><li class=\"ql-indent-1\">Writing, reviewing, editing, and updating content for various marketing assets.</li><li class=\"ql-indent-1\">Editing other content writers’ work for quality content.</li><li class=\"ql-indent-1\">Optimizing existing content (page titles, meta descriptions, h1s, alts, anchor text, etc.)</li><li class=\"ql-indent-1\">Collaborating with freelancers for transcribing and other types of content creation.</li></ul><p><strong>What you'll need</strong></p><ul><li class=\"ql-indent-1\">3-5 years of writing experience</li><li class=\"ql-indent-1\">Basic understanding of content marketing&nbsp;</li><li class=\"ql-indent-1\">Tech startup experience&nbsp;</li><li class=\"ql-indent-1\">Empathetic towards job seekers</li><li class=\"ql-indent-1\">Effective communicator</li></ul><p><strong>What would be nice to have</strong></p><ul><li class=\"ql-indent-1\">Content marketing experience</li><li class=\"ql-indent-1\">Experience using Google or other tools to research new topics</li><li class=\"ql-indent-1\">Strong writing and content editing skills</li><li class=\"ql-indent-1\">Experience with Project Management</li></ul><p><strong>Benefits</strong></p><p>‣&nbsp;Remote work</p><p>‣&nbsp;Competitive salary + stock options</p><p>‣&nbsp;Flexible schedule</p><p>‣&nbsp;Unlimited PTO + 14 Paid Holidays + Paid Sick Days</p><p>‣&nbsp;Paid days off last week of year</p><p>‣&nbsp;Paid parental leave</p><p>‣&nbsp;401(k) + employer match</p><p>‣&nbsp;Health savings accounts</p><p>‣&nbsp;Life insurance</p><p>‣&nbsp;$1000 tech stipend, education stipend, internet stipend</p><p>‣&nbsp;Apple computer or PC of your choice</p><p>‣&nbsp;Bi-annual company trips</p><p>‣&nbsp;Medical, dental, vision, and life insurance</p><p>As we continue to grow, we are always adding more benefits and perks for our team.</p><p><em>Jobscan provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws</em>.</p><p></p>",
    "apply": "https://jobs.lever.co/jobscan-2/dfb2451a-73e7-4434-b98a-4d92104fb63e",
    "company": "/companies/jobscan",
    "cName": "Jobscan",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Sr Content Marketer, SEO (Hybrid)",
    "description": "<p></p><p><em>Are you excited by the opportunity to bring your content marketing experience to a world-class company that is market-leading for both content and technology?</em></p><p><em>Would you like to join an organization that is consistently recognized as a&nbsp;</em><strong><em>'Top</em></strong><em>&nbsp;</em><strong><em>Employer to Work For’&nbsp;</em></strong><em>across a broad range of categories, such as Culture, Work-Life Balance, Diversity &amp; Inclusion, Opportunities for Women, Social Impact, Volunteerism?</em></p><p><strong>About the role</strong></p><p>As a part of the Content Marketing Center of Excellence, the&nbsp;<strong>Senior Content Marketer, SEO</strong>&nbsp;is responsible for identifying and executing opportunities to improve our content's search rankings. This role requires a highly motivated, self-starting mindset and work ethic to develop various approaches to effectively produce SEO-driven and highly linkable content to expand Thomson Reuters digital content footprint and brand awareness.</p><p><strong><em>Note:</em></strong><em>&nbsp;This is a&nbsp;</em><strong><em>*hybrid&nbsp;</em></strong><em>role (*mix of working from home and in-office each week) and can be based in&nbsp;</em><strong><em>either&nbsp;</em></strong><em>of these Hub office locations: Minneapolis/St. Paul area (Eagan), Dallas/Fort Worth area (Carrollton).</em></p><p><strong>More About the role</strong></p><p>In this&nbsp;<strong>Sr. Content Marketer, SEO</strong>&nbsp;opportunity you will:</p><ul><li>Manage SEO for content created by the Content Marketing Center of Excellence</li><li>Build strategic SEO plans to support short- and long-term content marketing campaigns</li><li>Collaborate with Enterprise SEO team to identify new opportunities to grow our organic search presence</li><li>Plan and develop optimized content, including blog posts, infographics, web pages, and other linkable content pieces</li><li>Collaborate with Content Strategy and Content Management teams to create high-quality content around important, relevant terms that meet the needs of both key stakeholders and our customers</li><li>Manage&nbsp;and improve&nbsp;organic search engine performance based on clickthrough rates, traffic, and conversions</li><li>Stay up to date with the latest trends and changes with SEO and major search engines</li><li>Identify opportunities and recommend actions based on competitors’ content and SEO</li><li>Inspire and evangelize the value of SEO in our content to internal partners across the organization</li></ul><p><strong>About You</strong></p><p>You could be a fit for&nbsp;<strong>Sr. Content Marketer, SEO&nbsp;</strong>role if you have:</p><ul><li>5 to 7 years' experience writing excellent effective content, or equivalent experience in a related field</li><li>Working knowledge of SEO best practices, search engine algorithms and ranking strategies, and passion to stay abreast of news and trends in SEO and digital marketing</li><li>Excellent verbal, written communication, and presentation skills</li><li>A dual-minded approach: You’re highly creative but can also be process-driven, think scale, and rely on data to make decisions</li><li>You’re passionate about your work. Even if the subject matter isn’t your cup of tea, you see value in doing it right, making content that’s worth consuming</li><li>Proficiency in web analytics software (Adobe Analytics) &amp; keyword tools (MozPro, SEM Rush, etc.)</li><li>Experience working cross-functionally with other teams</li></ul><p><strong>What’s in it For You?</strong></p><p>At Thomson Reuters, our people are our greatest assets. Here are some of the benefits we offer for your personal and professional growth:</p><ul><li><strong>Culture:</strong>&nbsp;Globally recognized and award-winning reputation for equality, diversity and inclusion, flexibility, work-life balance, and more.</li><li><strong>Wellbeing:</strong>&nbsp;Comprehensive benefit plans; two company-wide Mental Health Day's Off; Headspace app subscription; retirement, savings, tuition reimbursement, and employee incentive programs; resources for mental, physical, and financial wellbeing.</li><li><strong>Learning &amp; Development:</strong>&nbsp;LinkedIn Learning access; internal Talent Marketplace with opportunities to work on projects cross-company; Ten Thousand Coffees Thomson Reuters café networking.</li><li><strong>Social Impact:</strong>&nbsp;Eight employee-driven Business Resource Groups; two paid volunteer days annually; Environmental, Social and Governance (ESG) initiatives for local and global impact.</li><li><strong>COVID-19 Response:</strong>&nbsp;Currently, the majority of our employees are working within a hybrid environment consisting of in-office and remote work, and following local COVID-19 bylaws and guidelines.</li></ul><p>#LI-TA1</p><p></p>",
    "apply": "https://jobs.thomsonreuters.com/job/15899260/senior-content-marketer-seo-hybrid-eagan-mn/",
    "company": "/companies/thomson-reuters",
    "cName": "Thomson Reuters",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Edu Business Strategist",
    "description": "<p></p><p><strong>Education Business Strategist\\</strong></p><p><strong>Description</strong></p><p>Automation Anywhere is the world’s #1 cloud automation platform, delivering intelligent RPA solutions across all industries globally to automate end-to-end business processes, for the fastest path to enterprise transformation. The company offers the world’s only cloud-native platform combining RPA, artificial intelligence, machine learning, and analytics to automate repetitive tasks and build enterprise agility, freeing up humans to pivot to the next big idea, build deeper customer relationships and drive business growth. For additional information, visit&nbsp;<a href=\"https://www.automationanywhere.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(255, 102, 51);\">www.automationanywhere.com</a>.&nbsp;</p><p><strong>Our opportunity:</strong></p><p>In this role, you will be directly involved in the enablement of employees, partners, customers, and the future workforce. You will be responsible for managing some key curriculums for Automation Anywhere partnering with the product organization and the Go-to-market teams by identifying learning requirements on an on-going basis aligned with key business imperatives.</p><p>The candidate must maintain demonstrated ability in working cross-organizationally, working very effectively with virtual teams and across multiple countries/regions. They must actively embrace challenges, thrive on solving tough problems, demonstrate passion about learning and how it impacts the future adoption of RPA and Automation Anywhere products.&nbsp;</p><p><strong>Location:&nbsp;</strong>&nbsp;Remote role - ability to work within any U.S time zone</p><p><strong>You will make an impact by being responsible for:&nbsp;</strong></p><ul><li>Advising the business on building a customer focused learning experience that drives behavior change and improves the performance of our customers, partners, employees, and the future workforce</li><li>Analyzing training needs on highly visible programs, scope out learner requirements, creating enablement plans based on business priorities, and architecting appropriate learning solutions across multiple roles</li><li>Guiding the design and development of new and immersive and scalable learning experiences that allows for personalized learning to upskill, reskill, and empower learners</li><li>Gathering and disseminating research and analysis on learning industry trends, instructional design theories, and approaches to build competitive learning models</li><li>Curating curricula, applying persona-based perspectives to curriculum development, map curriculum/ course to Certifications and Accreditations and build goal-oriented learning experiences</li><li>Managing projects from inception to completion, providing project timelines, monitoring metrics, providing leadership, and cross-functional collaboration with peer teams across the company</li><li>Attaining good level of knowledge of Automation Anywhere products</li><li>Analyzing progress of programs, generate metrics, and present information to executive staff</li><li>Working with Operations team to understand the features and limitations of the Learning platforms as you design and implement learning programs</li><li>Working with vendor resources to produce and deliver all projects on-time, within scope, and within budget</li></ul><p><strong>You will be a great fit if you have:&nbsp;</strong></p><ul><li>7+ years curriculum development experience in the technology space</li><li>Undergraduate in Science, Instructional Design, or Liberal Arts</li><li>Postgraduate or Diploma Holder in Instructional Design or any other stream preferred</li><li>Expertise in developing technical and product curriculums including writing assessments and certifications is a must</li><li>Excellent working knowledge of training development tools including Articulate 360, Camtasia, and other standard industry tools.</li><li>Experience in design methodologies, modern learning practices needed</li><li>Working knowledge of Learning Management System is preferred</li></ul><p><strong>You excel in these key competencies:&nbsp;</strong></p><ul><li>Deep knowledge of adult learning theories, emerging technologies, instructional design, customer education, and the tools used to create quality learning experiences.</li><li>Technical aptitude, ability to comprehend complex technical topics and present it to the learners with accuracy and clarity.</li><li>Practical experience in a lead role in an Education or Enablement organization within an Enterprise/SaaS company.</li><li>Good business acumen and project management skills to successfully execute, communicate, and to manage risks on projects.</li><li>Track record of working collaboratively and proactively in a fast-paced environment, prioritizing workload, and delivering on time, with high quality, and to standards.</li></ul><p><strong>Keywords:</strong>&nbsp;learning experience, learning design, product training, eLearning, technical training, Articulate Storyline, project management, LMS, Curriculum Development, Course Development, instructional design</p><p><strong>Why Automation Anywhere?</strong></p><p>At our company each person brings their unique talents to work as a team and make a difference. As the leader in Robotic Process Automation (RPA), we provide a very compelling product where our teams are breaking new ground every day and given an environment to grow their skills and have fun along the way.&nbsp;&nbsp;Our technology is the game changer, and our people give us the edge to better our world and go be great!</p><p><strong>Automation Anywhere is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis.</strong></p><p>#LI-JS1</p><p>#LI-REMOTE</p><p></p>",
    "apply": "https://jobs.jobvite.com/careers/automationanywhere/job/oG5jjfw7",
    "company": "/companies/automation-anywhere",
    "cName": "Automation Anywhere",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Jr. Business Development Coordinator",
    "description": "<p></p><p><strong>Challenging Today. Reinventing Tomorrow.</strong></p><p><em>We’re invested in you and your success. Everything we do is more than just a project. It’s our challenge as human beings, too. That’s why we bring a thoughtful and collaborative approach to every one of our partnerships.</em></p><p><em>At Jacobs, we challenge the status quo and redefine how to solve the world’s greatest challenges, transforming big ideas into intelligent solutions for a more connected, sustainable world.</em></p><p><em>Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow&nbsp;</em></p><p><strong>Your Impact:</strong></p><p>Jacobs is seeking a highly motivated Jr. Business Development Coordinator to perform a broad range of coordination and administrative tasks in support of business development opportunity pursuits and related activities. This role can sit 100% remote.</p><p><strong>Core Duties and Responsibilities</strong></p><ul><li>Assists with the coordination and development of opportunity response documents in alignment with Jacobs’ Relationship-Based Sales (RBS) process.</li><li>Collaborates with Business Development Team and leadership to establish and populate client/proposal information repositories (e.g., SharePoint). Manages SharePoint organization and content.</li><li>Prepares written and graphical elements of sales opportunity response documents such as proposals and presentations.</li><li>Proofs and edits technical and non-technical documents for consistency and compliance with client requirements (Government solicitation).</li><li>Organizes, participates in response-related meetings (internal and/or client), and captures meeting minutes as appropriate.</li><li>Coordinates finalization and production of response documents (printing, copying, binding, shipping, or electronic uploads or preparation of digital media as required by Government solicitation).</li><li>Updates/maintains non-opportunity specific/additional sales qualification and reference materials (including résumés, project descriptions, contract data, and organization charts) in designated knowledge and information management systems.</li><li>Assists with AERO Growth &amp; Sales Team activity and event planning; training and development coordination; and process improvement initiatives</li><li>In alignment with individual career development and AERO Growth &amp; Sales needs, may engage in proposal writing assignment</li><li>May provide guidance and direction to other Business Development Coordinators.</li></ul><p><strong>Here’s What You’ll Need:</strong></p><p><strong>Required Qualifications</strong></p><ul><li>Education and Experience: Bachelor’s degree plus three (3) years of related experience, or any equivalent combination of relevant education and experience for a total of seven (7) years.</li><li>Technical: Strong capability in Microsoft Office suite and proficiency in database applications. Strong communication skills.</li><li>Languages: Effective verbal and written communication skills in English.</li></ul><p><strong>Essential Functions for Position</strong></p><p><strong>Physical Requirements</strong>&nbsp;Work may involve sitting or standing for extended periods of time. The position may require filing, typing, and reading from a computer screen. Must have sufficient mobility, including but not limited to: bending, reaching, turning, and kneeling to complete daily duties in a timely and efficient manner. There is a possibility that due to parking availability and the location of work, walking moderate to long distances may be required. May visit clients, operations, or other external sites that require Personal Protective Equipment (PPE) such as closed-toe shoes, hard hats, or other special gear.</p><p><strong>Work Environment</strong>&nbsp;Generally an office environment, but can involve inside or outside work depending on the task. An inside environment may be a cubicle (considerations: close quarters, low to moderate noise, bright or dim lighting). Outside work may include various environmental conditions including warm and cold climates. Needs to be able to work well with co-workers, customers, and all levels of management. No hazards on the job or unusual environmental conditions. While this is a remote position, travel to Tullahoma for proposal reviews, finalization, production, and other business development activities are likely.</p><p><strong>Equipment and Machines</strong>&nbsp;Ability to operate office equipment such as a personal computer, printer, copy machine, telephone, fax machine, and other equipment including desk supplies and other work-related tools as required. May be required to drive a company-owned or rental vehicle in the conduct of work or for work travel.</p><p><strong>Attendance&nbsp;</strong>Regular hours will be between Monday – Friday 8:00am – 5:00pm. Regular attendance of scheduled hours is extremely important, but not critical, except for deadlines and meetings. Punctuality and regular attendance are necessary to meet deadlines. Must exhibit flexibility of work hours to adjust to surge situations based on critical mission requirements. Work may be required after hours and on weekends, and sometimes on short notice. Must also be willing and able to travel, as may be needed.</p><p><strong>Other Essential Functions</strong>&nbsp;Must demonstrate professional behavior at all times when dealing with customers, management, and co-workers. Must have clear, concise, and accurate communication skills in English, both verbal and written. Grooming and dress must be appropriate for the position and must not impose a safety risk to employees or others. Must maintain a positive work atmosphere by behaving and communicating in a professional manner. Independent personal transportation to the office or worksite is required. Travel to and from customers’ locations and the test fields may be required to support projects. This may involve airline travel. In some cases, accommodations can possibly be made for POV, if necessary. When operating any vehicle for work purposes, one must wear a seat belt and in addition, no cellular devices are to be used when the vehicle is in motion.</p><p>Jacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under&nbsp;<a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(234, 117, 2);\">Federal EEO laws</a>&nbsp;and&nbsp;<a href=\"https://www.eeoc.gov/sites/default/files/migrated_files/employers/eeoc_gina_supplement.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(234, 117, 2);\">supplemental language</a>.</p><p>Visit&nbsp;<a href=\"https://www.jacobs.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(234, 117, 2);\">jacobs.com</a>&nbsp;and connect with Jacobs on&nbsp;<a href=\"https://www.linkedin.com/company/jacobs/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(234, 117, 2);\">LinkedIn</a>,&nbsp;<a href=\"https://twitter.com/JacobsConnects\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(234, 117, 2);\">Twitter</a>,&nbsp;<a href=\"https://www.facebook.com/JacobsConnects/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(234, 117, 2);\">Facebook</a>&nbsp;and&nbsp;<a href=\"https://www.instagram.com/jacobsconnects/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(234, 117, 2);\">Instagram</a></p><p></p>",
    "apply": "https://careers.jacobs.com/job/15906088/jr-business-development-coordinator-tullahoma-tn/",
    "company": "/companies/jacobs",
    "cName": "Jacobs",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Strategic Project Manager",
    "description": "<p></p><h4><strong>Description</strong></h4><p>In 2021 WorkMotion launched its new software product&nbsp;<a href=\"https://workmotion.com/solutions/workflex/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">WorkFlex</a>&nbsp;to further transform the labour market. We support businesses in improving their company culture by offering flexible work opportunities. With our software we enable companies to offer temporary work from abroad as a benefit to their employees (e.g. Maria works in Germany and would like to work from Spain for four weeks, where her parents live).</p><p>As a&nbsp;Strategic Project Manager, you will work directly with the WorkFlex General Manager and be responsible to drive the growth of the business by managing customer acquisition, analyzing new business opportunities and identifying growth levers. You will need to use your creativity and eye for strategy, along with your business mindset to create a scalable solution that enhances and promotes WorkFlex's vision. Take advantage of this unique opportunity to actively shape WorkFlex’s growth story.</p><p><strong>What you’ll do…</strong></p><ul><li>Enhance our go-to-market and customer acquisition strategy</li><li>Engage with existing clients and partners and help them to be successful</li><li>Identify and execute new marketing and sales initiatives</li><li>Work closely with our sales and marketing team to identify and implement new initiatives</li><li>Analyze performance and identify improvement levers</li><li>Engage with existing clients and partners and help them to be successful</li><li>Identify and evaluate new business opportunities</li><li>Manage and drive your own projects; you will get responsibility from day one</li><li>Support hiring of key roles</li></ul><p><strong>What we’re looking for…</strong></p><ul><li>Degree from a top tier university</li><li>2+ years of work experience in consulting, VC or hyper-growth startups</li><li>Highly analytical and have an eye for details</li><li>High level of collaboration and effective communication across all levels of the organization and outside stakeholders</li><li>Proven experience dealing with multiple internal stakeholders, such as sales, marketing, operations, etc.</li><li>Ability to tackle and deliver multiple projects simultaneously</li><li>Proactive and independent working and learning attitude</li><li>Hands-on working style with the capacity to deliver strong results and to impact business decisions in a dynamic environment</li><li>Fluent English proficiency, German skills are a plus</li></ul><p><strong>What we offer…</strong></p><ul><li>As a fully remote and completely distributed team, you can do your best work from anywhere you are the happiest</li><li>Opportunities to get to know some of your colleagues at our offices</li><li>Competitive salary</li><li>Merit-based culture with substantial growth opportunities</li><li>Trust-based work – organize your own schedule. We want to celebrate results, not hours spent working</li><li>Collaborative team culture where everyone's input is valued</li><li>Subsidised gym membership subscription and other benefits</li><li>Training and development allowance</li><li>Regular company and team events like Summer or Christmas parties, and more! (COVID permitting)</li></ul><p><em>*Some benefits may vary due to local law and regulations.</em></p><p><strong><em><span class=\"ql-cursor\">﻿</span></em>Who we are…</strong></p><p><a href=\"https://workmotion.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">WorkMotion</a>&nbsp;is a remote-first HR-tech startup founded in 2020. We offer an all-in-one HR platform to our clients, allowing them to compliantly hire the very best talent anywhere in the world (WorkGlobal &amp; WorkDirect). Additionally, we enable our customers to retain their talents by offering them location-flexible temporary employment abroad through our easy to use WorkFlex product.</p><p>WorkMotion is led by an experienced founding team, and backed by some of the most renowned investors globally. You will be part of our incredibly intercultural team distributed all over this beautiful planet and will have the chance to learn and grow with the company. If you like to roll up your sleeves and go all in, we can do it and build the #futureofwork together! We'd love to see you soon.</p><p><em>**No matter what you look like, where you’re from or where you prefer to work, we encourage all to apply. We believe that the more diversified we are, the more we can revolutionise the working world!**</em></p><p></p>",
    "apply": "https://apply.workable.com/workmotion/j/11CA2FC30B/",
    "company": "/companies/workmotion",
    "cName": "WorkMotion",
    "location": "Germany",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Vendor Ops Management Consultant",
    "description": "<p></p><p><strong>Description:</strong></p><p><strong>Description</strong></p><p><span>SHIFT: Day Job</span></p><p><span>SCHEDULE: Full-time</span></p><p><strong><u>Job Title:&nbsp;</u></strong>Vendor Operations Management Consultant</p><p><strong><u>Location:</u></strong>&nbsp;100% Remote (Only considering candidates residing in Indiana)</p><p><strong><u>Be part of an extraordinary team!</u></strong></p><p>We are looking for leaders at all levels of the organization who are passionate about making an impact on our members and the communities we serve. You will thrive in a complex and collaborative environment where you take action and ownership to solve problems and lead change. Do you want to be part of a larger purpose and an evolving, high-performance culture that empowers you to make an impact?&nbsp;</p><p><strong><u>How you will make an impact:</u></strong></p><p>Responsible for managing relationships with multiple vendors to ensure business goals are achieved for an enterprise function.</p><p><strong><u>Primary duties to include, but are not limited to:</u></strong></p><ul><li>Manages the day-to-day execution of vendor agreements to ensure compliance, monitor quality, and when necessary, develop corrective action plans.</li><li>Develop and maintain key performance indicator dashboard related to vendor quality improvement goals and overall performance.</li><li>Reconciles vendor invoices.</li><li>May participate in fact-based negotiations of agreements and/or participate or lead cross-functional teams to implement vendor services.</li></ul><p><strong>Qualifications</strong></p><p><strong><u>Minimum Requirements:</u></strong></p><p>Requires a BA/BS degree in business or related field required; 5 - 7 years of increasingly responsible professional-level contract management/vendor management experience; or any combination of education and experience, which would provide an equivalent background.</p><p>We offer a range of market-competitive total rewards that include merit increases, paid holidays, Paid Time Off, and incentive bonus programs (unless covered by a collective bargaining agreement), medical, dental, vision, short and long term disability benefits, 401(k) +match, stock purchase plan, life insurance, wellness programs and financial education resources, to name a few.</p><p><em>The health of our associates and communities is a top priority for Anthem. We require all new candidates to become vaccinated against COVID-19. If you are not vaccinated, your offer will be rescinded unless you provide – and Anthem approves – a valid religious or medical explanation as to why you are not able to get vaccinated that Anthem is able to reasonably accommodate. Anthem will also follow all relevant federal, state and local laws.</em></p><p>Anthem, Inc. has been named as a Fortune Great Place To Work in 2021, is ranked as one of the 2021 World’s Most Admired Companies among health insurers by Fortune magazine, and a Top 20 Fortune 500 Companies on Diversity and Inclusion. To learn more about our company and apply, please visit us at careers.antheminc.com. Anthem is an Equal Employment Opportunity employer and all qualified applicants will receive consideration for employment without regard to age, citizenship status, color, creed, disability, ethnicity, genetic information, gender (including gender identity and gender expression), marital status, national origin, race, religion, sex, sexual orientation, veteran status or any other status or condition protected by applicable federal, state, or local laws. Applicants who require accommodation to participate in the job application process may contact&nbsp;ability@icareerhelp.com&nbsp;for assistance</p><p></p>",
    "apply": "https://anthemcareers.ttcportals.com/jobs/9556713-vendor-operations-management-consultant",
    "company": "/companies/anthem-inc",
    "cName": "Anthem, Inc.",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Associate Manager, Business Dev",
    "description": "<p></p><p><strong>Position Summary:</strong></p><p><span>If you are a highly motivated and successful business development professional and want to utilize your management skills, we have a great opportunity for you! &nbsp;As an engaged and motivated leader/coach, you will lead and develop a team of Business Development Representatives (BDR). You will supervise the day-to-day business and create a successful and positive culture noted by exceptional individual and team performance and high morale.</span></p><p><span>In this role, you will be given the opportunity to further hone your management skills and develop deep knowledge of the risk and compliance industry. Your impact as a leader on our BDR team will directly influence our revenue goals!</span></p><p><strong>We Offer You:</strong></p><ul><li><span>Inspiring Culture.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>Invested teammates, belonging groups, and a socially determined culture</li><li><span>Meaningful Work.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Innovative products and solutions with real life impact for people and organizations</li><li><span>Career Growth.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Stellar training, mentorship, and an unwavering commitment to your growth and success</li><li><span>Life Flexibility.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>To care for you, your loved ones and your community</li><li><span>Industry Leadership.&nbsp;&nbsp;</span>A highly reputable, fast growing and consistently profitable organization</li><li><span>Real Rewards.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>Competitive and transparent pay practices, wellbeing programs and benefits with choice</li></ul><p><strong>What You Will Do:</strong></p><ul><li><span>Recruit, train, motivate and coach a group of junior and senior BDRs in best practices for lead development and pre-sales, to include email, phone and chat using sales enablement tools to connect with new prospects and current customers</span></li><li><span>Willingness and the ability to work west coast hours</span></li><li><span>Propose, demonstrate and prove new best practices, pushing our team to greater impact</span></li><li><span>Ensure the effective use of Salesforce.com, documenting, tracking and monitoring all leads and activities as well as other related sales software’s</span></li><li><span>Acquire in depth knowledge of our full range of services and convey that knowledge to potential customers, adhering to company messaging and positioning</span></li><li><span>Help your team generate qualified business leads by mentoring their cold calling efforts; helping them to engage with and develop prospects to be closed by the Sales team </span></li><li><span>Teach your team to utilize smart, targeted questions to speak knowledgeably with decisions makers such as VPs, Directors and C-suite personnel</span></li><li><span>Compile weekly and monthly team reports, modifying as needed</span></li></ul><p><strong>What You Will Need:</strong></p><ul><li><span>A Bachelor’s Degree with an emphasis on business, communications or marketing preferred, not required</span></li><li><span>2+ years of business development, telemarketing, lead generation or sales experience </span></li><li><span>1+ years’ experience that successfully demonstrates your leadership skills </span></li><li><span>Highly motivated, self-starter with a proven track record of establishing and exceeding quotas and other measurable goals with demonstrated impact delivering high quality leads to Sales</span></li><li><span>Passion and energy to motivate others </span></li><li><span>A process-oriented approach and creative mindset</span></li><li><span>Excellent organizational and time management skills, with the ability to manage competing priorities</span></li><li><span>Excellent verbal and written communication skills, presentations skills and a commitment to collaborate with people across a variety of levels with diverse backgrounds</span></li></ul><p><span>NAVEX is an equal opportunity employer, including disability/vets.</span></p><p><em style=\"background-color: transparent;\">If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!</em></p><p></p>",
    "apply": "https://navexglobal.wd5.myworkdayjobs.com/en-US/NAVEX/job/Remote---Pacific-NW/Associate-Manager--Business-Development_R3561",
    "company": "/companies/navex-global",
    "cName": "NAVEX Global",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Product Owner",
    "description": "<p></p><p><strong>About Digital Diagnostics:</strong></p><p>At Digital Diagnostics, we’re on a mission to transform the quality, accessibility, and affordability of global healthcare through the automation of medical diagnosis and treatment.</p><p>Our flagship product – IDx-DR – is an artificial intelligence algorithm where the computer, not the physician, performs the diagnosis.&nbsp;Built on a series of patented machine learning algorithms, our FDA-cleared software platform detects early signs of diabetic retinopathy, a debilitating eye disease that impacts 30+ million people with diabetes in the US.&nbsp;</p><p>We are using everything we’ve learned from IDx-DR to expand our AI platform across different therapeutic areas like skin cancer.&nbsp;To deliver on our mission, we need to expand our team of highly skilled and motivated team members to help us change healthcare for the better!</p><p><strong>Who We Are:</strong></p><p>Working for Digital Diagnostics offers you the opportunity to:</p><ul><li>Work with world-renowned computer scientists and clinicians who are pushing the limits of artificial intelligence, computer vision, and machine learning in medicine.</li><li>Tackle complex challenges and projects with the highest levels of quality and execution for audiences that include top technologists, the FDA, and world-leading healthcare providers.</li><li>Push the accessibility and quality of healthcare to new heights to improve the lives of millions of people.</li><li>Contribute to a rapidly growing startup that lives by its mission to do “AI the Right Way”.</li></ul><p><strong>Who You Are:</strong></p><p>Digital Diagnostics is looking for a Product Owner who will be an integral member of the product team, a “voice of the customer”, and a leader for their agile engineering team. Each day, the Product Owner will refine and hone features with our engineering partners, ensuring we’re delivering the value our stakeholders want and need.</p><p>Our Product Owner will:</p><ul><li>&nbsp;Lead feature refinement and requirement alignment for an agile engineering team</li><li>Strong collaboration with product managers, engineers, and designers to deliver high-quality product in a timely fashion</li><li>Review, accept, and prioritize feedback from project stakeholders</li><li>Ensure that team deliverables meet agreed-upon standards for quality and business needs</li><li>Active participation in daily stand-up and agile ceremonies</li><li>Partner with teams across Digital Diagnostics, including customer success and marketing, to ensure the product we are creating meets the needs of our end customers</li></ul><p><strong>What We Are Looking For:</strong></p><ul><li>1-3 years experience as a Product Owner or similar role, writing user stories and validating acceptance criteria</li><li>Highly organized and detail-oriented. Proven ability to take on ambiguous tasks, translate them into concrete outcomes and processes, and deliver an output effectively and quickly</li><li>Strong communication skills. Effectively distill information to both non-technical and technical stakeholders</li><li>Adaptable/Gritt. Experience pivoting quickly and/or working effectively in startup environments</li></ul><p><strong>What We Believe:</strong></p><p>At Digital Diagnostics, we’re doing “AI the right way” by building healthcare solutions that are safe, equitable, and accessible. We’re not only building a platform; we’re also building a community that emulates these values. We believe that inclusion and equity in healthcare start with a community of collaborators that celebrates human differences including race, ethnicity, gender, age, sexual orientation, human need, veteran status, political affiliation, and religion. We value what makes each person unique and create a place for everyone to thrive as we build towards shared goals. We’re committed to continuous learning and are striving to create a principled workplace while continuing to impact the world around us.</p><p>If this sounds like you, then apply to be our next Product Owner!</p><p>Feeling over or underqualified but still think we’re cool? Have a specialty that doesn’t quite line up with this posting? We are recruiting at a number of levels for all sorts of specialties: Check out our career page at&nbsp;<a href=\"https://dxs.ai/about/careers/current-openings/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: var(--stormGrey);\"><strong>https://dxs.ai/about/careers/current-openings/</strong></a></p><p>Unfortunately, we are not able to sponsor an immigration case for employment at this time (for example, H-1B or other employment-based immigration cases).</p><p></p>",
    "apply": "https://digital-diagnostics-inc.prismhr-hire.com/job/301501/product-owner",
    "company": "/companies/digital-diagnostics",
    "cName": "Digital Diagnostics",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Product Manager (Node as a Service)",
    "description": "<p></p><p><strong>Job description</strong></p><p>We are a community of ambitious, self-reflective people building core infrastructure for blockchain protocols. At Chorus One we’re motivated by the conviction&nbsp;<strong><em>of choice and freedom for token holders and users of blockchain networks</em></strong>, and want to do something about it, come join us!</p><p>At Chorus One we empower people to do their best work and make our greatest contribution as an organization.**</p><p>As a Product Manager, you are a detail-oriented, hard-working, problem solver with an optimistic attitude, that can easily (and happily) wear many hats. You are able to uphold our company’s principles and values while adding to our unique culture. As a member of our Product Management Team, you will broadly be responsible for developing the company’s product roadmap for Node as a Service.</p><p><strong>Responsibilities:</strong></p><ul><li>Collaborate cross-functionally with Chorus One Business Development team to translate business vision into multi-quarter product strategy and roadmap for an institutional-grade crypto staking platform to be used by fund managers and institutions dealing with crypto assets</li><li>Create and maintain detailed Market Requirement Documents and Product Requirement Documents that are supported by extensive market research and customer feedback</li><li>Drive alignment with Engineering around your product roadmap as well as navigate around constraints and mitigate potential risks</li><li>Scoping and designing integration opportunities with crypto custody and wallet providers partners.</li><li>Develop and maintain an API strategy that is informed by partner and customer use cases</li><li>Develop a data management strategy in support of managing and reporting on staking rewards</li><li>Build excitement and understanding within the engineering team on product opportunities</li><li>Drive product development from conception to launch</li><li>Monitor development status and identify issues/risks in a timely fashion and proactively collaborate to ensure timely resolution</li><li>Define and measure product success and excellence metrics to help prioritize efforts with the highest impact</li></ul><p><strong>Job requirements</strong></p><p><strong>Minimum Qualifications:</strong></p><ul><li>5+ years of experience directly in product management or product engineering. Preferably with B2B, financial markets experience</li><li>Previous experience working in software product management and bringing software products to market</li><li>Experience in launching API-based software products and services</li><li>Strong analytical, prioritization, and problem-solving skills</li><li>Exceptional interpersonal communication, relationship management, and organizational skills</li><li>Past experience working closely with UX/UI designers</li><li>Bachelor's degree in Electrical Engineering, Computer Science, other related technical fields, or equivalent certifications.</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>Experience with developing B2B SaaS solutions</li><li>Demonstrated passion for cryptocurrency and financial markets</li><li>Working understanding of DevOps and Agile Development</li></ul><p><strong>Job Type: Full-time</strong></p><p>Salary: $100,000 - $130,000 plus equity. Final salary commensurate with experience.</p><p>Chorus One is proud to be an equal opportunity workplace. We provide equal employment opportunities to all employees and applicants for employment and prohibit discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. If you have a disability or special need that requires accommodation, please let us know by emailing positions@chorus.one</p><p></p>",
    "apply": "https://careers.chorus.one/o/product-manager-node-as-a-service",
    "company": "/companies/chorus-one",
    "cName": "Chorus One",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Senior Product Manager",
    "description": "<p></p><p>Are you interested in championing a product that makes work better by making people better at work? The science is clear: happier employees are more productive and stay at companies longer—everyone wins!</p><h4><strong>Who we are</strong></h4><p>Humu is building experiences—backed by science—to drive positive change in the way people and organizations work. We are a behavioral change start-up founded by<a href=\"https://www.linkedin.com/in/laszlobock/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">&nbsp;Laszlo Bock,</a>&nbsp;<a href=\"https://www.linkedin.com/in/wcrosby/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">Wayne Crosby</a>, and&nbsp;<a href=\"https://www.linkedin.com/in/wisdomj/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">Dr. Jessie Wisdom.</a>&nbsp;We're a fun group with diverse backgrounds and expertise in the People and Product space.</p><p>Humu’s Nudge Engine™ deploys thousands of customized nudges—small, personal steps—throughout organizations to empower every employee, manager, team, and leader as a change agent. Over time, our nudges grow increasingly aware of the timing, messaging, and motivational techniques that inspire individual employees towards action. Businesses large and small rely on Humu to translate business strategies into real competitive advantages through more engaged and productive teams.&nbsp;</p><h4><strong>The role</strong></h4><p>As a Product Manager at Humu, you’ll help develop strategy and goals for the product team, and clear a path for execution to make those goals a reality. We’re a collaborative environment, and we’re looking for someone who prioritizes the team above all else. You’ll act as an amplifier and collaborator across all teams — listening to, engaging with all teams and cross-pollinating ideas.</p><h4><strong>Your first week you'll do things like:</strong></h4><ul><li>Examine the data around an existing feature, interview customers, and develop a plan for improving it</li><li>Examine collected feedback around a specific feature request, talk to users who gave that feedback, and think about how that fits in with the overall product, then create a spec to address it</li></ul><h4><strong>Your first quarter you'll do things like:</strong></h4><ul><li>Talk to our customers to understand the unique challenges they face</li><li>Partner with designers, engineers, and scientists to design solutions, prioritize the roadmap, and help customers achieve their goals</li><li>Examine purchase and setup flows to find weak points and improve success rates</li></ul><h4><strong>Your first year you'll do things like:</strong></h4><ul><li>Find ways to make our customers more successful by deeply understanding the different challenges faced by different customer personas in different industries</li><li>Have an impact on workers everywhere by translating workplace psychology research and modern B2B software design into tangible features that improve job satisfaction and drive personal growth</li><li>Plan and build integrations with complementary systems so that Humu is stickier and more valuable to our customers</li></ul><p><strong>About you</strong></p><ul><li>4+ years of experience in B2B or B2C SaaS Product Management</li><li>Demonstrated track record of product leadership. Ability to lead and influence teams as you drive key product outcomes.</li><li>Experience moving quickly — establishing timelines and delivering high-quality work on schedule</li><li>Expert communicator and collaborator, with an emphasis on understanding multiple perspectives</li><li>A tolerance for ambiguity and a willingness to wear multiple hats</li><li>A passion for our mission to make work better for everyone, everywhere</li></ul><p></p>",
    "apply": "https://boards.greenhouse.io/humu/jobs/3377704",
    "company": "/companies/humu",
    "cName": "Humu",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Jr. Product Manager",
    "description": "<p></p><p>Seer Interactive is a digital marketing consultancy that harnesses compassion, data, and technology to make a mark on our communities - our coworkers, our clients, our industry, and our neighbors. We believe in relentlessly pursuing (and sharing) the truth – bringing together millions of data points from quantitative and qualitative sources to base our decisions on. Our purpose is to unlock potential for our communities mentioned above. Our vision is a world where it’s easy to do the right thing throughout those communities. If you’re ready to uplift others, challenge your ego, commit to the truth, and be better than yesterday – keep reading.</p><p>What about you?&nbsp;You’re a product manager with 2-4 years of experience managing multiple products at once, with different audiences, differing goals, and competing priorities. You pay attention to the details without losing sight of the big picture and help your team members to do the same. Managing complex products, variable timelines, competing priorities, and working directly with multiple departments &amp; divisions is your jam. You also have experience working within agile methodology.</p><p>You enjoy driving team efficiency through internal products while working with external clients &amp; customers to create products they love to use. You enjoy tackling unique problems and challenges, listening to audiences’ needs &amp; desires, crafting customized solutions, then scoping requirements into sprints. You love bringing a product from concept/idea through to a testable MVP, while working with teams on QA &amp; UAT, before launching a new product to the world while tracking usage rates, rolling out training &amp; reporting on success towards KPIs.</p><p><strong>Here are some highlights of what you'll be doing...</strong></p><ul><li class=\"ql-indent-1\">You’ll be a junior product manager within our innovation division, working within the product department, in tandem with our engineering, and research &amp; development teams.&nbsp;</li><li class=\"ql-indent-1\">You will manage a variety of internal &amp; external products working together with a project manager &amp; product director, along with divisional stakeholders as necessary, to facilitate collaboration.</li><li class=\"ql-indent-1\">You work directly with development teams in sprints, with agile methodology and recurring scrum meetings.&nbsp;</li><li class=\"ql-indent-1\">You manage and guide products through our product roadmap from idea, to MVP, to full-blown products, helping to lead the strategic vision of our product team.&nbsp;</li><li class=\"ql-indent-1\">You manage the product quality assurance (QA) process to ensure requirements for product sprints moving to UAT are running smoothly.</li><li class=\"ql-indent-1\">You help setup and run the user acceptance testing (UAT) process for internal and external products to ensure we’re collecting feedback from audiences before launching final products.</li><li class=\"ql-indent-1\">You work between our innovation team, internal stakeholders, other divisions and external stakeholders &amp; customers to ensure the highest product quality.</li></ul><p><strong>The skills you'll bring to the table...</strong></p><ul><li class=\"ql-indent-1\">Experience launching multiple complex products simultaneously across multiple audiences.</li><li class=\"ql-indent-1\">Experience launching products from infancy/idea all the way through to revenue-driving.</li><li class=\"ql-indent-1\">You’ve worked on products &amp; projects with internal cross-functional teams of 10+ people.</li><li class=\"ql-indent-1\">You have a baseline understanding of digital marketing, innovation, development &amp; product management.</li><li class=\"ql-indent-1\">Working knowledge of big data &amp; digital marketing, including SEO, Paid Media, Data Analytics, and UX</li><li class=\"ql-indent-1\">You have experience translating business &amp; customer problems into requirements &amp; scoping for sprint-style releases.&nbsp;</li><li class=\"ql-indent-1\">You’re able to look past short-term problems to create visionary solutions with products - you want to help us build new things!</li><li class=\"ql-indent-1\">You know how to collaborate with project managers to use bandwidth forecasting to ID priorities across products, teams, and audiences.&nbsp;</li><li class=\"ql-indent-1\">Your strong communication, organization, and time management skills are unmatched, and your team loves you for them!</li><li class=\"ql-indent-1\">You have experience interfacing directly with POCs of all levels, including direct interfacing with executives and can adapt your communication style and approach accordingly.</li><li class=\"ql-indent-1\">Experience training a team on how to use products, how to roll out thought leadership, and how to increase utilization and usage rates across customers &amp; internal teams.</li></ul><p><em>Not ready to apply but want to keep in touch?&nbsp;</em><a href=\"https://www.seerinteractive.com/seer-shares-sign-up/?signup_show=email,name,interests,subscriptions&amp;signup_subscriptions=weekly,career\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\"><em>Stay connected via our monthly Career Update newsletter!</em></a><em>&nbsp;We'll share curated content on Seer, open roles, industry insights, career advice, events you don't want to miss, and more (so you never miss a beat).</em></p><p><em>Sometimes the best opportunities are hidden by self-doubt. We disqualify ourselves before we have the opportunity to be considered. Regardless of where you came from, how you identify, or the path that led you here-- you are welcome. If you read this job description with a belly full of excitement, we’re just as excited about you. You have to apply though :)</em></p><p></p>",
    "apply": "https://jobs.lever.co/seerinteractive/9993a9cb-e255-459d-9ec8-81cbdbd9a3b9",
    "company": "/companies/seer-interactive",
    "cName": "Seer Interactive",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "IVR Product Owner",
    "description": "<p></p><p><strong><u>Role Value Proposition</u></strong><span>:&nbsp;</span></p><p><span>As the Product Owner, you will be responsible for Product Lifecycle and Optimization for the customer experience solution(s) assigned. These include IVR, Conversational IVR, Telephony, ACD, and Computer Telephony Integration (CTI).</span></p><p class=\"ql-align-justify\"><strong><u>Responsibilities:</u></strong></p><ul><li class=\"ql-align-justify\"><span>Virtual roles predominately work from a home office with periodic visits to the assigned GCSO office as needed for team events, meetings, training, business continuity, etc.</span></li><li><span>Working with IT Engineering, setting the short and long-term vision and strategy for the assigned Voice Platform channel solution to support the US SERVICES CALL CENTER call center.</span></li><li><span>Communicate this strategy to all of the relevant participants and stakeholders.</span></li><li><span>Coordinate with IT Engineering the online application solution roadmap, delivering what matters most to achieve the strategic goals and initiatives of US SERVICES CALL CENTER.</span></li></ul><p class=\"ql-align-justify\"><strong><u>Operating Goals:</u></strong></p><p class=\"ql-align-justify\"><strong>For the Voice Channel Solutions assigned</strong></p><ul><li><span>Align the respective Voice Platform application release process and coordinating all of the activities required to bring these solutions into production to support US SERVICES CALL CENTER. Including managing dependencies in and across releases to complete release phases and milestones.</span></li><li><span>Own the creative process of generating, developing, and curating new ideas, determining which ideas should be promoted into features to push the online strategy forward.</span></li><li><span>Responsible for documenting, reviewing and approval of the requirements for each feature and the desired user experience, contained within the Voice Platform solution BRDs and FRDs.</span></li><li><span>Work closely with IT AD, IT engineering, and Third Party Vendors, on the technical specifications and ensure that teams have all of the information they need to deliver a complete solutions to production.</span></li><li><span>Leverage metric and data analysis derived from application performance/availability, call center, user satisfaction surveys, user feedback and technical incidents to identify opportunities, recommend and ensure the delivery of solutions and enhancements to optimize platforms and solutions.</span></li><li><span>Serve as the Voice Platform solution SME to US SERVICES CALL CENTER and other partners, providing business expertise and information supporting their development of investigation procedures and processes enabling identification and resolution of production technical issues on MetLife’s platforms.</span></li><li class=\"ql-align-justify\"><span>&nbsp;Support UAT Testing by helping define UAT test scenarios, review UAT test cases and support UAT testing team</span></li></ul><p class=\"ql-align-justify\"><strong><u>Technical &amp; Professional Skills</u></strong></p><ul><li class=\"ql-align-justify\"><span>New hires should live a commutable distance from the site the role is posted in</span></li><li class=\"ql-align-justify\"><strong>Collaboration Tools:</strong><span>&nbsp;Product roadmap tools, Jira, TFS, Confluence, Azure DevOps, ServiceNow</span></li><li class=\"ql-align-justify\"><strong>Design Thinking:&nbsp;</strong><span>Personas, Journey Maps, Story Maps, User story writing</span></li><li class=\"ql-align-justify\"><span>Understanding of technologies used in the product</span></li><li class=\"ql-align-justify\"><span>Agile and DevOps methodology</span></li><li class=\"ql-align-justify\"><span>Acceptance criteria</span></li></ul><p><strong>At MetLife, we’re leading the global transformation of an industry we’ve long defined. United in purpose, diverse in perspective, we’re dedicated to making a difference in the lives of our customers.</strong></p><p><strong><u>MetLife:</u></strong></p><p class=\"ql-align-justify\">MetLife, through its subsidiaries and affiliates, is one of the world’s leading financial services companies, providing insurance, annuities, employee benefits and asset management to help its individual and institutional customers navigate their changing world. Founded in 1868, MetLife has operations in more than 40 countries and holds leading market positions in the United States, Japan, Latin America, Asia, Europe and the Middle East.</p><p class=\"ql-align-justify\">We are one of the largest institutional investors in the U.S. with $642.4&nbsp;billion of total assets under management as of March 31, 2021. We are ranked #46&nbsp;on the Fortune 500 list for 2021. In 2020,&nbsp;we were named to the Dow Jones Sustainability Index (DJSI) for the fifth year in a row. DJSI is a global index to track the leading sustainability-driven companies. We are proud to have been named to Fortune magazine's 2021 list of the \"World's Most Admired Companies.\"&nbsp;</p><p class=\"ql-align-justify\">MetLife is committed to building a purpose-driven and inclusive culture that energizes our people. Our employees work every day to help build a more confident future for people around the world.</p><p>We want to make it simple for all interested and qualified candidates to apply for employment opportunities with MetLife.&nbsp;For further information about how to request a reasonable accommodation, please click on the Disability Accommodations link below.</p><p>MetLife is a proud Equal Employment Opportunity and Affirmative Action employer dedicated to attracting, retaining, and developing a diverse and inclusive workforce. All qualified applicants will receive consideration for employment at MetLife without regards to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity or expression, age, disability, national origin, marital or domestic/civil partnership status, genetic information, citizenship status, uniformed service member or veteran status, or any other characteristic protected by law.</p><p class=\"ql-align-justify\">MetLife maintains a drug-free workplace.</p><p></p>",
    "apply": "https://jobs.metlife.com/job/Cary-IVR-Product-Owner-Virtual-NC-27511/889678500/",
    "company": "/companies/metlife",
    "cName": "MetLife",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Leave Specialist",
    "description": "<p></p><p>At The Standard, you’ll join a team focused on putting our customers first.</p><p>Our continued success is driven by a high-performance culture. We’re looking for people who are collaborative, accountable, creative, agile and are driven by a passion for doing what’s right – across the company and in our local communities.</p><p>We offer a caring culture where you can make a real difference, every day.</p><p>Ready to reach your highest potential? Let’s work together.</p><p>Secure and analyze information to approve, deny, manage, and track all complexities of certified and reported leaves, including federal and statutory Family Medical Leave Act (FMLA), state company specific and other leaves. Manage workflow and develop appropriate leave management strategies to ensure prompt and accurate decisions and communications to employers and<span> employees.&nbsp;&nbsp;</span> Provide responsive and caring service to all customers.</p><p>Investigate, secure and analyze information pertaining to employees’ eligibility status, medical condition, occupational or employer requirements, and statutory regulations to accurately determine eligibility for and entitlement to leaves.&nbsp; Identify file/fact discrepancies and outstanding issues and secure additional documentation as needed while administering or tracking leaves within prescribed timeframes and service expectations.&nbsp; Make and communicate eligibility and leave decisions, and report or manage ongoing leaves timely and accurately.&nbsp;</p><p>Provide accurate and appropriate leave information to employees, employers, sales offices and other interested parties; resolve issues through effective oral and written<span> communication.&nbsp;</span> Analyze, research and respond to questions and issues, involving the appropriate people within or outside the department or company.</p><p><strong><u>Education &amp; Experience</u></strong><strong>:</strong> Diploma or GED required.&nbsp; 2 years of general office and customer service experience required. Leave, benefits or disability claim management experience preferred.</p><p><strong><u>Knowledge &amp; Skills</u></strong>:&nbsp; Ability to work in a team environment; Interact well with other team members and peers; Actively listen; Escalate issues when necessary; Provide customer centric solutions with exceptional customer service to both internal and external stakeholders; Build rapport with customers, and engage customers; Exercise independent judgment and make effective decisions; Defuse customer conflict; Handle situations with a high degree of professional maturity, sensitivity and confidentiality, which may require negotiation, adaptation of response or some research; Efficiently use software including but not limited to Microsoft Office Applications.&nbsp; Applies acquired job skills and working knowledge of company policies.</p><p>Working knowledge of: Federal and statutory Family Medical Leave Act (FMLA), statutory leaves and company specific leaves</p><p>#LI-Remote</p><p><em style=\"background-color: transparent;\">Note:&nbsp;The Standard is required to provide a reasonable estimate of the&nbsp;pay rate&nbsp;for this role when hiring a Colorado resident. The&nbsp;salary&nbsp;for employees working in Colorado in this role is listed below.&nbsp;The Standard’s package also includes incentive plan&nbsp;participation&nbsp;</em><a href=\"https://www.standard.com/careers/working-here\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"background-color: transparent; color: rgb(8, 117, 225);\"><u>and comprehensive benefits</u></a><span>&nbsp;</span><em style=\"background-color: transparent;\">including medical, dental, vision, retirement, and paid time off.</em><span>&nbsp;&nbsp;</span></p><ul><li><em style=\"background-color: transparent;\">Please note, eligibility to participate in an incentive program is subject to the rules governing the program and plan. Any award depends on various factors, including individual and organizational performance.</em><span>&nbsp;</span></li></ul><p><strong>Hourly Pay Range:</strong></p><p><span>13.37 - 22.74</span>Standard Insurance Company, The Standard Life Insurance Company of New York, Standard Retirement Services, Inc., StanCorp Equities, Inc. and StanCorp Investment Advisers, Inc., marketed as The Standard, are Affirmative Action/Equal Opportunity employers. All qualified applicants will receive consideration for employment without regard to race, religion, color, sex, national origin, gender, sexual orientation, age, disability, or veteran status or any other condition protected by federal, state or local law. The Standard offers a drug and alcohol free work environment where possession, manufacture, transfer, offer, use of or being impaired by an illegal substance while on Standard property, or in other cases which the company believes might affect operations, safety or reputation of the company is prohibited. The Standard requires a criminal background investigation, drug test, employment, education and licensing verification as a condition of employment. All employees of The Standard must be bondable.</p><p></p>",
    "apply": "https://standard.wd1.myworkdayjobs.com/en-US/Search/job/Leave-Specialist_REQ002668",
    "company": "/companies/the-standard",
    "cName": "The Standard",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Sr Customer Advocate, Tier 1 Support",
    "description": "<p></p><p>InVision’s Customer Support team is in search of an experienced&nbsp;<strong>Senior Customer Advocate, Tier 1 Support&nbsp;</strong>Representative to provide enterprise-level, front line support to customers.&nbsp;</p><p>InVision is the visual collaboration platform powering the world’s best companies. The heart of InVision is Freehand, our online digital whiteboard. We built Freehand to transform the way people work together. Transformation is a bold term, but we stand by it. So do our users from Amazon, Anthem, and American Express. And that’s just the A’s. We are trusted by 100% of the Fortune 100 because we understand that collaboration is about more than just seeing each other - it’s about fueling each other. More than 7 million people across global enterprises and small teams come to us when they are looking to transform the way they work together. InVision’s platform, education, and community enable businesses to work across distances and disciplines to unlock the expertise of every team member and deliver powerful business results.</p><p>InVision is a globally distributed, 100% remote organization. Our internal culture is made up of diverse, collaborative connections across more than 25 countries – forming a community where everyone belongs, thrives, and grows.&nbsp;</p><p>We’re on a mission to transform the way people work together by helping them collaborate better. On anything. From anywhere.&nbsp;</p><p>We are shaping the future of work.&nbsp;</p><p>Come join us.</p><p><strong>About the Team:</strong></p><p>This role is part of the Customer Support team which helps prospects and customers understand and get the most value out of our products. Customer Support Advocates are the face of InVision on our global support team and are responsible for helping ensure customers have an ideal customer experience by helping answer questions, tracking feature requests, troubleshooting basic technical issues, and escalating unresolved issues to cross functional partners in Support Engineering, Marketing, Sales, Success, and other departments at InVision. A Customer Support Advocate's goal is to make the customer experience as smooth as possible by helping whenever a customer runs into a bump in the road.</p><p><strong>What you’ll do:</strong></p><ul><li>Troubleshoot&nbsp;qualified customer support inquiries and requests via email, phone, live chat, social media, community moderation, video conferencing, and internal channels.</li><li>Compare, analyze, qualify, and escalate customer requests to appropriate teams or individuals.</li><li>Provide thoughtful technical and product support to those of varying technical fluencies.</li><li>Think on your feet, learn a complex product inside and out, diagnose and troubleshoot technical issues, and discover creative methods to resolve customer issues.</li><li>Advocate for ways to improve the customer experience in our product and processes</li><li>Share industry best practices on web/mobile design practices and tools with customers</li><li>Project work that may include developing and maintaining internal and customer-facing documentation, writing macros, auditing issues, testing new features, performing data migration tasks, developing training to prepare for new feature releases, or other projects that would benefit our customers and Customer Support team.</li></ul><p><strong>What you’ll bring:</strong>&nbsp;</p><ul><li>You have experience in a technical field.</li><li>You possess excellent written and verbal communication skills.</li><li>You're a natural-born evangelist with infectious enthusiasm and you genuinely relish troubleshooting and problem-solving.</li><li>You love to teach, and in order to do that well, you’re also eager to learn as much as you can.</li><li>You have related customer support, community moderation, or account management experience, preferably in a SaaS B2B setting.</li><li>You’ve worked as or with designers or other creative professionals and understand their needs.</li><li>You’re flexible, love having many irons in the fire, and have the skills to stay organized and on top of it all.</li><li>You’re able to work a 40 hour work week during local business hours M-F to provide support for our customers.</li><li>You’re able to use both a Mac and PC.</li><li>Experience with modern ticketing, customer engagement, and CMS solutions within customer service environments (Zendesk, Desk.com, Help Scout) is a plus.</li><li>Prior knowledge of design practices (UI, UX, research, testing) and design tools (Sketch, Adobe XD, Photoshop, Studio, Figma) are a plus.</li><li>Previous InVision experience is a plus.</li></ul><p><strong>About InVision:</strong></p><p><strong>InVision offers an incredibly unique work environment.&nbsp;</strong>The company employs a diverse team all over the world. Each InVision team member is given the freedom and tools to do their best work from wherever they choose.</p><p></p>",
    "apply": "https://boards.greenhouse.io/invision/jobs/4259622",
    "company": "/companies/invision",
    "cName": "InVision",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Service Rep",
    "description": "<p></p><p><strong>Description</strong></p><p>The Customer Service Representative responsibilities include, but are not limited to, the following:</p><p><strong>Responsibilities:</strong></p><ul><li>Addressing inbound phone calls and making outbound calls, as needed</li><li>Data entry of various order types from educational entities– purchase order, credit card and sample orders</li><li>Supporting&nbsp;the Customer Service, Warehouse, and Sales teams to meet customer needs</li><li>Identify and resolve order/customer issues, and if needed, direct to the designated resource or department and follow through for final resolution</li><li>Incorporating the use of Sales Force in the order entry process</li><li>Gaining&nbsp;knowledge of relevant computer applications and product to assist customers on all aspects of customer support</li><li>Must be able to work Monday-Thursday between the hours of 9:30am – 6pm and Friday 8:30am - 5pm.</li></ul><p><strong>What we’re looking for:</strong></p><p><strong>Successful candidates will thrive in a fast-paced environment and demonstrate a record of achievement:&nbsp;</strong></p><ul><li>Knowledge of Customer Service principles and best practices with a minimum of two-&nbsp;&nbsp;year call center experience</li><li>High school diploma required, some college preferred</li><li>Strong sense of urgency when it comes to answering customer inquiries, complaints and other requests</li><li>Strong organizational, problem solving, analytical and time management skills, along with the ability to multi-task and manage priorities and workflow</li><li>Interpersonal skills along with proven adaptability and initiative</li><li>Ability to work independently with some direction</li><li>Knowledge of Salesforce&nbsp;is a plus</li><li>PC proficient, Microsoft Office skills required</li><li>Demonstrated telephone and business email etiquette with the ability to communicate clearly, both written and verbally</li><li>Active listening skills</li><li>Attention to detail and accuracy</li><li>Versatility, flexibility and a willingness to work within constantly changing priorities with enthusiasm</li></ul><p></p>",
    "apply": "https://jobs.jobvite.com/careers/curriculumassociates/job/omUPjfw8",
    "company": "/companies/curriculumassociates",
    "cName": "CurriculumAssociates",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Support Specialist",
    "description": "<p></p><p>Scope AR is the pioneer of enterprise-class augmented reality solutions, delivering the industry’s only cross-platform AR tools for getting workers the knowledge they need, when they need it. The company is revolutionizing the way enterprises work and collaborate by offering AR tools that provide more effective and efficient knowledge-sharing to conduct complex remote tasks, employee training, product and equipment assembly, maintenance and repair, field and customer support, and more.</p><p>The company’s device-agnostic technology supports smartphones, tablets and wearables, making it easy for leading organizations like Johnson &amp; Johnson, Danaher, Lockheed Martin, Honeywell, and others to leverage AR as a new way to scale their organizations globally, with greater efficiency.&nbsp;&nbsp;</p><p>Working at Scope AR provides you the opportunity to have a real and major impact on the way products around the globe get created and how work gets done.</p><p>This role will have the successful candidate supporting some of the world's largest Fortune 100 companies in a variety of industries. The role will have you coordinating in a cross-team style to provide best-in-class support within a dynamic environment, working with cutting edge technology,</p><p><strong>Responsibilities</strong></p><ul><li class=\"ql-indent-1\">Responsible for first line support by helping to identify and resolve complex customer issues in a professional and in a timely manner through effective telephone, live chat and e-mail communication</li><li class=\"ql-indent-1\">Stage and test customer scenarios and applications for in-depth troubleshooting, root cause analysis and resolution</li><li class=\"ql-indent-1\">Promptly diagnose and troubleshoot issues for end-users, identifying solutions based on established processes and procedures</li><li class=\"ql-indent-1\">Work collectively to triage, distribute and escalate IT Support tickets</li><li class=\"ql-indent-1\">Manage customer relationships with attention to detail. Ability to clearly document interactions with clients within the support database</li><li class=\"ql-indent-1\">Provide comprehensive reporting of software defects and customer enhancement requests</li><li class=\"ql-indent-1\">Identify patterns and obstacles that affect productivity and raise awareness of such issues within Scope's Product and Engineering teams</li><li class=\"ql-indent-1\">Troubleshoot third party issues and escalate on customers behalf, if required</li><li class=\"ql-indent-1\">Authoring technical documents for inclusion in the Customer Center Knowledge Base</li><li class=\"ql-indent-1\">Play a significant role in the growth and development of our customer support competency</li></ul><p><strong>Requirements</strong></p><ul><li class=\"ql-indent-1\">Technical Bachelor's degree1-2 years’ experience in Technical Support</li><li class=\"ql-indent-1\">Hands-on experience with software testing and support</li><li class=\"ql-indent-1\">Knowledge of software development process, programming languages, networking, software quality concepts</li><li class=\"ql-indent-1\">Ability to build credibility &amp; strong internal/external relationships</li><li class=\"ql-indent-1\">Demonstrate mastery in follow-through and problem-solving</li><li class=\"ql-indent-1\">Outstanding written and verbal English communication and comprehension skills</li><li class=\"ql-indent-1\">Demonstrated ability to multi-task and work in a high-pressure environment with a mature and calm demeanour</li><li class=\"ql-indent-1\">Passion for learning new technology and best practices</li></ul><p><strong>Nice to Have</strong></p><ul><li class=\"ql-indent-1\">Experience with Zendesk and JIRA</li><li class=\"ql-indent-1\">Experience with Software support environments</li><li class=\"ql-indent-1\">Knowledge of Software Development Lifecycle</li></ul><p>We're growing our team quickly, so if you like solving hard problems, want to have real influence at work and have the skills listed above, we'd love to hear from you!</p><p></p>",
    "apply": "https://jobs.lever.co/scopear/50a7b619-b284-4f22-89e5-ebbc9208ec88",
    "company": "/companies/scope-ar",
    "cName": "Scope AR",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Success Operations",
    "description": "<p></p><p>Blend is a diverse team of problem solvers who believe that the world’s financial resources should be more accessible. Our cloud banking platform is used by Wells Fargo, U.S. Bank, and over 330 other financial services firms to acquire more customers, increase productivity, and deliver end-to-end digital experiences. Our software enables our customers to process an average of more than $5 billion in loans per day, making it possible for consumers to reach their financial goals faster and lead better lives. Come do work that matters.</p><p>The health and safety of our team is our top priority. As such, all employees working in the U.S. whose positions involve in-person interaction with other employees or third parties are required to be fully vaccinated for COVID-19. More details will be shared during the recruiting process.</p><p><strong>Whether this is an in office or remote first role, the position will require proof of vaccination unless Blend grants you an exemption.</strong></p><p>As a member of the Customer Success Operations &amp; Analytics team at Blend you will help drive key internal initiatives. You’ll be focused on efforts ranging from business process evaluations with our internal customers to internal system evaluation and delivery. In this role you will interface both with internal leadership, stakeholders, and third party vendors to deliver key outcomes and insights.</p><p><strong>How you'll contribute:</strong></p><ul><li>Develop and operationalize metrics that track Professional Services, Solutions Engineering and Integrations team performance</li><li>Build reporting and dashboards in analytical tools (e.g., Mode, Tableau) and Salesforce to provide leadership insight into business health and risk</li><li>Meet regularly with senior leaders to provide additional insight into the business and improvement opportunities, beyond what is already available in self service dashboards</li><li>Manage special projects from deep analytical reviews to system implementations that evolve our customer success functions</li><li>Own the processes that connect Sales to Solutions Engineering, Professional Services (inc. Integrations), and Support, and subsequently transition live customers to long term account management</li><li>Co-develop systems that support operational processes with our technical Business Systems team</li><li>Support annual planning on behalf of the Head of Customer Success, working closely with Finance to inform key assumptions and connect those to operational goals for each function</li><li>Regularly audit data to uncover integrity issues and/or opportunities for process improvement</li><li>Own processes to improve data hygiene and reporting to improve data accuracy</li></ul><p><strong>Who you are:</strong></p><ul><li>2+ years experience at a high growth Saas company or in management consulting</li><li>Strong SQL skills; Salesforce reporting experience a bonus</li><li>Outstanding communication, team work, project management skills</li><li>Ability to prioritize and juggle multiple competing tasks and projects</li></ul><p><strong>Benefits and Perks:&nbsp;</strong></p><ul><li>Meaningful equity and a 401(k) plan</li><li>Comprehensive health benefits</li><li>Wellness benefits covering a variety of wellness activities, gym memberships, fitness classes and more</li><li>Daily meal stipend during COVID-19 (lunch, dinner, snacks, and Pizza Fridays when working from the office)</li><li>16 weeks of paid parental leave</li><li>Generous vacation policy, company-wide mental health days during COVID-19</li><li>Work from home office set up stipend and internet stipend during COVID-19</li></ul><p>Blend is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We will consider for employment all qualified applicants with arrest and conviction records in a manner consistent with applicable laws.</p><p><a href=\"https://blend.com/company/careers/notice-at-collection-for-california-applicants/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 89, 255);\">Notice at Collection for California Applicants&nbsp;</a></p><p>If you have a disability and you wish to discuss potential accommodations related to applying for employment, please contact Blend at (650) 550-4810 or&nbsp;<a href=\"mailto:hraccessibility@blend.com%20\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 89, 255);\">hraccessibility@blend.com</a>.</p><p></p>",
    "apply": "https://blend.com/company/careers/opening/",
    "company": "/companies/blend",
    "cName": "Blend",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "International Accounting Manager",
    "description": "<p></p><p>We’re looking for an&nbsp;<strong>Accounting Manager</strong>&nbsp;to help the International Controller manage, develop, and scale our international accounting function at Grafana. In this role, you’ll&nbsp;be assisting with the entries and processes of the international accounting function while helping build Grafana’s Finance function for the future. A successful candidate should be comfortable with a fast-paced, dynamic, ambiguous environment, effectively manage multiple competing priorities, and demonstrate high-quality judgment. If you are a quick learner who can think analytically while staying organized, paying attention to details and diving deep when needed, then this opportunity is for you.</p><p>This position will report to our International Controller and has the opportunity to work remotely. We’re looking for someone to join our team immediately.</p><p><strong>Responsibilities:&nbsp;</strong></p><ul><li>Own transactional accounting for areas such as bank and credit card transactions, AP, payroll entry, and expense reporting, with an emphasis on processes to streamline the work as the company grows.</li><li>Lead efforts for accounting policy and process documentation.</li><li>Work on finance operations including: reporting, general ledger accounting, accounts payable, tax preparation and internal/external audit for international subsidiaries.</li><li>Prepare timely monthly &amp; quarterly financial statements and own/participate in month end close process.</li><li>Have input on and help implement accounting policies and financial controls related to spending authorizations, cash management and balance sheet reconciliations.</li><li>Maintain and enhance financial system integrity through data clean-up, process improvements and system feature/capability upgrades.</li><li>Entering journals with a view of constant streamlining and improvements.</li><li>Assist with detailed-oriented projects such as accounting system implementations, business process improvements and reporting and operational enforcement of policies, and procedures, and internal controls</li><li>Drive short-term process improvements with an eye toward longer term finance transformation improvements</li><li>Participate in evaluation of potential new systems, specifically regarding procure-to-pay and intercompany modules</li><li>Evaluate and implement SOX 404 controls to accounting policies and procedures</li></ul><p><strong>Requirements:</strong></p><ul><li>4+ years accounting experience, preferably in a fast paced startup environment.&nbsp;</li><li>Experience of transactional full-cycle general ledger, accounts payable, journals including processing disbursements;</li><li>Experience driving transformation and efficiencies in controls and accounting systems;</li><li>Experience in month-end and year-end close process including annual statutory audit;</li><li>Strong problem solving and analytical skills with a data-driven mindset</li><li>Excellent written and verbal communication skills</li><li>Strong analytical skills</li><li>Working knowledge of US GAAP accounting principles and processes</li><li>Intermediate to Advanced Microsoft Excel skills (i.e., pivot tables, data analysis, and formula creation)</li><li>Strong relationship skills with the ability to foster a sense of community with internal and external stakeholders</li></ul><p><strong>About Grafana Labs:&nbsp;</strong>There are more than 900,000 active installations of Grafana around the globe, monitoring everything from beehives to climate change in the Alps. The instantly recognizable dashboards have been spotted everywhere from a SpaceX launch and Minecraft HQ to Wimbledon and the Tour de France. Grafana Labs also helps companies including Bloomberg, JPMorgan Chase, and eBay manage their observability strategies with full-stack offerings that can be run fully managed with Grafana Cloud, or self-managed with Grafana Enterprise Stack. The Grafana stack has grown to include&nbsp;three<strong>&nbsp;</strong>other open-source projects, Grafana Loki (for logs), Grafana Mimir (for metrics),&nbsp;and Grafana Tempo (for traces).</p><p><strong>Benefits:&nbsp;</strong>For more information about the perks and benefits of working at Grafana, please check out our&nbsp;<a href=\"https://grafana.com/about/careers/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">careers page</a>.</p><p><strong>A note about covid-19:</strong>&nbsp;All Grafanistas who wish to attend in-person events or travel for Grafana Labs must be fully-vaccinated.</p><p><strong>Equal Opportunity Employer:</strong>&nbsp;At Grafana Labs we’re building a company where a diverse mix of talented people want to come, stay, and do their best work. We know that our company runs on the hard work and the dedication of our passionate and creative employees.</p><p>We will recruit, train, compensate and promote regardless of race, religion, colour, national origin, gender, disability, age, veteran status, and all the other fascinating characteristics that make us different and unique. We believe that equality and diversity builds a strong organisation and we’re working hard to make sure that’s the foundation of our organisation as we grow.</p><p><em>For information about how your personal data is used once you’ve applied to a job, check out our&nbsp;</em><a href=\"https://grafana.com/legal/applicant-and-candidate-privacy-policy/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\"><em>privacy policy</em></a><em>.&nbsp;</em></p><p></p>",
    "apply": "https://boards.greenhouse.io/grafanalabs/jobs/4529404004",
    "company": "/companies/grafana-labs",
    "cName": "Grafana Labs",
    "location": "Remote",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Accounts Receivable Specialist",
    "description": "<p></p><p>This remote based position will be a key member of GoPuff’s Accounts receivable, and revenue accounting team, reporting to the Revenue Accounting Manager, and supervised by the Senior Revenue Accountant. You’ll have the opportunity to experience and participate in growth scaling process improvements and implementations.</p><p><a href=\"http://implementations.the/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">The</a>&nbsp;role responsibilities involve the credit and collections activities, external customer service and overall support order to cash cycle activities. The right candidate enjoys working in a fast-paced environment, works well within a team, has a customer service mindset, and enjoys problem-solving.</p><p><strong>Responsibilities</strong></p><ul><li class=\"ql-indent-1\">Timely processing of invoice receipts and deposit items; to include researching and resolving payment discrepancies.</li><li class=\"ql-indent-1\">Carry out collections and reporting activities on past due payments, maintaining customer account records and documentation.</li><li class=\"ql-indent-1\">Process billing adjustments and maintaining documentation.</li><li class=\"ql-indent-1\">Provide support to general ledger accounting activities such as reconciliations and preparation of aging reports.</li><li class=\"ql-indent-1\">Work both independently and in a team environment to investigate and resolve customer inquiries, communicating with customers via email and phone.</li><li class=\"ql-indent-1\">Assists with audits for AR-related matters and supports Internal and External Auditor requests.</li></ul><p><strong>Qualifications</strong></p><ul><li class=\"ql-indent-1\">Bachelor’s degree in a related field.</li><li class=\"ql-indent-1\">Minimum +2 years’ experience with order to cash cycles and relating general ledger accounts activities..</li><li class=\"ql-indent-1\">Experience with AR inbox management and external customer service.</li><li class=\"ql-indent-1\">Knowledge and experience with Account Payables for cross-function activities is preferred but not required.</li><li class=\"ql-indent-1\">Ability to perform multiple tasks simultaneously, work effectively in a team environment and meet deadlines.</li><li class=\"ql-indent-1\">Excellent attention to detail, organized and creative problem-solving skills.</li><li class=\"ql-indent-1\">Strong communication skills - verbal and written.&nbsp;&nbsp;</li></ul><p><strong>Benefits</strong></p><p>We want to help our employees stay safe and healthy! We offer comprehensive medical, dental, and vision insurance, optional FSAs and HSA plans, 401k, commuter benefits, supplemental employee, spouse and child life insurance to all eligible employees.</p><p><strong><em>We also offer:</em></strong></p><p><em>-Gopuff employee discount</em></p><p><em>-Career growth opportunities</em></p><p><em>-Internal rewards programs</em></p><p><em>-Annual performance appraisal and bonus</em></p><p>At Gopuff, we know that life can be unpredictable.&nbsp;Sometimes you forget the milk at the store, run out of pet food for Fido, or just really need ice cream at 11 pm. We get it—stuff happens. But that’s where we come in, delivering all your wants and needs in just minutes.</p><p>And now, we’re assembling a team of motivated people to help us drive forward that vision to bring a new age of convenience and predictability to an unpredictable world.</p><p><strong>Like what you’re hearing? Then join us on Team Blue.</strong></p><p><em>Gopuff is an equal employment opportunity employer, committed to an inclusive workplace where we do not discriminate on the basis of race, sex, gender, national origin, religion, sexual orientation, gender identity, marital or familial status, age, ancestry, disability, genetic information, or any other characteristic protected by applicable laws. We believe in diversity and encourage any qualified individual to apply.</em></p><p></p>",
    "apply": "https://jobs.lever.co/gopuff/1b9333fc-33b3-4d7d-a3f8-b99b68bd2480",
    "company": "/companies/gopuff",
    "cName": "Gopuff",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Senior Billing Specialist",
    "description": "<p></p><p>We’re looking for an enthusiastic and detail-oriented Senior Billing Specialist to join our global finance team to assist with our customer invoicing, including our rapidly expanding marketplace billing. The position requires a well-rounded individual with demonstrated ability to deliver results in a high-growth, dynamic environment.&nbsp;&nbsp;</p><p>You will be experienced with customer billing, and all its technicalities and nuances. You’ll use that knowledge to assist Snyk with the implementation of Zone billing and the related integrations between Salesforce and NetSuite.&nbsp;The role will liaison closely with our internal sales operations team, as well as externally with our customer contacts.&nbsp;You will be a key partner in ensuring a strong environment of internal controls is documented and maintained in the billing and collections cycle.&nbsp;</p><p><strong>You’ll spend your time:</strong></p><ul><li>maintaining customer files associated with invoices to ensure accurate billing</li><li>assisting with meeting deadlines related to billing and related reporting</li><li>ensuring that sales tax exemptions are properly documented and billed appropriately</li><li>responding to client and internal queries regarding billing&nbsp;</li><li>adjusting any issues in billing records and issuing invoice revisions and credit notes as needed</li><li>proactively escalating issues that require intervention or clarification to management</li><li>working collaboratively and cross-functionally with other team members</li><li>preparing ad-hoc reporting and KPI metric tracking</li></ul><p><strong>You should apply if you:</strong></p><ul><li>hold a bachelor’s degree in accounting, finance or a related field</li><li>have 3-5 years of experience in customer billing with:</li><li class=\"ql-indent-1\">salesforce, zone billing subscriptions, and/or netsuite</li><li class=\"ql-indent-1\">a SaaS company in the cybersecurity or information technology sector</li><li>are experienced in working with external marketplace billing and reporting for entities such as:</li><li class=\"ql-indent-1\">Amazon Web Services&nbsp;</li><li class=\"ql-indent-1\">Google Cloud Marketplace</li><li class=\"ql-indent-1\">Microsoft Azure</li><li>have a thorough understanding of the accounting entries behind the cash application and deposit cycles</li><li>thoroughly understand the applicable SOX controls related to the billing and collections cycles</li><li>are open to work shifts that may overlap with US time zones as needed during critical close periods (month and quarter end)</li><li>possess excellent excel skills including Pivot tables and VLookup</li><li>can confidently&nbsp;run customer-facing communications and have a strong command on the English language</li><li>pride yourself for your attention to detail, thoroughness and ability to make continuous improvements in the business</li><li>adapt quickly to change in a dynamic organizational structure and business</li><li>work both independently and as a strong team player</li><li>regularly meet your tight deadlines&nbsp;</li><li>are excellent at building relationships cross-functionally across the organization</li></ul><p><strong>We’d especially love to hear from you if you:</strong></p><ul><li>Are versatile, analytical, motivated, creative, intellectually curious, and a strong communicator/collaborator</li><li>thrive on the challenge and pace of a rapidly growing enterprise</li></ul><p><strong>Interested?</strong></p><p>Please apply below! We care deeply about the warm, inclusive environment we’ve created and we value diversity - we welcome applications from those typically underrepresented in tech. If you like the sound of this role, but are not totally sure whether you’re the right person, do apply&nbsp;<em>anyway</em>&nbsp;:)</p><p><strong>About Snyk</strong></p><p>Snyk is the leader in developer security. We empower the world's developers to build secure applications and equip security teams to meet the demands of the digital world. Our developer-first approach ensures organizations can secure all of the critical components of their applications from code to cloud, leading to increased developer productivity, revenue growth, customer satisfaction, cost savings and an overall improved security posture.&nbsp;</p><p>At Snyk, we envision an inclusive technology industry powering a more sustainable and secure world.&nbsp;Since our founding, Snykers have cared deeply for one another and the developer and security communities as well as the larger world around us. Learn more about our Snyk Impact social and environmental mission and take action with us&nbsp;<a href=\"https://snyk.io/about/snyk-impact/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(75, 69, 169);\">here.</a></p><p>Snyk's Developer Security Platform automatically integrates with a developer's workflow and is purpose-built for security teams to collaborate with their development teams. Snyk is used by 1,200 customers worldwide today, including industry leaders such as Asurion, Google, Intuit, MongoDB, New Relic, Revolut and Salesforce.</p><p>Snyk is recognized on the&nbsp;<a href=\"https://www.forbes.com/cloud100/#6f24b5ba5f94\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(75, 69, 169);\">Forbes Cloud 100 2021</a>, the&nbsp;<a href=\"https://www.cnbc.com/2021/05/25/these-are-the-2021-cnbc-disruptor-50-companies.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(75, 69, 169);\">2021 CNBC Disruptor 50</a>&nbsp;and was named a Visionary in the<a href=\"https://snyk.io/blog/snyk-visionary-2021-gartner-magic-quadrant-for-ast/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(75, 69, 169);\">&nbsp;2021 Gartner Magic Quadrant for AST</a>.</p><p></p>",
    "apply": "https://boards.greenhouse.io/snyk/jobs/6158040002",
    "company": "/companies/snyk",
    "cName": "Snyk",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Associate Contract Administrator",
    "description": "<p></p><p><strong>Overview</strong></p><p>This role is responsible for managing the administration of all contract activity between the company and its vendors, customers, and partners.</p><p><strong>What you will be doing</strong></p><ul><li>Oversee the development and execution of basic contracts for customers, vendors and partners</li><li>Act as a liaison between internal and external customers to efficiently drive the contract review and approval process to conclusion</li><li>Work under the direct supervision of team members and staff attorneys and compose draft contract documents</li><li>Work with business stakeholders to determine business terms of contracts; work as liaison between internal and external parties to negotiate business terms of contracts</li><li>Maintain internal documentation on contract processes</li><li>Review contract performance to ensure compliance with contractual obligations; identify contract noncompliance and escalate issues to team members</li><li>Assist team members in updating and maintaining contract templates</li><li>Develop professional and dependable relationships with both internal and external customers</li><li>Grow knowledge and be aware of best practices and market trends</li><li>Assist with special projects, as assigned</li><li>Comply with all corporate and departmental privacy and data security policies and practices, including but not limited to, Hyland’s Information Systems Security Policy</li></ul><p><strong>What will make you successful</strong></p><ul><li>High School diploma</li><li>Preferred language experience; French, Spanish, German etc.</li><li>Proficient with Microsoft Office</li><li>Solid critical thinking and problem solving skills</li><li>Good oral and written communications skills that demonstrate a professional demeanor and the ability to interact with others with discretion and tact</li><li>Solid collaborative skills, applied successfully within team as well as with other areas</li><li>Sound business and technology acumen</li><li>Demonstrated ability to handle confidential and sensitive information with integrity, discretion and tact</li><li>Up to 5% travel time required</li><li>Or an equivalent combination of education and experience sufficient to successfully perform the principal duties of the job</li></ul><p>Based on Colorado law, the following details are for Colorado individuals only: Colorado base salary range: $51,000 - $57,000 and eligible for bonus and benefits.</p><p><strong>What you can expect next</strong></p><ul><li>Hyland Recruiters thoroughly review every application and will contact you within 1 to 2 weeks regarding next steps. Be sure to add Hyland to your contacts list and check your spam folder so you never miss a message from us!</li><li>Any follow up questions? Email your Recruiter directly at&nbsp;<a href=\"mailto:Careers@Hyland.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">Careers@Hyland.com</a>.</li></ul><p><strong>Benefits</strong></p><p>401(k) Retirement Savings. Flexible Schedule. Paid Time Off. Medical, Dental, Vision. Volunteer Paid Time Off. Wellness Reimbursement. Paid Parental Leave. Sabbatical Program. Hyland House Program.</p><p>Find out more by going to&nbsp;<a href=\"https://www.hyland.com/en/careers/life-at-hyland\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">https://www.hyland.com/en/careers/life-at-hyland</a>.</p><p><strong>Welcome to&nbsp;</strong><a href=\"https://www.instagram.com/hylandgram\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\"><strong>#HylandLife</strong></a></p><p>Since 1991, it has been Hyland’s mission to help our employees, customers and partners exceed their potential with our industry-leading&nbsp;<a href=\"https://www.hyland.com/en/platform\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">content services platform</a>. Our employees exude a contagious energy and are passionate about what they do – whether it’s helping customers succeed, raising up their fellow Hylanders, or engaging in the communities where they live and work.</p><p>The #HylandLife hashtag encompasses our employee-centric culture. Our employees live our culture day in and day out by bringing their best self to work. Hyland supports them to do just that through career development resources, wellbeing programs and innovation practices. We thrive on diverse viewpoints and new ideas and believe that a positive, inclusive workplace is imperative to sustainable success.</p><p>As we’ve grown to a company of nearly 4,000 strong, we have the opportunity to&nbsp;<a href=\"https://www.hyland.com/en/company/corporate-responsibility\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">make a significant impact on our communities</a>. We strongly support employee initiatives and align our giving campaigns and programs to organizations that are important to them.</p><p>We are committed to a policy of Equal Employment Opportunity and will not discriminate against an applicant or employee on the basis of race, color, religion, creed, national origin or ancestry, sex, age, physical or mental disability, veteran or military status, genetic information, sexual orientation, marital status, or any other legally recognized protected basis under federal, state or local laws, regulations or ordinances. The information collected by this application is solely to determine suitability for employment, verify identity and maintain employment statistics on applicants.</p><p></p>",
    "apply": "https://careers-hyland.icims.com/jobs/9691/associate-contract-administrator/job",
    "company": "/companies/hyland",
    "cName": "Hyland",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Senior Legal Analyst",
    "description": "<p></p><p><strong>Job Description</strong></p><p>Symetra Investment Management has an excellent opportunity to join our legal team as a&nbsp;<strong>Senior Legal Analyst</strong>!</p><p><strong>About the role</strong></p><p>The Senior Legal Analyst will be responsible for providing closings, regulatory filings and contract management support for our growing commercial mortgage loan area.</p><p><strong>What you will do</strong></p><ul><li>Help drive our commercial mortgage loan closing process</li><li class=\"ql-indent-1\">Drive state licensing and renewals</li><li class=\"ql-indent-1\">Assist counsel in negotiating and conducting loan negotiations, closings and mortgage modifications</li><li class=\"ql-indent-1\">Review and negotiate SNDAs, tenant estoppel certificates, confidentiality clauses and other ancillary loan servicing documents</li><li class=\"ql-indent-1\">Review application materials to confirm corporate authority</li><li class=\"ql-indent-1\">Conduct state law research</li><li class=\"ql-indent-1\">Regularly collaborate with business counterparts</li><li>Provide support to the Compliance area</li><li>Draft, proof read and edit materials routinely; draft complex professional memos, correspondence, and other legal documents; plus operating procedures as appropriate​</li><li>Independently handle file management, oversee organization of department documents database, organize file preparation of materials, and inputting case analysis and status reports</li><li>Draw conclusions for attorney to review and work with outside counsel independently to coordinate/facilitate work flow</li><li>Inform supervising attorney of status/concerns/ideas and, at highest level, suggests solutions that attorney implements</li><li>Review and analyze in greater depth bulletins, regulations, statutes, reports, and industry publications and is responsible for reviewing, researching and analyzing new federal and state laws as well as general issues plus has the capability of seeing how these laws/regulations impact products/procedures/compliance</li><li>Understand and keep abreast of legal developments including use of on-line research tools</li><li>May prepare budgets, spreadsheets, presentations and reports as necessary</li></ul><p><strong>Who you are</strong></p><ul><li>Requires 5 years in a law firm, corporate or regulated entity environment performing paralegal or equivalent duties focused on commercial mortgage lending law. Bachelor’s degree preferred but not required; paralegal certificate or equivalent work experience necessary</li><li>Two/Four year college degree or paralegal certificate preferred</li><li>Good to excellent judgment, works independently</li><li>Good to excellent attention to detail, communication (written and oral) and interpersonal skill</li><li>Possesses skills to analyze and organize complex legal issues</li><li>Masters knowledge of insurance and financial services business/operations</li><li>Ability to work with complex legal issues, coupled with an understanding of how these work in conjunction with insurance</li></ul><p><strong>Requirements</strong></p><p><strong>What we offer you</strong></p><p>We don’t take a “one-size-fits-all” approach when it comes to our employees. Our programs are designed to make your life better—both at work and at home.</p><ul><li>Flexible work program and telecommute arrangements</li><li>Wellness program offering employees a variety of resources crafted to assist you in reaching and maintaining your optimum health</li><li>Plan for your future with our 401(k) plan and take advantage of immediate vesting and company matching up to 6%</li><li>Paid time away including vacation and sick time, flex days and ten paid holidays</li><li>Give back to your community and double your impact through our company matching</li></ul><p>Want more details? Check out our&nbsp;<a href=\"https://www.symetra.com/globalassets/documents/web/hr/hr_0022.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 125, 195);\"><strong>Symetra Benefits Overviewopens a pdf file</strong></a></p><p>Salary Range: $71,700 – $119,500 plus eligibility for bonus program</p><p><strong>We empower inclusion</strong></p><p>At Symetra, we embrace and celebrate diverse experiences, identities and perspectives, because lifting each other up fuels thought and creates a stronger, more innovative company. Learn more&nbsp;<a href=\"https://www.symetra.com/about-us/about-symetra/diversity-equity-and-inclusion/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 125, 195);\"><strong>here.</strong></a></p><p><strong>In a complex industry, we strive for clarity.</strong></p><p>Symetra is a dynamic and growing financial services company with 60 years of experience and customers nationwide. In our daily work delivering retirement, employee benefits, and life insurance products, we're guided by the principles of VALUE, TRANSPARENCY AND SUSTAINABILITY. That means we provide products and services people need at a competitive price, we communicate clearly and honestly so people understand what they're getting, and we build products that stand the test of time. We work hard and do what's right for our customers, communities and employees. Join our team and share in our success as we work toward becoming the next national player in our industry.</p><p>For more information about our careers visit&nbsp;<a href=\"http://www.symetra.com/careers\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 125, 195);\"><strong>www.symetra.com/careers</strong></a>.</p><p></p>",
    "apply": "https://recruiting.adp.com/srccar/public/RTI.home",
    "company": "/companies/symetra",
    "cName": "Symetra",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Social Media Manager",
    "description": "<p></p><p><strong>What is Canonical</strong></p><p>Canonical is the global open source solutions provider and the publisher of Ubuntu. Since 2004 Canonical has led the way in providing free open source software solutions has created, putting innovation in the hands of everyone. Our portfolio of solutions are designed to support enterprises to innovate from the data centre to the edge; leading the way in cloud infrastructure, advanced robotics, enabling AI, blockchain, autonomous cars and smart things. We are proud to support the critical infrastructure and operations for thousands of businesses and millions of Ubuntu users around the world including AT&amp;T, Bloomberg, Netflix, Paypal, Sky, Slack, Spotify and Tmobile.</p><p>We seek to have a positive impact on the global IT community and support new and innovative development for the companies we work with and the communities in which we work. As a truly global company with more than 800 employees in over 39 countries, and 10 offices we offer a collaborative and open work environment where people are valued for their unique talents and empowered to do their jobs well.&nbsp;</p><p>The marketing team at Canonical drives commercial outcomes for the company across its portfolio of products and grows the addressable market through digital marketing campaigns, lifecycle management, events, partnerships and community development. If these things are important to you and you're driven by driving growth, delighting customers and filling the sales funnel, we want to talk with you.</p><p><strong>Job Summary:</strong></p><p>We’re on the look out for a brilliant Social Media Manager to join our team and take our communications to the next level. Our social media provides a window between the people who make our products and those who use them. With audiences in the millions, our online communities have the opportunity to talk to us, engage with us, provide feedback and be involved in the world of Ubuntu. From #opensource to coffee on Kubernetes, launch previews to twitter storms over some cool release swag, our marketing team is committed to creating conversations with audiences all over planet earth.</p><p>The ideal candidate is passionate about technology, technology marketing and the use of technology in marketing. They prefer to work in an environment that emphasises ownership of campaigns, collaboration, learning, curiosity and a drive to continually improve oneself / the team / the organisation. They love to problem solve, get hands-on, experiment, measure and use automation to make daily life easier.</p><p><strong>As a social media manager you will:</strong></p><ul><li>Be responsible for developing and managing social media strategy and advising our community development team.</li><li>Deliver regular reporting and analysis, setting KPIs and driving results</li><li>Identify all the approachable and hottest social and community resources relevant to our target audiences.</li><li>Create, schedule and publish content across multiple social media channels ensuring alignment with the broader marketing, campaigns and editorial plans</li><li>Ensure we’re capitalising on social listening insights, regularly sharing with the team and wider business</li><li>Use your platform knowledge and creative skills to create boundary-pushing, attention-grabbing social content using the latest affordances on each channel.</li><li>Be engaging, funny, responsive and of the moment to create viral and shareable moments.</li><li>Bring all of Canonical’s product offering to life creatively, from bare metal, AI, Kubernetes… to chats on diversity and CSR.</li><li>Calmly and carefully deal with customer and tech issues, if needed ensuring any problems are dealt with deftly and swiftly, including out of hours, as well as providing training and support for our customer experience</li><li>Your daily routine will consist of media planning, copywriting, content management (texts, pictures, videos) and tracking the efficiency</li></ul><p><strong>The successful social media manager will have:</strong></p><ul><li>At least three years experience in social specific roles or roles with social responsibilities, ideally where you’ve played a role in delivering integrated campaigns</li><li>You’ll have experience with social management and listening tools, as well as an understanding of tools such as Google Analytics.</li><li>You are both highly creative and meticulously analytical – you know which content works on each channel.</li><li>A confident and creative copywriter, you’ll be adept at crafting posts that develop the brand and its personality, as well as able to transform even the driest of statistics into something fascinating.</li><li>Experience building and delivering advocacy programs with tangible results</li><li>Exceptional interpersonal skills and aptitude for forging trusting relationships across diverse, cross-functional teams</li><li>Excellent verbal and written communication skills, strong content marketer</li><li>Proven ability to prioritise and differentiate what matters from the noise, meeting deadlines without sacrificing quality</li><li>Growth mindset - someone who is not afraid to think big and take on risks.</li></ul><p><strong>What Canonical Offers:</strong></p><ul><li>Learning and Development</li><li>Annual Compensation Review</li><li>Recognition Rewards</li><li>Annual Leave</li><li>Priority Pass for travel</li><li>Flexible working option</li></ul><p>Canonical believes a diverse workforce enhances our ability to deliver world class software and services which meet the world’s computing needs. We are committed to ensuring equal employment opportunities to all qualified individuals. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p><p><em>We are proud to foster a workplace free from discrimination. We truly believe that diversity of experience, perspectives and background will lead to a better environment for our employees and a better platform for our users and customers. This is something we value deeply and we encourage everyone to come be a part of the world of Ubuntu.</em></p><p>#LI-Remote</p><p>#SP</p><p></p>",
    "apply": "https://boards.greenhouse.io/canonical/jobs/3769747",
    "company": "/companies/canonical",
    "cName": "Canonical",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Marketing Operations Manager",
    "description": "<p></p><p>Chili Piper is a B2B SaaS startup. Our product helps clients turn inbound leads into qualified meetings instantly, helping revenue teams connect to buyers faster.</p><p>Think Calendly. Except way better. Way more powerful. And with customers like RingCentral, Airbnb, Square, Intuit, Spotify, Twilio, and many other cool logos.</p><p>We’re growing fast. And we don’t mean that in the cliche way. We are sitting on a fresh round of funding, and are ready to take over the world (in the most civil and appropriate way possible, of course).</p><p><strong>Job Description</strong></p><p>As a Marketing Operations Manager, you will report directly to the Head of Demand Generation and be responsible for driving insights to inform key business decisions. You will be responsible for the management, and cross departmental collaboration, of the marketing technology stack, tools, and relevant integrations. These include but are not limited to:</p><ul><li>Salesforce CRM</li><li>HubSpot MAP</li><li>Metadata.io</li><li>Google Analytics</li><li>Google Tag Manager</li><li>Hotjar</li><li>Webflow</li><li>Google Optimize</li><li>Mode</li><li>Salesloft</li><li>Sendoso</li><li>Uberflip</li><li>Zoominfo</li><li>Clearbit</li><li>Chili Piper</li></ul><p>You'll work closely with Marketing Leadership, Revenue Operations, and Sales leaders to support marketing’s cross-functional GTM team. You will partner closely with the Demand Generation, Field Marketing, Customer Marketing and SDR teams to provide insights to improve pipeline velocity and conversion rates based on data and analytics. TLDR; You’ll recommend new systems and outline workflow processes to increase the scalability and efficiency of the marketing organization.</p><p><strong><em>What You'll Do</em></strong>&nbsp;</p><ul><li><strong>MAP Ownership:</strong>&nbsp;Be responsible for the end-to-end ownership and management of the marketing technology stack, tools, and relevant integrations.</li><li><strong>Data-driven Optimization:</strong>&nbsp;Analyze marketing and sales data to develop insights and make recommendations on areas for optimization and changes to strategy.</li><li><strong>Strategic Planning and Execution:</strong>&nbsp;Work with the marketing team on campaign execution, including list sourcing, segmentation, and post-campaign analysis.</li><li><strong>Lead Routing:</strong>&nbsp;Partner closely with sales leadership and operations to stand up, continually improve, and refine lead scoring, lead flow process, and ensure optimal flow through the lead lifecycle leveraging Distro.</li><li><strong>Customer Marketing:</strong>&nbsp;Build out the foundational marketing operations processes to support customer marketing efforts. Including building out our customer scoring model and supporting our new referral program.</li><li><strong>Multi-touch attribution and reporting:&nbsp;</strong>Build dashboards and continuously monitor marketing KPIs, campaign performance, pipeline, HubSpot administration, and revenue attribution</li><li><strong>Partner with Marketing Leadership:&nbsp;</strong>Support creation of measurement framework to assist with spend allocation decisions, campaign execution, and internal storytelling</li><li><strong>Reporting:</strong>&nbsp;Work with marketing leadership to support reporting needs across the team</li><li><strong>Compliance:</strong>&nbsp;Serve as the POC for marketing compliance and governance (GDPR, CCPA, and other privacy acts)</li></ul><p><strong>Qualifications</strong></p><p><strong><em>What We're Looking For</em></strong></p><ul><li>Minimum 3 years experience in Marketing, Operations, Strategy Consulting, Business Operations - including 2 years in B2B SaaS</li><li>2+ years experience setting up, integrating, and optimizing Salesforce CRM</li><li>Incredibly process-oriented and organized; strong project management skills and time management</li><li>Ability to communicate the right level of information to executives and cross-functional teams at the right cadence.</li><li>Willingness to collaborate with our content team to share ops insights and learnings (we’re strong believers in marketing in public!)</li><li>Analytically minded - uses data to make decisions; experience with SQL or data visualization platforms (like Mode) is a bonus</li><li>Experience automating successful marketing strategies through technology and general fluency in marketing tech stacks</li><li>Experience creating and implementing a lead scoring process (customer scoring is a bonus)</li><li>Demonstrates ownership, resourcefulness, flexibility, willingness, and patience necessary to lead and adapt within a hyper-growth company and industry</li></ul><p><strong><em>Additional Skills</em></strong>&nbsp;</p><p>Passion for Chili Piper Values of Help, Innovate, Have Fun</p><p><strong>Additional Information</strong></p><p><strong><em>How We Work</em></strong></p><p><strong>Freedom and flexibility.</strong>&nbsp;We’re a 100% distributed team working from around the world.&nbsp;<strong><em><u>Our team members can work from wherever they want</u></em></strong>&nbsp;in the world, as long as they show up on our weekly all hands meeting on Zoom.</p><p><strong>Solve interesting problems.</strong>&nbsp;The software landscape has exploded. There are dozens of solutions for each problem. We want to be different. We come up with new angles on existing problems or invent better solutions to help companies with their sales and marketing. Then we turn these ideas into beautiful, smart software.</p><p><strong>Autonomy and ownership.</strong>&nbsp;Working on a distributed team means you don’t have someone micromanaging you or looking over your shoulder to make sure you’re getting things done. We’re a team of do-ers who take full ownership for their results.</p><p><strong>Be helpful.</strong>&nbsp;Our first value as a company is help. Help our customers be successful. Help our prospects get the right information and make the right decision whether or not it includes our products. Help our team members reach their full potential.</p><p><strong><em>The Perks</em></strong></p><p>Unlimited Vacation</p><p>50% Women in leadership at Chili Piper</p><p>Generous Health, Dental, and Vision Insurance</p><p>WeWork membership so you can work from anywhere</p><p>Any equipment/software/tech that you need to do your jo</p><p></p>",
    "apply": "https://boards.greenhouse.io/chilipiper/jobs/5136947003",
    "company": "/companies/chili-piper",
    "cName": "Chili Piper",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Social Media Manager",
    "description": "<p></p><p>Are you the kind of person who not only loves scrolling through your feeds, but has an eye for identifying and appreciating trends&nbsp;<em>and</em>&nbsp;a proven track record of social media impact? If so, we want to hear from you! Evernote is looking for a social media manager who is equal parts creative, analytical, Internet-obsessed, and collaborative.&nbsp;</p><h4><strong>About the Role</strong></h4><p>We’re looking for a social media superstar to grow, inspire, and engage the Evernote community, building awareness, excitement, and loyalty for our brand and everything you can accomplish with Evernote. If you value strategy, work creatively, have a passion for crafting compelling content, and if you love working with an amazing team in a dynamic environment, this will be a perfect fit.</p><p>Reporting to the Director of Content Marketing &amp; Strategy, you will help represent the voice of Evernote to our social audience, including current and future users, the Evernote Expert community, and members of the Notable Herd (our employees!) across Instagram, LinkedIn, Twitter, Facebook, and TikTok.</p><p>You will conceptualize, create, and post social media content, report on vital metrics, manage the social media calendar, and engage with users from behind our @evernote handles. You will deliver a qualitative strategy that's creatively driven, with the ability to pivot completely or jump on emerging trends at a moment's notice. You will adapt existing content for social channels and pitch your own ideas for new social-first initiatives to support our company goals.</p><h4><strong>What you’ll do</strong></h4><ul><li>Work with the Director of Content Marketing and Strategy and other key members of the marketing team to develop evergreen, product-specific, and campaign-related social content&nbsp;</li><li>Conceptualize, create, and post social media content to drive brand and product awareness, including writing captions and comments in the Evernote voice and designing brand-aligned visual assets (working with our in-house creative studio as needed)</li><li>Set key performance indicators (KPIs) for social media campaigns, such as target numbers for engagement rate, follower growth, impressions, likes, and shares, then measure and report on campaign performance&nbsp;</li><li>Work with our Content, Community, Product Marketing, and Customer Marketing teams to discover, curate and share compelling stories about our brand and community; identify opportunities to amplify content across various social media</li><li>Assist in the monitoring and amplification of our influencer marketing program, including paid creators, our Evernote Expert community, and organically earned content</li><li>Monitor vital metrics and data, surface insights, and report monthly on growth and performance across Evernote's social channels</li></ul><h4><strong>What you’ve done</strong></h4><ul><li>B.A./B.S. degree preferred, or equivalent experience</li><li>3-5+ years experience working in social media marketing</li><li>Experience creating social media content and strategies for building brand awareness and penetrating new audiences</li><li>Experience and knowledge of social media best practices, influencer marketing programs, and what makes for engaging content</li><li>Experience using marketing tools and platforms such as Sprinklr, Airtable, Later, Kochava, Google Analytics, Canva, and more</li></ul><h4><strong>Who you are</strong></h4><ul><li>A compelling storyteller who can weave together words, visuals, and numbers to create engaging social media content</li><li>A people person who works well with others and loves to collaborate cross-functionally</li><li>A creative spirit who stays on top of social trends and is always thinking one step ahead</li><li>Someone with exceptional project management skills and who knows how to stay on top of things and meet deadlines</li><li>Someone with the ability to think globally while acting locally — Evernote is a global company with users all across the world</li><li>Passionate about social media and the content we consume on a daily basis, you understand what separates the good from the phenomenal</li></ul><h4><strong>Bonus areas</strong></h4><ul><li>Interest in organization and productivity technology trends</li><li>TikTok aficionado</li><li>Prior experience in tech, product, SaaS, or consumer marketing</li></ul><p>We are committed to an inclusive and diverse Evernote. We believe that different perspectives lead to better ideas, and better ideas allow us to better understand the needs and interests of our diverse, global Evernote Community. We welcome people of different backgrounds, experiences, abilities and perspectives and are an equal opportunity employer.</p><p>California privacy notice: Read our privacy policy for job applicants&nbsp;<a href=\"https://evernote.com/privacy/job-applicants\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\">here</a></p><p></p>",
    "apply": "https://evernote.com/careers/job/",
    "company": "/companies/evernote",
    "cName": "Evernote",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Marketing Coordinator",
    "description": "<p></p><p><strong>Job Title:</strong></p><p>Marketing Coordinator</p><p><strong>Job Description</strong></p><p>Manage auxiliary programs, program-related deliverables and special projects assigned by Program Managers and management team. Responsible for executing, coordinating, researching and tracking project activities from concept to completion. This is a remote, work from home, position. There is no office to report into, however there will be some light travel involved in the future when it is safe to do so. Typically, we would like to have this position visit the client at least once per quarter in Orange County, California.</p><p>This role resides in the Marketing Solutions department where we specialize in retention and subscription marketing for automotive clients. Marketing Solutions operates like a typical agency, but without the volatility. This work we do is fast-paced with lots of client interaction and coordination between multiple teams. But we operate large scale “Programs,” not just individual projects – these programs are on 1 to 5 year contracts and we have client relationships that have lasted decades.</p><ul><li>Marketing Coordinator will be responsible for numerous tasks and deliverables including but not limited to:</li><li class=\"ql-indent-1\">Formulate and deliver project-related specifications including: quoting requirements, design and strategy documents, and imaging and production requirements</li><li class=\"ql-indent-1\">Use listening skills to translate various communications to detailed and concise dissemination of project-related information (agendas, meeting minutes, action register updates, conference notes, next steps)</li><li class=\"ql-indent-1\">Identify and escalate at-risk deliverables and action items to the appropriate level</li><li class=\"ql-indent-1\">Problem solves to reach workable solutions with little or no reinforcement (collecting, reviewing and routing information through proper channels)</li><li class=\"ql-indent-1\">Coordinate all project-related activities with a high level of accuracy; delivery must be on time and on target (project schedules, spec documents, quotes, approvals)</li><li class=\"ql-indent-1\">Lead end-to-end management and execution of elements of services within the base OEM program</li><li class=\"ql-indent-1\">Document processes and procedures to maximize success in the project execution phase</li><li class=\"ql-indent-1\">Track key performance indicators to determine budgets to actuals on internal and external costs to maintain quoted gross margins and profitability</li><li class=\"ql-indent-1\">Prioritize multi-program deliverables and mobilize teams to action: monitor and document progress and compromises while providing timely updates to management, Program Managers and team members</li><li class=\"ql-indent-1\">Analyze existing processes and procedures and identify deficiencies; participate in process improvement efforts</li><li class=\"ql-indent-1\">Review and update documentation to represent current state of the program; track changes and assess benefit or risk factors</li><li class=\"ql-indent-1\">Monitor deliverables from all resources for accuracy, efficiency and validity</li><li class=\"ql-indent-1\">Provides support to Program Managers and Product Development teams</li><li class=\"ql-indent-1\">May accompany Sales and Account Management on external client appointments and/or presentations to evaluate customer business requirements and clarify service offerings</li><li class=\"ql-indent-1\">Regularly contribute ideas, thoughts and solutions during client calls</li><li class=\"ql-indent-1\">May lead client calls and/or in person client meetings</li><li class=\"ql-indent-1\">Other duties as assigned</li></ul><p><strong>Location:</strong></p><p>USA, WI, Work-at-HomeLanguage Requirements:</p><p><strong>Time Type:</strong></p><p>Full time</p><p></p>",
    "apply": "https://jobs.concentrix.com/global/en/job/CONCGLOBALR1303330EXTERNALENGLOBAL/Marketing-Coordinator",
    "company": "/companies/concentrix",
    "cName": "Concentrix",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Marketing Associate",
    "description": "<p></p><p>CodeCombat is looking for a Marketing Associate to spearhead content marketing and other promotional initiatives on a small team in an education-focused startup. This is a great opportunity for someone looking to join a growing, flexible, and mission-driven organization at the ground floor.&nbsp;</p><p>This is a 100% remote, contractor-to-hire role. We encourage candidates from all backgrounds to apply.</p><p><strong>What You'll Do</strong></p><ul><li class=\"ql-indent-1\">Social media calendaring and creative design</li><li class=\"ql-indent-1\">Content marketing, including blog drafting and press solicitation</li><li class=\"ql-indent-1\">Identify partners &amp; track posts for our affiliate/Influencer program</li><li class=\"ql-indent-1\">Sales collateral development</li><li class=\"ql-indent-1\">Competitive research and analysis</li><li class=\"ql-indent-1\">Administrative support for our academic esports tournaments</li><li class=\"ql-indent-1\">Business development support; lead sourcing and prospecting, reporting</li></ul><p><strong>Who You Are</strong></p><ul><li class=\"ql-indent-1\">Experience executing marketing initiatives</li><li class=\"ql-indent-1\">Technical acumen with the ability to quickly learn tools and processes (GSuite, social platforms and social platform aggregators, image editing, email automation systems)</li><li class=\"ql-indent-1\">Strong written communication skills; ability to articulate nuanced core messaging to parents, educators, and students</li><li class=\"ql-indent-1\">Experience designing creative customer-facing assets</li><li class=\"ql-indent-1\">Resourceful; comfortable working in a remote startup setting</li><li class=\"ql-indent-1\">Ability to work independently on marketing initiatives, projects</li></ul><p><strong>Bonus Points (nice to have, but not required)</strong></p><ul><li class=\"ql-indent-1\">Experience in community development or a related field</li><li class=\"ql-indent-1\">Experience wearing many hats in a small org or team</li><li class=\"ql-indent-1\">Exposure to paid advertising platforms (Google, FB)</li></ul><p><strong>Who We Are</strong></p><p>CodeCombat is building a new way for K-12 students and at-home learners to learn how to code, using real programming languages to explore adventure games. Students learn how to write functions to control their hero avatars, implement puzzle-solving strategies, and code their own games. We are committed to researching, experimenting, and iterating new ways to marry education with fun for students worldwide.&nbsp;&nbsp;</p><p>We recently released Ozaria, a Computer Science program, adventure game, and fantasy story where students master core Computer Science concepts. The unfolding narrative creates a powerful and engaging student-centered learning experience, with each student’s investment in Ozaria’s story paralleling the investment they are making in their own learning journey.&nbsp;&nbsp;</p><p>We are a small, determined, and tight-knit startup dedicated to providing an enjoyable, meaningful place to work. Team members pursue a healthy work/life balance with flexible working hours. All of our team members work remotely from all around the world, with concentrations in San Francisco and Beijing.</p><p><strong>Our Values</strong></p><p><em>Our work is purposeful.</em></p><p>We bring our personal best every day, because our game-based learning can be life-changing for young people.&nbsp;&nbsp;</p><p><em>Strength comes from interdependence.</em></p><p>We recognize that each of us is central to the mission of CodeCombat. We know our differences create strength and resilience. We engage one another with respect for who we are, not only what we do. We create community with intention, because we need each other–and because it's fun.&nbsp;&nbsp;</p><p><em>Kind, not just \"nice\".</em></p><p>We don't let fear of not being \"nice\" get in the way of the direct communication that underpins healthy relationships. We build strong connections through honest dialogue, even when the conversations are difficult.&nbsp;&nbsp;</p><p><em>Structure can be liberating.</em></p><p>Transparent processes let us focus on making the right decisions–and they create channels for diverse voices to speak. Eliminate information silos and shadow structures; create known communication channels and clear responsibilities.&nbsp;&nbsp;</p><p><em>We can operate at any speed.</em></p><p>We're thoughtful about how fast we go. We pay attention when the lights change. Sometimes we walk.&nbsp;&nbsp;</p><p><em>Learning and growth go hand-in-hand.</em></p><p>Every experience is an opportunity to learn, and our team is growing every day. When we think we know it all, it means we have more to learn.</p><p>CodeCombat is proud to be an equal opportunity employer. All qualified applicants will be considered without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, or age. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p><p></p>",
    "apply": "https://jobs.lever.co/codecombat/c4cd9a3c-7cc9-4090-82eb-a487eb2d6ea7",
    "company": "/companies/codecombat",
    "cName": "CodeCombat",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  }
]