[
  {
    "title": "Sr Full Stack Java/API Developer",
    "description": "<p></p><p><strong>Description</strong></p><p><strong><u>Job Description:</u></strong></p><p>Come join one of our high performing teams responsible for building the next-generation enterprise APIs and modern responsive user interfaces. We serve the Social Security Administration (SSA) and their mission to meet the changing needs of the public, positively impacting at least 65 million American lives per month.&nbsp;Be part of the mission solution and help lead SSA’s Digital Modernization Strategy. We are a team of forward-looking professionals in need of a strong candidate with these key required skills:&nbsp;Java EE, React, Agile development, relational databases (PostgreSQL, DB2, or Oracle),&nbsp;and&nbsp;SOA/Microservice architecture. Do you have most of these key required skills, education, or experience? Do you want to learn more about our telework posture? Are you an US citizen, US resident, or Visa candidate and think you might fit? We recommend you apply and start the conversation today! Join us in supporting our SSA contracts in Woodlawn, Maryland.</p><p><strong>Team Culture</strong></p><p><strong>Your passion and values might be a good fit for our teams if you answer “yes” to the following questions:</strong></p><ul><li>Are you looking for a company that puts employees first, with a focus on career, flexibility, and well-being?</li><li>Do you enjoy collaborating with colleagues and teammates and believe that the best ideas are fostered in an inclusive environment?</li><li>Are you searching for a team with a strong sense of ownership, urgency, and drive for daily mission success?</li><li>Are you comfortable with proactive outward communication and technical leadership?</li><li>Do you enjoy being a catalyst, solving complex problems, and providing innovative solutions?</li><li>Do you have the flexibility, creativity, and resilience to pivot the mission for success?</li><li>Do you have the courage to make tough ethical decisions with pride, transparency, and respect?</li></ul><p><strong>Mentorship &amp; Career Growth</strong></p><p>Our teams are dedicated to supporting new team members in an environment that celebrates knowledge sharing and mentorship. Experienced engineers will be assigned to new hires for one-on-one mentoring, collaborative code reviews, and coaching on customer engagement to help each new hire successfully onboard and demonstrate their skills. Projects and tasks are assigned in a way that leverages your strengths and will help you further develop your skillset.</p><p><strong>Foundation for Success</strong></p><p><strong>This experience is the foundation a candidate needs to be successful in this position:</strong></p><ul><li>Bachelor's Degree in Computer Science, Mathematics, Engineering, or a related field</li><li>Masters or Doctorate degree may substitute for required experience</li><li>7+ years of experience with Java systems/application analysis and design</li><li>4+ years of combined experience SOA/Microservice architecture/RESTful web service</li><li>2+ years of combined experience with building responsive UIs with modern front-end technologies</li></ul><p><strong>Factors to Help You Shine</strong></p><p><strong>These skills will help you succeed in this position:</strong></p><ul><li>Solid experience with building responsive UIs with modern front-end technologies such as React, Angular, Node, Typescript, or Bootstrap</li><li>Solid knowledge of front-end technologies (HTML, JavaScript, JQuery, JSP, and CSS)</li><li>Excellent experience with Spring Framework (Boot, Batch, Cloud, Security, and Data)</li><li>Excellent knowledge with Java EE, Java generics, and concurrent programming</li><li>Solid knowledge of relational databases (PostgreSQL, DB2, and Oracle), SQL, and ORM technologies (JPA2, Hibernate, and Spring JDBC)</li><li>Solid experience with automated unit testing, TDD, BDD, and associated technologies (Junit, Mockito, Cucumber, Selenium, and Karma/Jasmine)</li></ul><p><strong>How to Stand Out from the Crowd</strong></p><p><strong>Showcase your knowledge of modern development through the following experience or skills:</strong></p><ul><li>Delivery (CI/CD) best practices and use of DevOps to accelerate quality releases to Production</li><li>PaaS using Red Hat OpenShift/Kubernetes and Docker containers</li><li>AWS cloud technologies or other cloud platforms</li></ul><p><strong>Day to Day Responsibilities</strong></p><p>At Leidos, we deliver innovative solutions through the efforts of our diverse and talented people who are dedicated to our customers’ success. We empower our teams, contribute to our communities, and operate sustainable. Everything we do is built on a commitment to do the right thing for our customers, our people, and our community. Our Mission, Vision, and Values guide the way we do business. If this sounds like a mission you want to be a part of, keep reading!</p><p>Every position we take is more rewarding when you know the why behind it.&nbsp;Know your work makes a difference to support those who need it most. If your passion is enabling life changing service to those around you this is the place for you. Find you passion in a team environment where all members are valued regardless of contractor or employee status.&nbsp;We are excited for you to take your place in our Leidos Family.</p><p><strong>Find your “Why” with us!</strong></p><ul><li>Architect, design, code, and implement next-generation web application using software engineering best practices in the latest technologies:</li><li class=\"ql-indent-1\">Single Page Application front-end (Angular, React, NodeJS, Sass, Typescript)</li><li class=\"ql-indent-1\">Spring Framework (Boot, Cloud, Security, Data)</li><li class=\"ql-indent-1\">DevOps (Jenkins, Red Hat OpenShift, Docker, SonarQube, UrbanCode)</li><li>Provide software expertise in one or more of these areas: Java application integration, Java enterprise services, service oriented architectures (SOA), security, business process management/business rules processing, user experience (UX) and accessibility (Section 508/WCAG/USDS Web Standards)</li><li>Investigate and repair application defects regardless of component: front-end, business logic, middleware, or database (PL/SQL and Data Modeling).</li><li>Brief management, customer, team, or vendors using written or oral skills at appropriate technical level for audience</li><li>All other duties as assigned or directed</li></ul><p>​&nbsp;<em>Leidos’ Health Group is recognized as a Top 10 Health IT provider. We draw on decades of success to deliver a range of solutions and services designed to meet the healthcare challenges of today. From the research bench to the patient bedside, we are a company of scientists, engineers, and technologists delivering a broad range of impactful, customizable, and scalable solutions to hospitals and health systems, biomedical organizations, and every U.S. federal agency focused on health. Leidos works with customers across the continuum of care to improve clinical, operational, and financial outcomes with innovative solutions that advance the next generation of care. Our mission is to contribute to creating a healthier world.</em></p><p><strong><u>Pay Range:</u></strong></p><p>Pay Range $94,250.00 - $145,000.00 - $195,750.00</p><p><strong>Covid Guidance</strong></p><p>In order to enter Leidos facilities in the U.S. and to attend Leidos events outside our facilities, employees are required to be vaccinated for COVID-19 or maintain proof of a negative COVID-19 test within 96 hours of entry. In addition, we are receiving guidance from certain customers that onsite contractor personnel will need to be fully vaccinated to access customer facilities. If you are not vaccinated, please consider getting your COVID-19 vaccination as soon as possible. If you have any questions, please contact your Talent Acquisition POC.&nbsp;</p><p><strong>About Leidos</strong></p><p>Leidos is a Fortune 500® technology, engineering, and science solutions and services leader working to solve the world’s toughest challenges in the defense, intelligence, civil, and health markets. The company’s 43,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported annual revenues of approximately $13.7 billion for the fiscal year ended December 31, 2021. For more information, visit&nbsp;<a href=\"http://www.leidos.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(133, 15, 137);\"><strong>www.Leidos.com</strong></a>.</p><p><strong>Pay and Benefits</strong></p><p>Pay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available&nbsp;<a href=\"https://www.leidos.com/careers/pay-benefits\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(133, 15, 137);\"><strong>here</strong></a>.</p><p><strong>Securing Your Data</strong></p><p>Leidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to&nbsp;<a href=\"mailto:spam.leidos@leidos.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(133, 15, 137);\"><strong>spam.leidos@leidos.com</strong></a>.</p><p><strong>Commitment to Diversity</strong></p><p>All qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.</p><p></p>",
    "apply": "https://careers.leidos.com/jobs/9518195-senior-full-stack-java-slash-api-developer",
    "company": "/companies/leidos",
    "cName": "Leidos",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Software/Web Developer",
    "description": "<p></p><p><strong>Description</strong></p><p><strong><u>Job Description:</u></strong></p><p>Leidos has an immediate need for a software developer supporting a Mission Planning program in Orlando, FL or 100% remote.&nbsp;This position will be part of a team of software developers and engineers working in a DevSecOps environment, providing software tools &amp; solutions to improve Air Force &amp; Navy Mission Planning systems.</p><p>Primary Responsibilities</p><p><strong>The successful candidate will be energetic, eager to learn and comfortable working in a collaborative team environment.&nbsp;Under supervision, core responsibilities will include:</strong></p><ul><li>Creation and modification of software utilities for various Mission Planning needs</li><li>Development of web applications, REST APIs, and occasional desktop utilities&nbsp;</li><li>Software solution integration &amp; prototyping in a DevSecOps environment</li><li>Creating &amp; maintaining software-development documentation.</li><li>Software Development with Java and C#.Net</li><li>Utilizing front-end web development tools for development and integration</li><li>Software Development on microservices-based architectures and API design</li><li>Mentoring less-experienced software developers on how to develop and integrate new capability within an AWS or Azure cloud-based DoD Mission Planning pipeline</li><li>Providing Help-desk escalation software developer support&nbsp;</li></ul><p><strong>Basic Qualifications</strong></p><ul><li>U.S. Citizenship</li><li>DoD Secret Clearance or ability to obtain a DoD Secret security clearance</li><li>Bachelor’s degree in Information Technology/Computer Science or a closely related field</li><li>Strong understanding of object-oriented software concepts</li><li>4+ years of software engineering experience including any .Net programming language or Java</li><li>2+ years of experience with JavaScript, HTML, and CSS</li><li>Experience calling/utilizing REST APIs</li><li>Knowledge of Integrated Development Environments (IDE)</li><li>Experience utilizing a source code version control system such as Git</li><li>Experience programmatically interfacing with a relational database and basic database concepts</li></ul><p><strong>Preferred Qualifications</strong></p><ul><li>Experience with .Net 5+ and .Net Framework</li><li>Experience creating REST APIs</li><li>Experience with Visual Studio</li><li>Experience with dependency injection, mocking technologies, and writing unit tests</li><li>Knowledge of web authentication mechanisms such as JWT</li><li>Familiarity with object relational mappers, such as Entity Framework or Hibernate</li><li>Experience with Team Foundation Server or JIRA</li><li>Experience with common scripting tools such as Windows Command Prompt, PowerShell, &amp; Linux Bash</li><li>Knowledge of Virtual Machine environments and their use</li><li>Experience with containerization technologies, such as Docker</li></ul><p><strong><u>Pay Range:</u></strong></p><p>Pay Range $74,750.00 - $115,000.00 - $155,250.00</p><p>#Remote</p><p><strong>Covid Guidance</strong></p><p>In order to enter Leidos facilities in the U.S. and to attend Leidos events outside our facilities, employees are required to be vaccinated for COVID-19 or maintain proof of a negative COVID-19 test within 96 hours of entry. In addition, we are receiving guidance from certain customers that onsite contractor personnel will need to be fully vaccinated to access customer facilities. If you are not vaccinated, please consider getting your COVID-19 vaccination as soon as possible. If you have any questions, please contact your Talent Acquisition POC.&nbsp;</p><p><strong>About Leidos</strong></p><p>Leidos is a Fortune 500® technology, engineering, and science solutions and services leader working to solve the world’s toughest challenges in the defense, intelligence, civil, and health markets. The company’s 43,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported annual revenues of approximately $13.7 billion for the fiscal year ended December 31, 2021. For more information, visit&nbsp;<a href=\"http://www.leidos.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(133, 15, 137);\"><strong>www.Leidos.com</strong></a>.</p><p><strong>Pay and Benefits</strong></p><p>Pay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available&nbsp;<a href=\"https://www.leidos.com/careers/pay-benefits\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(133, 15, 137);\"><strong>here</strong></a>.</p><p><strong>Securing Your Data</strong></p><p>Leidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to&nbsp;<a href=\"mailto:spam.leidos@leidos.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(133, 15, 137);\"><strong>spam.leidos@leidos.com</strong></a>.</p><p><strong>Commitment to Diversity</strong></p><p>All qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.</p><p></p>",
    "apply": "https://careers.leidos.com/jobs/9545213-software-slash-web-developer",
    "company": "/companies/leidos",
    "cName": "Leidos",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Java Developer",
    "description": "<p></p><p><strong>JOB DESCRIPTION</strong></p><p><strong>Description</strong></p><p>SAIC is seeking a Java Developer to create new user information solutions by designing, implementing and maintaining Java-based Web components and interfaces within a Scrum team. Contribute to the entire System Development Lifecycle (SDLC), by assessing functional and technical requirements, performing high-level and detailed design activities, writing testable and efficient code in support of those designs and testing completed implementations for functional and technical compliance prior to deployment. Update, maintain and add functionality to preexisting Java-based information solutions.</p><p>Primary Job Duties</p><ul><li>Decompose user specifications and technical designs provided by application architects and technical leads to complete assigned coding tasks within a Scrum team.</li><li>Thoroughly test completed code by writing, executing and reporting the results of automated unit tests.</li><li>Participate in, and document the results of, peer code reviews.</li><li>Create SDLC-mandated project and product documentation.</li><li>Debug and resolve application and data issues.</li><li>Reports to a Scrum team lead, with additional oversight provided by project manager, application architects and technical lead.</li><li>Mentor, coach and develop less-experienced team members</li></ul><p><strong>Qualifications</strong></p><p><strong>Requirements and Qualifications</strong></p><p><span>Education and Experience</span></p><ul><li><span>Bachelor’s degree</span></li><li><span>2+ years of software development experience utilizing Java.</span></li></ul><p><span>or</span></p><ul><li><span>Master’s degree</span></li><li><span>Software development knowledge or experience utilizing Java preferred.</span></li></ul><p><span>Eligible to obtain and maintain a Public Trust clearance</span></p><p><span>Target salary range: $75,001 - $100,000. The estimate displayed represents the typical salary range for this position based on experience and other factors.</span></p><p><span>Covid Policy: SAIC does not require COVID-19 vaccinations or boosters. Customer site vaccination requirements must be followed when work is performed at a customer site.</span></p><p><strong>Overview</strong></p><p>SAIC® is a premier Fortune 500® technology integrator driving our nation's technology transformation. Our robust portfolio of offerings across the defense, space, civilian, and intelligence markets includes secure high-end solutions in engineering, digital, artificial intelligence, and mission solutions. Using our expertise and understanding of existing and emerging technologies, we integrate the best components from our own portfolio and our partner ecosystem to deliver innovative, effective, and efficient solutions that are critical to achieving our customers' missions.</p><p>We are more than 26,500 strong; driven by mission, united by purpose, and inspired by opportunities. SAIC is an&nbsp;<a href=\"https://www.saic.com/eeo-statement\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 107, 182);\">Equal Opportunity Employer,</a>&nbsp;fostering a respectful work culture based on&nbsp;<a href=\"https://www.saic.com/who-we-are/life-at-saic/diversity-equity-and-inclusion\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 107, 182);\">diversity, equity, and inclusion</a>&nbsp;that values all contributors. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $7.1 billion. For more information, visit&nbsp;<a href=\"http://www.saic.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 107, 182);\">saic.com</a>.</p><p></p>",
    "apply": "https://jobs.saic.com/jobs/9530194-java-developer",
    "company": "/companies/saic",
    "cName": "SAIC",
    "location": "USA",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Programmer analyst II",
    "description": "<p></p><p><strong>Job Description</strong></p><p>Every day, our teams innovate across the world of finance. We collaborate to work smarter, while making a difference. We believe in diversity and inclusivity, giving a voice to everyone on the team. And we celebrate our success together. If you want to make an impact in fintech, we’d like to know: Are you FIS?</p><p><strong><u>About the role:</u></strong></p><p>As a Programmer Analyst, you’ll help provide technical support for the FIS TrustDesk Suite of products for more than 80 Wealth and Retirement clients. This could involve working with bleeding edge technology while coding, implementing, maintaining and supporting software applications.</p><p><strong><u>About the team:</u></strong></p><p>This position is part of the Wealth and Retirement CIO Team, specifically supporting the TrustDesk accounting platform products. TrustDesk is one of the 8 different applications within Wealth and Retirement.</p><p><strong><u>What you will be doing:</u></strong></p><ul><li>Provide production support functions for Trustdesk applications.&nbsp;</li><li>Participate in issue triage, coordinate with clients and vendors on issue triage call, and resolve client issues with Trustdesk.</li><li>Support TrustDesk web applications running in RHEL and using IBM WebSphere.</li><li>Provide root cause analysis to overnight batch issues and permanent resolution to the issues.</li><li>Support file transmissions using sFTP, FTPS, NDM and MQ.</li><li>Coordinate and support disaster recovery exercises for FIS TrustDesk and clients.</li><li>Coordinate JCL moves and schedule changes during installs.</li><li>Participate in end of year activities.</li><li>Participate in audit activities.</li><li>Gather TrustDesk statistics and report to management.</li><li>Developing program logic for new applications and modifying logic in existing applications.</li><li>Coding, debugging, implementing and maintaining software applications.</li><li>Maintaining and integrating new application components.</li><li>Ensuring deployment of system improvements.</li></ul><p><strong><u>What you will need:</u></strong></p><ul><li>Technical knowledge of IBM mainframe tools including COBOL, VSAM, JCL, DB2, CICS, SyncSort, Control-M, Mainview, VPS and emulator print sessions.</li><li>Knowledge of modern, end-to-end systems development life cycles.</li><li>Proficiency in business modeling and requirements definition disciplines.</li><li>A bachelor’s in computer science or information systems or equivalent experience.</li></ul><p><strong><u>Added bonus if you have:</u></strong></p><ul><li>Previous TrustDesk or trust accounting platform experience.</li><li>Wealth and Retirement Systems Industry experience</li></ul><p><strong><u>What we offer you:</u></strong></p><p>At FIS, you can grow your career as far as you want to take it. Here’s what else we offer:</p><ul><li>Opportunities to make an impact in fintech</li><li>Personal and professional learning</li><li>Inclusive, diverse work environment</li><li>Resources to give back to your community</li><li>Competitive salary and benefits</li></ul><p><strong>Vaccination Requirements</strong></p><p>Notice to all US applicants: All employees must be fully vaccinated against COVID-19.&nbsp;Individuals with a disability (including a medical condition) or sincerely held religious beliefs or practices that prevent them from getting the vaccine may request an exemption from the vaccine requirement.</p><p><strong>Privacy Statement</strong></p><p>FIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the&nbsp;<a href=\"http://www.fisglobal.com/privacy\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(75, 205, 62);\">Online Privacy Notice</a>.</p><p><strong>EEOC Statement</strong></p><p>FIS is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, genetic information, national origin, disability, veteran status, and other protected characteristics. The EEO is the Law poster is&nbsp;<a href=\"https://www.eeoc.gov/sites/default/files/migrated_files/employers/eeoc_self_print_poster.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(75, 205, 62);\">available here</a>&nbsp;supplement document&nbsp;<a href=\"http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(75, 205, 62);\">available here</a></p><p><span>For positions located in the US, the following conditions apply. If you are made a conditional offer of employment, you will be required to undergo a drug test. ADA Disclaimer: In developing this job description care was taken to include all competencies needed to successfully perform in this position. However, for Americans with Disabilities Act (ADA) purposes, the essential functions of the job may or may not have been described for purposes of ADA reasonable accommodation. All reasonable accommodation requests will be reviewed and evaluated on a case-by-case basis.</span></p><p><strong>Sourcing Model</strong></p><p>Recruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.</p><p>#pridepass</p><p>Explore Location</p><p></p>",
    "apply": "https://careers.fisglobal.com/us/en/job/FIGLUSJR0214507EXTERNAL/Programmer-analyst-II-Remote-US",
    "company": "/companies/fis",
    "cName": "FIS",
    "location": "USA",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Frontend Developer (Web)",
    "description": "<p></p><p><strong>Summary</strong>&nbsp;</p><p>Phase2 is a digital product agency passionate about customer experience, grounded in data and insights, and rooted in 20 years of successful technology delivery. We make digital products that inspire, engage, and create impact. For the most influential companies in the world, Phase2 is a proven partner, guiding our clients toward what's next in the digital landscape.</p><p>Phase2 is looking for a frontend web developer who is excited about creating compelling and useful digital experiences to join our expanding team. The ideal candidate is passionate about solving the underlying problems for our clients; highly collaborative and eager to exchange knowledge with coworkers; and constantly seeking to learn and improve. You will build the user-facing parts of web sites and web applications using a variety of technologies including&nbsp;Web Components, Lit2 and Typescript. You should come with an openness to learning technologies in the midst of doing project work, but with the reassurance that you are part of a team that helps each other learn. Your excellent communication skills will help you be effective not only working with your colleagues but also with clients, who will talk with you and your teammates over a variety of communication media such as Zoom and Slack.</p><p>Working at Phase2, you will be surrounded by other highly intelligent, motivated professionals who are not only smart but also kind. Our culture is built on authenticity, collaboration, and knowledge sharing. We provide a flexible work environment and we have been remote-friendly for years prior to the pandemic. We nurture the natural curiosity of our employees by providing them opportunities to explore various disciplines through our system of guilds: groups who meet regularly discuss, learn about, and advance our company’s capabilities in specific areas. Focus areas for our guilds range from: Artificial Intelligence and Machine Learning; Automated Testing; Drupal; JAMstack; Management; Teambuilding and Agile Methodologies; Javascript; Diversity, Equity, and Inclusion (DEI); and many others. Our developers also get the opportunity to learn and explore continuously by working across a variety of clients and using an ever-evolving set of cutting edge technologies. If you are passionate about your work and want to make an impact, we’d love&nbsp;for you to join us and add to our culture!</p><p>This position reports to the Director of Engineering for Frontend and Mobile Applications.</p><p><strong>Responsibilities</strong></p><ul><li>Break down functional requirements into technical tasks.</li><li>Communicate with clients to clarify requirements and discuss solution options.</li><li>Estimate development tasks.</li><li>Design data structures, including component composition, properties, and state.</li><li>Suggest improvements to software systems.</li><li>Lead portions of the project development process.</li><li>Troubleshoot operational issues to determine root cause and perform resolution.</li><li>Manage codebase to create releases and deploy code to production systems.</li><li>Shares knowledge and mentors colleagues as needed.</li><li>Provide self-documenting code and operational documentation as required.</li><li>Meet periodically with a mentor/manager/team lead to keep on track with development.</li><li>Accept constructive feedback and seek assistance as needed.</li><li>Perform code reviews on pull requests.</li></ul><p><strong>Minimum Qualifications</strong></p><ul><li>Strong understanding of modern vanilla JavaScript (ES6+).</li><li>Strong knowledge of modern CSS, including, Flexbox, CSS grid, CSS variables.</li><li>Strong understanding of the DOM (Document Object Model) and DOM manipulation.</li><li>Experience with one or more frontend frameworks.</li><li>Experience writing automated tests using systems such as Mocha, Jest, or Cypress.</li><li>Ability to collaborate with design and product team(s) and make recommendations that ease or improve implementation.</li><li>Experience using Git, including the abilities to commit code, work with merge conflicts and comprehend industry standard Git workflows.</li></ul><p><strong>Preferred Qualifications</strong></p><ul><li>Experience with, or basic knowledge of, Web Components strongly preferred.</li><li>Experience developing in TypeScript.</li><li>Experience with JavaScript template engines like JSX.</li><li>Experience developing with Tailwind CSS.</li><li>Experience advocating for accessibility best practices.</li><li>Drupal theming experience, including the Twig templating system, a plus.</li><li>Experience with bundling systems such as Webpack, Snowpack, Parcel, etc.</li></ul><p><strong>Key Metrics</strong></p><ul><li>Complete assigned tickets in the sprint.</li><li>Successfully merge code into the build pipeline.</li><li>Participate in frontend code reviews on current project(s).</li><li>Contribute to sprint planning and other agile ceremonies.</li><li>Share expertise with clients and colleagues as needed.</li></ul><p><strong>Physical Demands</strong></p><ul><li>Frequently remain in a stationary position, often standing or sitting for prolonged periods of time.</li><li>Occasional adjusting or moving of light objects up to 20 pounds in all directions.</li><li>Continuous communication on live video chats, calls, and through emails and messaging platforms for the purpose of exchanging information.</li><li>Continuous repetitive movements that may include the wrists, hands, and/or fingers.</li></ul><p><strong>Mental Demands</strong></p><ul><li>Comprehension- Must continuously be able to understand direction and adhere to established procedures. Must also be able to gather information from clients and employees and synthesize this information in a meaningful way. May also be responsible for making improvements or recommendations to existing procedures.</li><li>Organization- Must continuously be able to gather and classify information, store information learned from conversations and communications, and then be and be able to quickly recall, interpret, and explain information.&nbsp;</li><li>Reasoning and Decision Making- Must continuously use logic to analyze and interpret information, and prioritize.&nbsp;</li><li>Communication- Must continuously express or exchange ideas and meaning with employees and clients.</li><li>Resilience- Must continuously adapt well in the face of workplace stressors.</li></ul><p><strong>Regarding COVID-19 Vaccines</strong></p><p>Phase2 has contracts with the federal government, subjecting it to federal COVID-19 vaccine mandates. If you are under consideration for work on a government contract or plan to work from a Phase2 office location, Phase2 will require you to be vaccinated. Phase2 will permit limited medical and religious exemptions. Upon offer of employment, you will be asked to provide your vaccination status.</p><p><strong>More About Phase2</strong></p><p>Candidates being considered will be contacted by email first.&nbsp;Every job requires at least 2 interviews--both conducted via video.&nbsp;A representative from Employee Experience will conduct the first interview via video and the invitation will be sent from a valid, Phase2 email address. Additionally, all job offers are delivered via DocuSign with security validation.&nbsp;&nbsp;</p><p>Phase2 has an unwavering commitment to diversity, equity, and inclusion.</p><p>As a remote-first company, we are able to compete for the best talent, no matter where they live. Our salary structure is commensurate with accomplishment. We offer a full benefits package including 401K with an automatic company contribution. We have more than 160 employees in our Arlington, Virginia, New York, New York, Portland, Oregon, and “everywhere” offices.</p><p>We are dedicated to creating an environment of openness and engagement. Each member of our workforce can bring the fullest expression of themselves to work every day in order to best serve one another and our clients. We commit to keeping our workplace free from discrimination based upon race, color, religion, sex (including gender identity, sexual orientation, and pregnancy), national origin, age (40 or older), disability or genetic information. Phase2 is an Equal Opportunity/Affirmative Action Employer and participates in E-Verify.</p><p></p>",
    "apply": "https://recruitingbypaycor.com/career/JobIntroduction.action",
    "company": "/companies/phase2",
    "cName": "Phase2",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Sr Content Designer | Bankrate",
    "description": "<p></p><p><strong>AT A GLANCE</strong></p><p>Are you passionate about using words to create immersive digital experiences? Are you looking for a new and exciting way to flex your creative skills? Are you interested in partnering with designers, researchers, and others to craft solutions that improve people’s lives? If you answered yes, yep and heck yeah to those three questions, then we have the job for you!</p><p>Red Ventures is seeking a Senior Content Designer to join our Financial Services team. In this role, you'll use your writing and creative problem-solving skills across various digital channels to build compelling user experiences that guide users through complex financial decisions.&nbsp;</p><p>You'll collaborate with a dynamic team of designers, engineers, product managers, UX researchers and fellow writers. Ideal candidates will be egoless, comfortable leading and highly motivated, with a proven track record of driving performance.</p><p><strong>What You'll Do</strong></p><ul><li>Plan and write content and microcopy for various digital channels, including landing pages, lead flows, emails, video, and SMS</li><li>Partner with product designers and business leaders to drive strategy, co-create new solutions, and optimize existing product experiences</li><li>Use your knowledge of product design and UX to inform content strategy</li><li>Use data, user research and performance metrics to optimize existing site experiences</li><li>Manage other content designers, providing feedback and fostering growth</li></ul><p><strong>What We're Looking For</strong></p><ul><li>4+ years of experience, preferably in copywriting, marketing or digital strategy&nbsp;</li><li>A firm grip on UX and digital content principles</li><li>An approachable, collaborative and highly motivated personality</li><li>The ability to confidently present work to internal stakeholders and manage priorities across multiple projects</li><li>A self-starter attitude, sharp attention to detail, and the ability to steer creative ideation with consideration for the big picture</li><li>Experience using data to iterate on existing digital experiences</li><li>A desire to nurture fast-growing, well-funded brands into household names</li><li>A sense of humor and eagerness to participate in a fun, collaborative culture</li></ul><p>Unless otherwise prohibited by law, if a candidate is successful and a conditional job offer is made, the candidate then will be required to submit proof of a full vaccination series against COVID-19.&nbsp;Requests for reasonable accommodations on the basis of disability or religious belief will be considered on an individualized basis.</p><p><strong>Who We Are</strong></p><p>Over the last twenty years, Red Ventures has built a portfolio of influential brands, digital platforms, and strategic partnerships that work together to connect millions of people with expert advice. Through premium content and personalized digital experiences, Red Ventures builds online journeys that make it easier for people to make important decisions about their homes, health, travel, finances, education and entertainment. Founded in 2000, Red Ventures has 3,000 employees in 10 cities across the US, as well as in the UK and Brazil. Red Ventures owns and operates several large digital brands including Healthline, The Points Guy, Bankrate, MYMOVE, and Allconnect.com.For more information, visit&nbsp;<a href=\"https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fredventures.com%2F&amp;data=02%7C01%7Csbarnes%40redventures.com%7C16e1df4727ab4df3a19e08d858afa285%7C4289d6102cfd46218c9644a1518ddb0a%7C0%7C0%7C637356858668530717&amp;sdata=G5hO0K%2BV9%2BCWmyRJGVqu7qwAU6J8o1hufTEG%2F7uTEzM%3D&amp;reserved=0\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgba(20,54,66,var(--tw-text-opacity));\">https://redventures.com</a>&nbsp;and follow @RedVentures on social platforms.</p><p>We offer competitive salaries and a comprehensive benefits program for full-time employees, including medical, dental and vision coverage, paid time off, life insurance, disability coverage, employee assistance program, 401(k) plan and a paid parental leave program.</p><p>Red Ventures is an equal opportunity employer that does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or any other basis protected by law. Employment at Red Ventures is based solely on a person's merit and qualifications.&nbsp;</p><p>We are committed to providing equal employment opportunities to qualified individuals with disabilities. This includes providing reasonable accommodation where appropriate. Should you require a reasonable accommodation to apply or participate in the job application or interview process, please contact&nbsp;<a href=\"mailto:accommodation@redventures.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgba(20,54,66,var(--tw-text-opacity));\">accommodation@redventures.com</a>.</p><p>Join one of the most prestigious brands in the world, and do meaningful work that helps millions of people make better financial decisions for their families and their futures. Our Bankrate team spans offices all over the country, and we’re looking for a wide range of talent to help us grow – from technology experts, to journalists, to business leaders, and more.</p><p></p>",
    "apply": "https://www.redventures.com/careers/apply/4226924",
    "company": "/companies/red-ventures",
    "cName": "Red Ventures",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Product Designer II",
    "description": "<p></p><p>Optimizely is focused on unlocking digital potential and we are the recognized category leader in Digital Experience Platform (DXP) and created the category for A/B Testing and experimentation software. We have incredible customers – isn’t that one of the most important aspects of looking for your next job? Optimizely has over 9,000 brands from global organizations such as Visa, Sky, Yamaha, Wall Street Journal to tech innovators like Atlassian, DocuSign, FitBit and Zillow.</p><p>Not only are we financially sound and growing but we have unicorn status: Exceeded $300M in revenue in 2020, is profitable already, and has all strategic options ahead of itself. Optimizely continues to invest and addresses a market opportunity north of $30 billion, providing significant personal career growth opportunities.</p><p>We are an inclusive culture with a global team of 1200+ people across the US, Europe, Australia, and Vietnam. We blend European and American business culture with emphasis on teamwork, inclusion, and moving fast. People make the difference!</p><p>If you are looking to work on the next generation of digital technologies in a fast-paced, hyper-growth environment, apply! We’re just getting started...</p><p><strong>Introduction</strong></p><p>The goal of our product designers is to deeply understand our customers’ problems and design solutions to those problems. They are part of the entire product development process, from concept to launch. They work closely with product managers, UX researchers, and engineers to understand the customer problem, iterate on solutions, and ship finished designs to customers.&nbsp;</p><p><strong>Job Responsibilities</strong></p><p>This role will work with our application experience teams, whose mission it is to make the most accurate and fastest decisions about their business while using experimentation to deliver unbeatable digital experiences. This role requires a strong aptitude for experimentation.</p><p><strong>Knowledge and Experience</strong></p><ul><li>Good understanding of the user-centered design process, which you’ve used to help deliver projects&nbsp;</li><li>A portfolio showcasing product design work, including user flows solving specific product capabilities (e.g. audience builder).&nbsp;</li><li>Open to rapid iteration, feedback, and experimentation. Always seeks customer input and understanding.&nbsp;</li><li>Ability to connect design decisions back to business goals&nbsp;</li><li>Clear communication skills, being able to explain your design decisions in a convincing manner.&nbsp;</li><li>A desire to learn and curious by nature – about people, technology, data, new industries, and the world&nbsp;</li><li>Empathy — for customers and your fellow employees&nbsp;</li><li>Experience designing and using components in Figma&nbsp;</li><li>2-4 years of product design experience&nbsp;</li></ul><p><em>Optimizely is committed to a diverse and inclusive workplace. Optimizely is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.</em></p><p></p>",
    "apply": "https://careers.optimizely.com/job/Nashua-Product-Designer-II-IA-50658/845317755/",
    "company": "/companies/optimizely",
    "cName": "Optimizely",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Disruption Designer",
    "description": "<p></p><p><strong>Overview</strong></p><p><span>Be an agent of change on a team committed to achieving client-focused, mission-driven excellence. Steampunk is looking for an experienced Change Manager (Disruption&nbsp;Designer) with an appetite for taking on new challenges.&nbsp;</span></p><p><strong>Contributions</strong></p><p><strong>Key Responsibilities:</strong><span>&nbsp;</span></p><ul><li><span>Work with integrated teams of Designers and Technology professionals&nbsp;</span></li><li><span>Align change management and service design principles&nbsp;</span></li><li><span>Develop change management strategies&nbsp;&nbsp;</span></li><li><span>Lead and execute change management practices&nbsp;</span></li><li><span>Facilitate discussions across multiple workstreams&nbsp;</span></li><li><span>Distill data and provide meaningful products for clients&nbsp;</span></li></ul><p><strong>Qualifications</strong></p><p><strong>Qualifications:</strong><span>&nbsp;</span></p><ul><li><span>5 years of experience&nbsp;in Change Management&nbsp;</span></li><li><span>Well-versed&nbsp;with Change Management best practices and models&nbsp;</span></li><li><span>Communications and training planning&nbsp;</span></li><li><span>Current state assessments and future state visioning&nbsp;</span></li><li><span>User Feedback collection, synthesis, and action planning&nbsp;</span></li><li><span>Personas &nbsp;</span></li><li><span>Have or the Ability to obtain a public trust&nbsp;</span></li></ul><p><strong>Preferred Skills:</strong><span>&nbsp;</span></p><ul><li><span>Human-Centered Design / Customer Experience&nbsp;</span></li><li><span>Strong client communication skills&nbsp;</span></li><li><span>In-person and virtual facilitation and collaboration skills (through tools like Mural)&nbsp;</span></li><li><span>Bachelor’s&nbsp;Degree or formal training/certifications in&nbsp;change management, service design, or related fields&nbsp;</span></li><li><span>Experience working in a&nbsp;Government&nbsp;project-based environment</span></li></ul><p><span>Steampunk is a federal contractor subject to Executive Order 14042 and Federal Acquisition Regulation (FAR) 52.223-99 implementing the order.&nbsp;Therefore, this position requires full vaccination for COVID-19, except in jurisdictions where the mandate is barred by a court ordered injunction.&nbsp;</span></p><p><strong>About&nbsp;</strong><strong>steampunk</strong></p><p>Steampunk is a&nbsp;<strong>Change Agent</strong>&nbsp;in the Federal contracting industry, bringing new thinking to clients in the Homeland, Federal Civilian, Health and DoD sectors.&nbsp;Through our&nbsp;<strong>Human-Centered delivery methodology</strong>, we are fundamentally changing the expectations our Federal clients have for true shared accountability in solving their toughest mission challenges.&nbsp;As an&nbsp;<strong>employee owned company</strong>, we focus on investing in our employees to enable them to do the greatest work of their careers – and rewarding them for outstanding contributions to our growth. If you want to learn more about our story, visit&nbsp;<a href=\"http://www.steampunk.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(218, 16, 171);\">http://www.steampunk.com</a>.</p><p><em>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.&nbsp;Steampunk participates in the E-Verify program.</em>&nbsp;</p><p></p>",
    "apply": "https://careers-steampunk.icims.com/jobs/3601/job",
    "company": "/companies/steampunk",
    "cName": "Steampunk",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Design Operations Principal",
    "description": "<p></p><p>Xero is a beautiful, easy-to-use platform that helps small businesses and their accounting and bookkeeping advisors grow and thrive.&nbsp;</p><p>At Xero, our purpose is to make life better for people in small business, their advisors, and communities around the world. This purpose sits at the centre of everything we do. We support our people to do the best work of their lives so that they can help small businesses succeed through better tools, information and connections. Because when they succeed they make a difference, and when millions of small businesses are making a difference, the world is a more beautiful place.</p><p><strong>How you’ll make an impact</strong></p><p>The goal for our global Design team is to continue to develop the World Class Design culture at Xero. The Design Operations Principal will play a critical role in helping to establish and drive the future direction of Design Operations at Xero. You will be responsible for evangelizing our design system, practices and processes that enable our people to create #beautiful customer experiences. You will work closely with the GM – Design and Research Operations and other key members of the Design Leadership Team to identify, define, prioritise and own key initiatives that will sustain a great team culture and work experience, and bring efficiency and effectiveness to our fast scaling 185+ Product Design organization.</p><p><strong>What You'll Do</strong></p><p><strong>Design Operations Practice and Thinking</strong></p><ul><li class=\"ql-indent-1\">Work with the GM – Design and Research Operations and Design Operations Director to define initiatives which help to continually evolve and improve the Design Ops and Product Design Practices.</li><li class=\"ql-indent-1\">Own key initiatives to establish and maintain foundational tools and processes that deliver measurable efficiencies across the Design Team</li><li class=\"ql-indent-1\">Develop onboarding practices that ensure new team members are equipped with the information, connections and tools to quickly establish their foundations that will set them up for success at Xero.</li><li class=\"ql-indent-1\">Collect team feedback routinely and undertake internal research to understand the current or changing climate, culture and needs of our scaling team.</li><li class=\"ql-indent-1\">Partner with design and research leaders to evolve practices and mechanisms that enable our team to continue to scale in a sustainable way.</li><li class=\"ql-indent-1\">Mentor and support other team members, enabling them to develop their skills and expertise in the Design Operations space.</li><li class=\"ql-indent-1\">Collaborate with peers across the Design organisation and Operations teams to identify opportunities to innovate or improve practices and create solutions in an integrated way.</li></ul><p><strong>Relationship Management</strong></p><ul><li class=\"ql-indent-1\">Influence, help prioritise and focus efforts on the most impactful work.</li><li class=\"ql-indent-1\">Build strong collaborative partnerships across the Product Design and Research org, Legal, Procurement, CX, Marketing and broader Ops teams to align on and embed consistent quality of practice.</li><li class=\"ql-indent-1\">Interface with legal, security, and procurement teams where needed to onboard and pay vendors, including by facilitating statements of work and negotiating business terms and budget</li><li class=\"ql-indent-1\">Provide Design Leaders and stakeholders with visibility and updates of current initiatives, resource use and team performance</li><li class=\"ql-indent-1\">Promote the value of design and collaborative practice across spheres of influence and participation</li></ul><p><strong>Success looks like</strong></p><ul><li class=\"ql-indent-1\">You’re a key member of the Research and Design team</li><li class=\"ql-indent-1\">You’re helping drive the way we do things across Design organisation through your contribution in Design, Research and Ops forums</li><li class=\"ql-indent-1\">You’re collaborating and communicating well with all Xero colleagues, especially Design and Research teams and Operations teams across the business.</li></ul><p><strong>What you’ll bring with you - Critical Competencies</strong></p><ul><li class=\"ql-indent-1\">Extremely organized and detailed self-starter.&nbsp;Ability to work across multiple requests in a fast-paced environment.</li><li class=\"ql-indent-1\">Comfortable with some ambiguity and the foresight to create a plan B before it’s needed.&nbsp;</li><li class=\"ql-indent-1\">Strategic acumen and the foresight to anticipate complex, cross functional problems</li><li class=\"ql-indent-1\">Active listening and systems-thinking; heading off issues as we scale.</li><li class=\"ql-indent-1\">Passion for effective and timely internal and external communication.&nbsp;</li><li class=\"ql-indent-1\">Great people skills</li><li class=\"ql-indent-1\">An optimistic get-stuff-done mindsetTop notch writing skills</li></ul><p><strong>What you’ll bring with you - Experience</strong></p><ul><li class=\"ql-indent-1\">Expert in establishing best practices for Design Operations and managing tools</li><li class=\"ql-indent-1\">Successful track record in managing cross functional initiatives with many stakeholders within design and outside, across different disciplines and business units</li><li class=\"ql-indent-1\">Experience in procurement &amp; change processes including negotiating budget, scope &amp; terms of business.</li><li class=\"ql-indent-1\">Systems thinker with excellence in process analysis and track record of improving processes as a team scales, resulting in greater operational efficiency and team productivity</li></ul><p><strong>About Xero?</strong></p><p>Diversity of people brings diversity of thought, and we like that. A collaborative and inclusive environment is important to us. Working at Xero will provide you with a diverse and inclusive environment alongside people who will respect, challenge and support you to have fun while you do the best work of your life. We are a place where personal development, innovation, and well-being are not just inspired but celebrated.</p><p>We value our people and offer a wide range of compelling benefits and perks, including Xero shares and great parental leave policies.&nbsp;&nbsp;Xero’s collaborative culture is underscored by our values - #Ownership, #Challenge, #Beautiful, #Human and #Team - which empower us to understand and serve customers, attract top talent and continuously innovate.&nbsp;From the moment you step through our doors, you’ll feel welcome and supported to do the best work of your life.</p><p><em>Please note that we currently require all employees and contractors to be vaccinated against COVID-19 in order to work from a Xero office, or engage in any face-to-face Xero business.&nbsp;Xero will work with anyone who is not vaccinated, or prefers not to disclose their vaccination status, to determine if any reasonable accommodations can be provided to ensure their role can be performed safely whilst the restriction is in place.</em></p><p></p>",
    "apply": "https://jobs.lever.co/xero/6485ac20-0e5c-4601-b93a-8fe39f4789ea",
    "company": "/companies/xero",
    "cName": "Xero",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Design Researcher",
    "description": "<p></p><p>Xero is a beautiful, easy-to-use platform that helps small businesses and their accounting and bookkeeping advisors grow and thrive.&nbsp;</p><p>At Xero, our purpose is to make life better for people in small business, their advisors, and communities around the world. This purpose sits at the centre of everything we do. We support our people to do the best work of their lives so that they can help small businesses succeed through better tools, information and connections. Because when they succeed they make a difference, and when millions of small businesses are making a difference, the world is a more beautiful place.</p><p><strong>About the role:</strong></p><p>Design Researchers at Xero work with a wide range of product teams, using qualitative, quantitative and mixed methods approaches to&nbsp;better understand our users. This is a highly collaborative role with opportunities to work alongside other Design Researchers as well as product teams. Our Design Researchers are specialists in research, but there is ample opportunity to influence design decisions throughout the product cycle using both evaluative and generative approaches.&nbsp;</p><p><strong>About the team:</strong></p><p>We are a growing Design Research practice within Xero’s global Design team. Over 30 researchers collaborate across Australia, New Zealand, Canada, USA and the UK. When the team aren’t helping product teams they are working on creative initiatives to drive the practice forward and getting together to share our skills and experiences. As a fast growing team with a diverse range of backgrounds there is plenty of opportunity to help shape our ways of working.</p><p><strong>What you'll do:</strong></p><ul><li class=\"ql-indent-1\">Initiate work - work with Pods and teams to translate requests into research objectives, hypotheses and/or assumptions and determine the optimal research method.</li><li class=\"ql-indent-1\">Plan research studies - Run the logistics of a research study from recruitment, scheduling, and organizing note takers and observers.</li><li class=\"ql-indent-1\">Desk research - work with researchers and designers to analyse relevant inputs such as research and data insights, product strategy and roadmap, technical environment and constraints. Help teams understand all of the previous and related data they can use to understand their space.</li><li class=\"ql-indent-1\">Facilitate research sessions - run professional sessions to maximise unbiased observations, while ensuring comfort of the participant and ethical practices.</li><li class=\"ql-indent-1\">Conduct different types of research - run research studies with a variety of methods for a variety of purposes e.g. surveys, diary studies, unmoderated tests, etc.</li><li class=\"ql-indent-1\">Analyse data from research studies - synthesise and make sense of the data, translating it into comprehensible and significant finding and insights for the team to engage with.</li><li class=\"ql-indent-1\">Report actionable insights - structure your findings and insights so they are actionable and help the Pod figure out how to move forward with those in mind.</li><li class=\"ql-indent-1\">Link up with other research - Connect insights from your study to previous research studies including those across portfolios, product data, Voice of the customer / marketing research, support tickets, and other reliable sources of information.</li><li class=\"ql-indent-1\">Communicate effectively - Present and communicate research to a range of different audiences to make it easy for audiences to action insights.</li><li class=\"ql-indent-1\">Collaborate with designers and content strategists – challenging assumptions and 'pre-set' thinking around solutions, agreeing the purpose, principles and vision.</li><li class=\"ql-indent-1\">Consider bias throughout the project - recognise it, minimise it where possible and call it out when it impacts insights.</li><li class=\"ql-indent-1\">Close out projects - follow all relevant close out processes including sharing results, ensuring data obligations are met, and reflecting on the projects.</li></ul><p><strong>What you’ll bring with you</strong></p><ul><li class=\"ql-indent-1\">Track record of delivering quality design research</li><li class=\"ql-indent-1\">Track record of working with multi-disciplinary teams to achieve research goals</li><li class=\"ql-indent-1\">Excellent communication skills</li><li class=\"ql-indent-1\">A portfolio that demonstrates high-quality research, contributing to user experience and business value</li><li class=\"ql-indent-1\">Skill and experience with the research process including, engaging teams in research activities, planning, synthesis, and analysis</li></ul><p><strong>What you can look forward to</strong></p><p>Working at Xero will provide you with a diverse and inclusive environment alongside people who will respect, challenge, support and mentor you. Who says you can't have fun while you do the best work of your life?</p><p>We see the value in work-life balance, many of us take full advantage of our flexible working arrangements, so whether you like to get a surf in before work, like to head home in time to pick up the kids or you just like working from the comfort of your own home now and then, we want to support you.</p><p>We trust you to build your career to the best of your ability and we will support your hunger to learn with training and career mentorship, to help you flourish. Our facilities and PX teams work hard to give us great workspaces with all the tech company perks so join us and experience our awesome culture!</p><p>You can choose to perform this role:</p><p>- Flexibly, through a hybrid of in office and remote working styles</p><p><strong>About Xero?</strong></p><p>Diversity of people brings diversity of thought, and we like that. A collaborative and inclusive environment is important to us. Working at Xero will provide you with a diverse and inclusive environment alongside people who will respect, challenge and support you to have fun while you do the best work of your life. We are a place where personal development, innovation, and well-being are not just inspired but celebrated.</p><p>We value our people and offer a wide range of compelling benefits and perks, including Xero shares and great parental leave policies.&nbsp;&nbsp;Xero’s collaborative culture is underscored by our values - #Ownership, #Challenge, #Beautiful, #Human and #Team - which empower us to understand and serve customers, attract top talent and continuously innovate.&nbsp;From the moment you step through our doors, you’ll feel welcome and supported to do the best work of your life.</p><p><em>Please note that we currently require all employees and contractors to be vaccinated against COVID-19 in order to work from a Xero office, or engage in any face-to-face Xero business.&nbsp;Xero will work with anyone who is not vaccinated, or prefers not to disclose their vaccination status, to determine if any reasonable accommodations can be provided to ensure their role can be performed safely whilst the restriction is in place.</em></p><p></p>",
    "apply": "https://jobs.lever.co/xero/b81bb16c-6e9c-4bf8-8356-57fe1d4c2a1e",
    "company": "/companies/xero",
    "cName": "Xero",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Technical Writer",
    "description": "<p></p><p><strong>Job Description</strong></p><p><strong>About Conduent</strong></p><p>Through our dedicated associates, Conduent delivers mission-critical services and solutions on behalf of Fortune 100 companies and over 500 governments – creating exceptional outcomes for our clients and the millions of people who count on them.</p><p>You have an opportunity to personally thrive, make a difference and be part of a culture where individuality is noticed and valued every day.</p><p><strong>Job Description</strong></p><p><strong>TECHNICAL WRITER (remote)</strong></p><p>The Technical Writer creates easy-to-understand user content and product documentation to meet project requirements, increase product clarity, support user performance, and maximize usability.</p><p>Collaborate with cross-functional teams and various client teams to create and maintain project and product documentation.</p><p>Work within the PMO to produce deliverables and documentation across a phases of the project</p><p><strong><em>Duties &amp; Responsibilities:</em></strong></p><p>Develops, produces, and maintains a variety of complex technical and user documentation that adhere to contractual requirements.</p><p>Identifies appropriate baseline to tailor project documentation that meets the same.</p><ul><li>Uses standardized templates for functional requirements documents, technical architecture documentation, process flows, and design specifications</li><li>Extrapolates process and procedure information from requirements subject matter expert interviews to create articulate and compliant deliverables and documentation</li></ul><p><strong><em>Required Education/Other Credentials:</em></strong></p><ul><li>Collaborate with cross-functional teams to understand, create, and maintain required documentation</li><li>Analyzes documentation content, flow, and format; makes improvements as necessary</li><li>Uses and enforces documentation standards</li><li>Edits documentation for content, clarity, grammar, and flow.</li><li>Works with the PMO Lead/Manager to schedule and conduct documentation audits.</li><li>Demonstrates strong editing &amp; formatting expertise with a high degree of attention to details</li><li>Serve as SME &amp; primary source of competency and leading authority on technical writing.</li></ul><p><strong><em>Requirements</em></strong></p><p>Bachelor’s required (Master preferred) in English, Writing, Publications, Communications or similar</p><ul><li>Superior, efficient writing skills with technical writing background required…with a strong preference for experience within a project/product implementation environment, healthcare experience, SDLC/Product development experience</li><li>Ability to determine project requirements, perform complex writing, copy editing, technical editing and documentation design activities using SDLC processes.</li><li>Experience executing document quality assurance process to tailor documentation</li><li>Must demonstrate a mature understanding of technical writing and collaboration best practices as well as production management techniques and standards.</li><li>Must have ability to work within a team and to contribute significantly to team performance.</li><li>Demonstrates an understanding of the communication process</li><li>Confident and clear written and verbal communication with the ability to engage with all levels of partners.</li><li>Proficient in Microsoft Office Suite</li><li>Understanding of the healthcare payer space with a minimum experience of 5 years in the domain preferred.</li><li>Must have a prior experience in implementing/maintenance of commercial payer solution and/or Medicaid system (<u>required)</u></li><li>Must have experience with claims processing concepts, along with the member enrollment and care management concepts.</li><li>Must be able to work with the clients to create/gather requirements and document them according to standards.</li><li>Must adhere to/define) the processes for requirement solicitation, documentation and hand off</li><li>Work closely with team to capture requirements, and create test and execute cases</li><li>Must have excellent communication skills. Should be able to multitask</li></ul><p><strong><em>Preferred skills:</em></strong></p><ul><li>Capability to think out-of-the-box to create new documentation solutions as needed.</li><li>Prior experience as a QA or Developer in a healthcare system would be helpful.</li><li>Advanced Word, MadCap Flare, Microsoft Captivate or Camtasia 5.</li></ul><p><strong>Closing</strong></p><p>Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law.</p><p>People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the “Submit” button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first:&nbsp;<a href=\"https://downloads.conduent.com/content/usa/en/file/conduent-applicant-adaaa-referral-form.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(51, 51, 51);\">click here to access or download the form</a>. You may also&nbsp;<a href=\"http://downloads.conduent.com/content/usa/en/document/cdt_adaaa_accommodation_pol.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(51, 51, 51);\">click here to access Conduent’s ADAAA Accommodation Policy</a>.</p><p><em>At Conduent we value the health and safety of our associates, their families and our community. For US applicants while we DO NOT require vaccination for most of our jobs, we DO require that you provide us with your vaccination status, where legally permissible. Providing this information is a requirement of your employment at Conduent.</em></p><p></p>",
    "apply": "https://jobs.conduent.com/job/15740164/",
    "company": "/companies/conduent",
    "cName": "Conduent",
    "location": "USA",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Sr Marketing Copywriter",
    "description": "<p></p><p><strong><u>Job Description</u></strong></p><p><strong>About this role:</strong></p><p><span>Devoted Health is looking for a senior marketing copywriter to develop a wide assortment of articles, helpful resources, and marketing assets to engage and educate older Americans.</span></p><p><span>In this role, you'sll write everything from website articles and webinars, to guides, letters, educational handouts, and more. You ideally have experience in healthcare, Medicare, or another complicated industry as well as a journalist'ss love of researching new topics and writing about them in a way that'ss clear, compelling, and meets our audience where they are.</span></p><p><span>***Portfolio and cover letter are required. Applications without both will not be considered.</span></p><p><strong>Responsibilities will include: </strong></p><ul><li>Researching and writing branded content (articles, webinars, tip sheets) that educates our audience on Medicare and aligns with our overall brand strategy</li><li>Editing and de-jargoning emails and letters to make them friendly, plain-language materials</li><li>Pitching in on marketing assets for our digital and traditional media channels</li><li>Working alongside designers to make sure your copy sings in layout&nbsp;</li><li>Establishing relationships with in-house subject matter experts to guarantee our materials are accurate and helpful</li><li>Being open to feedback and revisions on your writing</li><li>Working with team members on various initiatives to improve the engagement and impact of content</li></ul><p>Devoted is an equal opportunity employer. We are committed to a safe and supportive work environment in which all employees have the opportunity to participate and contribute to the success of the business. We value diversity and collaboration. Individuals are respected for their skills, experience, and unique perspectives. This commitment is embodied in Devoted’s Code of Conduct, our company values and the way we do business.</p><p>As an Equal Opportunity Employer, the Company does not discriminate on the basis of race, color, religion, sex, pregnancy status, marital status, national origin, disability, age, sexual orientation, veteran status, genetic information, gender identity, gender expression, or any other factor prohibited by law. Our management team is dedicated to this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, employee activities and general treatment during employment.</p><p><span>COVID-19 Vaccination Requirement:</span> Where permitted by applicable law, candidates must have received or be willing to receive the COVID-19 vaccine by date of hire to be considered. The Company will provide reasonable accommodations to qualified employees with disabilities or for a sincerely held religious belief, practice, or observance.</p><p></p>",
    "apply": "https://devoted.wd1.myworkdayjobs.com/en-US/Devoted/job/Waltham-Massachusetts-Office/Senior-Marketing-Copywriter_MA-2022-010-1",
    "company": "/companies/devoted-health",
    "cName": "Devoted Health",
    "location": "USA",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Copywriter",
    "description": "<p></p><p><strong>The Position</strong></p><p>The Copywriter partners with our in-house creative team to craft thoughtful and strategic branded communications for Neoscape clients across real estate, corporate, and product marketing. The position requires working closely with creative directors, designers, strategists, and other copywriters in the conception and development of the messaging components of campaigns across a broad range of media.</p><p><strong>Experience</strong></p><ul><li>Bachelor’s degree or equivalent experience in marketing or communications</li><li>1-3 years of experience producing copy for digital, print, and film/video</li><li>Experience writing for both B2B and B2C audiences</li><li>Strong conceptual thinking and problem-solving skills</li><li>Strong research and presentation skills</li><li>Excellent interpersonal and communication skills</li><li>Excellent time-management, self-motivation, and organizational skills</li><li>Experience with web markup language and search engine optimization is a plus</li><li>Experience in property marketing, hospitality, and leisure is a plus</li><li>Experience working in a collaborative studio or agency environment is a plus</li></ul><p><strong>You got this…</strong></p><p>Send a cover letter letting us know why Neoscape and this position interest you. Include your resume and, if applicable, a link to your portfolio, pointing out any projects you feel are especially relevant to the work we do here.</p><p></p>",
    "apply": "https://neoscape.com/careers/copywriter-neoscape/",
    "company": "/companies/neoscape",
    "cName": "Neoscape",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Technical Writer",
    "description": "<p></p><p class=\"ql-align-center\"><span>Join us as we work to create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all.</span></p><p class=\"ql-align-center\">We are looking for a Technical Writer to join our team within our Product Optimization division. Your job will be to work collaboratively in an Agile environment with subject matter experts to document functionality in online help and release notes for customers who use athenahealth SaaS based services on every bi-weekly and tri-annual releases, meeting hard deadlines. But enough about us; let’s talk about you.</p><p class=\"ql-align-center\">You are an excellent communicator and presenter with an ability to maintain poise and a sense of humor in a fast-paced environment with immovable deadlines. As a diplomat, you can work effectively with a wide array of personality types and all job levels. You demonstrate the ability to write clearly, simply, and accurately. You have a knack for quickly and creatively solving problems and a capacity to assume sole and independent responsibility for the success of various projects. You are a consummate team player with dedication to client service.</p><p class=\"ql-align-center\">The Team: Our Technical Writing team engages closely with engineering and product teams to document functionality implemented as part of regular release schedules.</p><p class=\"ql-align-center\"><strong>Job Responsibilities</strong></p><ul><li class=\"ql-align-center\">Document functionality using MadCap Flare and MadCap Central</li><li class=\"ql-align-center\">Work to attain a deep knowledge of athenaNet functionality</li><li class=\"ql-align-center\">Communicate regularly with SMEs to confirm accuracy of content</li><li class=\"ql-align-center\">Use JIRA to track documentation changes</li></ul><p class=\"ql-align-center\"><span>Typical Qualifications</span></p><ul><li class=\"ql-align-center\">Bachelor’s Degree in Technical Writing, Computer Science, or equivalent</li><li class=\"ql-align-center\">3+ years of professional experience authoring process documentation or online help preferred</li><li class=\"ql-align-center\">Experience maintaining a large amount of documentation for a product and establishing new content structures within it.</li><li class=\"ql-align-center\">Exceptional writing and interpersonal communication skills, including group presentation and relationship development skills</li><li class=\"ql-align-center\">Experience with Madcap Flare, Adobe RoboHelp, or similar authoring tool and graphical tool preferred</li><li class=\"ql-align-center\">Working knowledge of Bugzilla, JIRA, or similar bug tracking tool preferred</li></ul><p class=\"ql-align-center\"><strong>About athenahealth</strong></p><p class=\"ql-align-center\"><span>Here’s our&nbsp;vision: To create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all. &nbsp;</span></p><p class=\"ql-align-center\"><span>What’s unique about our locations?&nbsp;</span></p><p class=\"ql-align-center\"><span>From an historic, 19th&nbsp;century arsenal to a converted, landmark power plant,&nbsp;all&nbsp;of&nbsp;athenahealth’s offices were carefully chosen to represent our innovative spirit and promote the most positive and productive work environment for our teams. Our&nbsp;10&nbsp;offices across the United States and India —&nbsp;plus numerous remote employees —&nbsp;all work to modernize the healthcare experience, together.&nbsp;</span></p><p class=\"ql-align-center\"><span>Our company culture might be our best feature.&nbsp;</span></p><p class=\"ql-align-center\"><span>We don't take ourselves too seriously. But our work? That’s another story.&nbsp;athenahealth develops and&nbsp;implements products and services that support US healthcare: It’s&nbsp;our chance to create healthier futures for ourselves, for our family and friends, for everyone.&nbsp;&nbsp;</span></p><p class=\"ql-align-center\"><span>Our vibrant and talented employees — or&nbsp;athenistas, as we call ourselves — spark the innovation and passion needed to accomplish&nbsp;our goal. We continue to expand our workforce with amazing people who bring diverse backgrounds, experiences, and perspectives at every level, and foster an environment where every athenista feels comfortable bringing their&nbsp;best&nbsp;selves to work.&nbsp;</span></p><p class=\"ql-align-center\"><span>Our size makes a difference, too: We are small enough&nbsp;that&nbsp;your&nbsp;individual contributions&nbsp;will stand out&nbsp;— but&nbsp;large enough&nbsp;to grow your career with our&nbsp;resources and established business stability.&nbsp;</span></p><p class=\"ql-align-center\"><span>Giving back is integral to our culture. Our&nbsp;athenaGives&nbsp;platform strives to&nbsp;support food security, expand access to high-quality healthcare for all, and support STEM education to develop providers and technologists who will provide access to high-quality healthcare for all in the future. As part of the evolution of athenahealth’s&nbsp;Corporate Social Responsibility&nbsp;(CSR)&nbsp;program, we’ve selected nonprofit partners that align with our purpose and let us foster long-term partnerships for charitable giving, employee volunteerism, insight sharing, collaboration, and cross-team engagement.</span><em style=\"background-color: transparent;\"> </em><span> &nbsp;</span></p><p class=\"ql-align-center\"><strong>What can we do for you?&nbsp;</strong></p><p class=\"ql-align-center\"><span>Along with health and financial benefits,&nbsp;athenistas&nbsp;enjoy perks specific to each&nbsp;location, including commuter support, employee assistance programs, tuition assistance,&nbsp;employee&nbsp;resource groups, and collaborative workspaces — some offices even welcome dogs.&nbsp;&nbsp;</span></p><p class=\"ql-align-center\"><span>In addition to our traditional benefits and perks, we sponsor events throughout the year, including&nbsp;book clubs, external speakers, and hackathons. And we&nbsp;provide&nbsp;athenistas&nbsp;with&nbsp;a&nbsp;company culture&nbsp;based on&nbsp;learning,&nbsp;the support of an&nbsp;engaged team,&nbsp;and&nbsp;an inclusive environment where all employees are valued.&nbsp;&nbsp;</span></p><p class=\"ql-align-center\"><span>We also&nbsp;encourage a better work-life balance for&nbsp;athenistas&nbsp;with our flexibility. While&nbsp;we know in-office collaboration is critical to our vision, we recognize that not all work needs to be done within an office environment, full-time. With consistent communication and digital collaboration tools, athenahealth enables employees to find a balance that feels fulfilling and productive for each individual situation.&nbsp;</span></p><p class=\"ql-align-center\">athenahealth is committed to a policy of equal employment opportunity—that’s why we recruit and hire applicants without regard to race, color, religion, sex (including pregnancy), national origin, disability, age, sexual orientation, veteran status, genetic information, gender identity, gender expression, or any other factor prohibited by law. We’re happy to provide a reasonable accommodation, for those with a disability, to complete any part of the application process. If you are unable to access or use this online application process and need an alternative method for applying, please contact us at&nbsp;<a href=\"mailto:taoperations@athenahealth.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(8, 117, 225); background-color: transparent;\">taoperations@athenahealth.com</a> for assistance.</p><p class=\"ql-align-center\"><a href=\"https://www.athenahealth.com/careers/equal-opportunity\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(8, 117, 225); background-color: transparent;\">https://www.athenahealth.com/careers/equal-opportunity</a></p><p></p>",
    "apply": "https://athenahealth.wd1.myworkdayjobs.com/en-US/External/job/Remote-USA/Technical-Writer_R6653",
    "company": "/companies/athenahealth",
    "cName": "Athenahealth",
    "location": "USA",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Marketing Content Writer",
    "description": "<p></p><p><strong>COMPANY OVERVIEW&nbsp;</strong></p><p>Does the idea of applying your talents at a company that assists people in understanding how to obtain additional health care benefits and compensates well for doing so, inspire you? We call it&nbsp;<em>“Doing good while doing well”</em>&nbsp;and invite you to apply to join us and begin moving forward along a beneficial career path – one built on providing solutions by helping others navigate through the complex world of health care benefits.</p><p>Here at BeneLynk, our mission is to improve lives and positively impact social determinants of health barriers by providing our healthcare partners with the information they need, and people with the advocacy they deserve. We are laser-focused on our longstanding area of expertise in the healthcare world. We fully understand barriers and surface solutions, then provide the advocacy that changes lives and improves outcomes. Everything we do, from the systems we build, to our government relations, to our outreach operations, is in service of this one central vision.&nbsp;</p><p><strong>WHO WE ARE</strong></p><p>We are big-hearted people, passionate about serving our health plan clients, their members, and each other. We are a team in every sense of the word, striving toward a common mission – that is the goal of everyone at BeneLynk.&nbsp;Every day, we are relentless in helping people who need essential resources to make their lives easier and healthier. The members we serve call us \"miracles,\" \"kind,\" \"professional,\" \"human,\" and \"compassionate,\" and all with \"service that gets the job done.\" We pride ourselves on creating a healthy environment for our employees to thrive in their ability to assist others.</p><p><strong>POSITION TITLE</strong></p><p>Marketing Content Writer&nbsp;</p><p><strong>POSITION SUMMARY</strong></p><p>BeneLynk is looking for a part-time Marketing Content Writer to help with researching, drafting and publishing blog posts, press releases, case studies, news items, white papers, social media copy, email blasts, infographics, external communications, website copy, and more. The Marketing Content Writer will be responsible for creating content regularly and ad-hoc depending on various events and sales cycles. Content should include relevant keywords for&nbsp;Search Engine Optimization (SEO).&nbsp;</p><p>The candidate hired for this role will need to develop an understanding of social determinants of health (SDoH), the managed care industry, and how our solutions work together to help remove barriers to people living their healthier lives. This role requires a high level of accuracy, attention to detail and creativity.&nbsp;</p><p><strong>KEY RESPONSIBILITIES</strong></p><ol><li><strong>Brand Awareness: Create top of funnel subject matter such as white papers, email blasts, and other content that positively impacts the familiarity of BeneLynk’s brand to our audience. In this phase, the Marketing Content Writer will focus on introducing our organization to new prospects by maintaining consistent brand messaging, building our brand, developing our voice (we lead with help), and the value of our business.&nbsp;</strong></li><li><strong>Thought Leadership: BeneLynk’s leadership team has decades of experience at the intersection of Managed Care and Government Benefit programs. The Marketing Content Writer will produce content such as blog posts, eBooks, articles, etc. that help to build credibility and position BeneLynk as subject matter experts. This will require collaboration with our government relations team, market intelligence, and other team members as needed.&nbsp;</strong></li><li><strong>Product/Solution Positioning: Create middle of funnel content such as sell sheets, brochures, eBooks, etc. that focus directly on selling our products and solutions while giving our audience the ability to evaluate the specific features and benefits of our solution portfolio and how it compares to competitors. In this phase, the Marketing Content Writer will need to develop a high-level understanding of our solutions and underlying technologies.&nbsp;</strong></li><li><strong>Lead Generation: In this phase, the Marketing Content writer will create engaging pieces with a specific call to action (CTA) such as “Register Now” or “Download our Infographic”. Create content such as landing pages, email campaigns, infographics, paid advertising etc. that attracts potential buyers and converts them into leads via form fills that collect prospect’s demographic information to be added to our CRM.&nbsp;</strong></li><li><strong>ROI and Proof Points: Create bottom of the funnel content that illustrates the return on investment and other success stories achieved by our customer base. In this phase, the Marketing Content Writer will work with our market intelligence team and team members from finance to collect data points to create anonymous case studies, testimonials, value calculators, etc.&nbsp;</strong></li></ol><p><strong>QUALIFICATIONS&nbsp;</strong><span>&nbsp;</span><strong>&nbsp;</strong></p><ol><li><strong>Education</strong>&nbsp;– BA/BS or equivalent working experience</li><li><strong>Experience</strong>&nbsp;– 2-5 years’ experience with writing and creating content. Healthcare experience a plus.</li><li><strong>Communication</strong>&nbsp;– phone, email, TEAMS chat and video conferencing</li><li><strong>Work Style</strong>&nbsp;– Collaborative, self-starter with a willingness to learn and implement feedback</li></ol><p class=\"ql-align-justify\"><strong>REQUIREMENTS</strong></p><ol><li>Ability to research, analyze and develop content that will resonate with our intended audience</li><li>Strong attention to detail in copy editing and proofreading</li><li>Must have project management skills that demonstrate the ability to multi-task, prioritize workload, and meet deadlines</li><li>A basic understanding of SEO and how it is impacted by our content (i.e. use of industry keywords and phrases, content relevance, etc.)</li><li>Ability to be proactive and work across teams (government relations, market intelligence, finance, graphic designer) to deliver accurate, timely, and engaging content</li></ol><p class=\"ql-align-justify\"><strong>PHYSICAL DEMANDS</strong></p><p class=\"ql-align-justify\">The physical demands described here are representative of those that must be met by an employee to successful perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ol><li><em>Physical Activities&nbsp;</em>– While performing the duties of this job, the employee is frequently required to remain in a stationary position as well as communicate ideas to others.&nbsp;</li><li><em>Weight Lifted/ Force Exerted&nbsp;</em>– The employee’s job does not require weight to be lifted or force exerted.&nbsp;</li></ol><p class=\"ql-align-justify\"><strong>WORK ENVIRONMENT</strong></p><p class=\"ql-align-justify\">This role is a remote position. Candidate must live in the U.S. and have access to high speed internet.</p><p class=\"ql-align-justify\"><strong>POSITION TYPE/ EXPECTED HOURS OF WORK</strong>&nbsp;</p><p class=\"ql-align-justify\">Part-time /Non-Exempt (Hourly)&nbsp;&nbsp;</p><p class=\"ql-align-justify\"><strong>HOURS</strong></p><p class=\"ql-align-justify\">15-25 hours per week. Hours worked will be determined by the candidate prior to starting the position, and then followed on a routine weekly basis.</p><p class=\"ql-align-justify\"><strong>SALARY</strong></p><p class=\"ql-align-justify\">Based on Experience</p><p class=\"ql-align-justify\"><strong>EMPLOYEE BENEFITS</strong></p><p class=\"ql-align-justify\">We offer competitive salaries and benefits here at BeneLynk, as we truly value our employees and the amazing work that they do each day. Please see below for a list of some of our awesome employee benefits:</p><ul><li class=\"ql-align-justify\">10 Paid Days Annually</li><li class=\"ql-align-justify\">Excellent Growth &amp; Advancement Opportunities</li></ul><p><strong>EMPLOYEE PERKS</strong></p><p><em>Work hard, play hard!</em>&nbsp;Having an engaged workforce and positive work environment is one of our top priorities here at BeneLynk. We do so through numerous initiatives that can be found below. We like to call our virtual work community, “The Bene-Verse”. We also have an internal Culture Ambassador committee dedicated to ensuring all employees have a pleasant and exciting work experience.&nbsp;</p><ul><li class=\"ql-align-justify\"><strong>Monthly Company Town Hall Events:</strong></li><li class=\"ql-indent-1 ql-align-justify\">We love the opportunity to come together as a company. Join us monthly as we discuss exciting company updates, internal promotions, internal awards, upcoming events, and more!</li><li class=\"ql-align-justify\"><strong>Monthly Internal Mental Health Newsletters:</strong></li><li class=\"ql-indent-1 ql-align-justify\">Our Culture Ambassadors spearhead an internal newsletter centered on mental health topics. Our employees’ overall wellbeing is our top priority, so we like to provide support whenever it is needed through this uplifting internal newsletter.</li><li class=\"ql-align-justify\"><strong>Monthly Streaming Services Perk:</strong></li><li class=\"ql-indent-1 ql-align-justify\">&nbsp;Yes- we pay YOU to enjoy the television shows that you enjoy! We pay up to a $12 per month for any streaming service subscriptions that you currently have.</li><li class=\"ql-align-justify\"><strong>Tickets at Work Perk:</strong></li><li class=\"ql-indent-1 ql-align-justify\">Enjoy discounted movie tickets, hotel stays, and more through our company’s ‘Tickets at Work’ perk!</li><li class=\"ql-align-justify\"><strong>Monthly Lunch &amp; Learn Events:</strong></li><li class=\"ql-indent-1 ql-align-justify\">&nbsp;Meet key members of our Senior Management team through engaging Lunch &amp; Learn sessions on a monthly basis. Lunch is on us for those employees that sign up!</li><li class=\"ql-align-justify\"><strong>Monthly Bene-Verse Events:</strong></li><li class=\"ql-indent-1 ql-align-justify\">We put on awesome monthly events for our employees including virtual trivia, team building exercises, guided painting sessions, and more!</li></ul><p class=\"ql-align-justify\"><strong>EEO STATEMENT</strong>&nbsp;</p><p>At BeneLynk, we don’t just accept differences; we celebrate, support, and thrive on them for the benefit of our employees, our products, and the communities that we serve. All employees share in the responsibility for fulfilling this company’s unwavering commitment to equal employment opportunity. BeneLynk is an equal opportunity employer, and as such, employment here is solely based on a person's merit and qualifications directly related to their professional expertise. BeneLynk does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, military status, marital/familial status, pregnancy, or related condition, including breastfeeding, or any other classes protected by law.</p><p>It is BeneLynk’s policy to comply with all applicable federal, state, and local laws pertaining to nondiscrimination and equal opportunity. The company's EEO policy, as well as its affirmative action obligations, includes the full support of the company, including its Chief Executive Officer because it's just the right thing to do and we hope that you think so too.</p><p class=\"ql-align-justify\">If you require reasonable accommodation in completing an application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please direct your inquiries to our HR team at HR@BeneLynk.com.&nbsp;&nbsp;</p><p class=\"ql-align-justify\"><strong>E-VERIFY</strong></p><p class=\"ql-align-justify\"><strong> </strong>BeneLynk participates in E-Verify. We will provide the U.S. Social Security Administration (SSA) and, if necessary, the U.S. Department of Homeland Security (DHS) with information from each new employer’s Form I-9 to confirm work authorization.</p><p class=\"ql-align-justify\">***Offer of employment is contingent upon the results of a required background and drug screening.*** &nbsp;</p><p></p>",
    "apply": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html",
    "company": "/companies/benelynk",
    "cName": "BeneLynk",
    "location": "USA",
    "type": "part-time",
    "category": "copywriting"
  },
  {
    "title": "Business Analyst",
    "description": "<p></p><p>The Enterprise Value Management team within the Finance/Seed Organization is at the forefront of analyzing and providing actionable insights which will accelerate Cigna’s enterprise strategy implementation, with the goal of accelerating value for external stakeholders and creating continuous efficiency and effectiveness internally. Actionable analysis and insights enable decision making for all stakeholders including executives, senior, and working level leaders.</p><p><strong>This role is responsible for:</strong></p><ul><li>Support the ongoing management of an end to end value framework that supports planning, strategy and execution and enables decision making across the growth engines.</li><li><span>Provide analytic insights and recommendations to influence business strategy in partnership with business partners</span></li></ul><p><strong>Responsibilities:</strong></p><ul><li>Collaborate in the establishment and creation of the enterprise value management framework and tools to drive consistency and accountability&nbsp;</li><li>Create complex financial models to support senior leadership through portfolio prioritization and other ad hoc requests</li><li><span>Execute and apply advanced analytical techniques to deploy robust valuation improvements focused on capacity, value, and performance</span></li><li>Provide customized and prescriptive insights and dashboards to Executives, Senior Leaders and Working Level Leaders to empower insight driven decision making</li><li>Manage, support, and partner with other Enterprise Value Management team members through the capital deployment and enterprise portfolio refresh process</li><li>Communicate with transparency and consistency with all stakeholders</li></ul><p><strong>Qualifications:</strong></p><ul><li>Bachelor’s Degree strongly preferred, ideally in Business, HealthCare or other related field</li><li>5+ years’ experience in finance, accounting, actuarial management or similar field preferred</li><li>Experience working with management process under Agile delivery model preferred</li><li>Excellent problem solving and analytical skills with the ability to analyze complex information and draw relevant conclusions</li><li>Comfortable managing multiple priorities simultaneously and quickly adapt to change in focus or priorities</li><li>Ability to think strategically, drive results and implement tactically</li><li>Strong technical skills in data modeling and proficient in use of database tools (Excel/ Access)</li><li>Strong communication &amp; presentation skills with ability to convey complex and technical information to a non-technical audience</li><li>Influence, gain acceptance and work well with matrix partners</li></ul><p><span>For this position, we anticipate offering an annual salary of $90,500 - $150,800, depending on relevant factors, including experience and geographic location.</span>This role is also anticipated to be eligible to participate in an annual bonus plan.</p><p>Helping our customers achieve healthier, more secure lives is at the heart of what we do. While you take care of our customers, we’ll take care of you through a comprehensive benefits program that helps you be at your best. Starting on day one of your employment, you’ll be offered several health-related benefits including medical, vision, dental, and best in class well-being and behavioral health programs. We also offer 401(k) with company match, company paid life insurance, tuition reimbursement, a minimum of 18 days of paid time off per year and dozens of corporate discounts on essentials you use every day. For more details on our employee benefits programs, please visit the “Life at Cigna” tab on our careersite:&nbsp;<a href=\"http://www.cigna.com/careers\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(74, 74, 74); background-color: transparent;\">www.cigna.com/careers</a></p><p><strong>About Cigna</strong></p><p><span>Cigna Corporation exists to improve lives. We are a global health service company dedicated to improving the health, well-being and peace of mind of those we serve. Together, with colleagues around the world, we aspire to transform health services, making them more affordable and accessible to millions. Through our unmatched expertise, bold action, fresh ideas and an unwavering commitment to patient-centered care, we are a force of health services innovation. When you work with us, or one of our subsidiaries, you’ll enjoy meaningful career experiences that enrich people’s lives. What difference will you make?</span><em>Qualified applicants will be considered without regard to race, color, age, disability, sex, childbirth (including pregnancy) or related medical conditions including but not limited to lactation, sexual orientation, gender identity or expression, veteran or military status, religion, national origin, ancestry, marital or familial status, genetic information, status with regard to public assistance, citizenship status or any other characteristic protected by applicable equal employment opportunity laws.</em></p><p><em>If you require reasonable accommodation in completing the online application process, please email: SeeYourself@cigna.com for support. Do not email SeeYourself@cigna.com for an update on your application or to provide your resume as you will not receive a response.</em></p><p></p>",
    "apply": "https://jobs.cigna.com/us/en/job/CIGNUS22009202EXTERNALENUS/Business-Analyst",
    "company": "/companies/cigna",
    "cName": "Cigna",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "RPA Business Analyst",
    "description": "<p></p><p><strong>Description</strong></p><p><strong>Key Accountabilities</strong></p><ul><li>Explore existing business processes through direct observation and questioning of SMEs to capture the current state steps necessary to achieve the desired business outcome.&nbsp;</li><li>Design process solutions (PDDs) utilizing RPA best practices and optimize business processes for efficiency where possible.&nbsp;</li><li>Drive the strategic and tactical roll-out of the solution to RPA customers by creating and documenting test procedures and scenarios.</li><li>Collaborate with the development team to ensure that knowledge of the business processes is clearly transferred to the solution design. Facilitate development questions with SMEs and document clarifications.</li><li>Participate in Agile or similar fast-paced development cycles.</li></ul><p><strong>Competencies</strong></p><ul><li>Ability to understand the business process and create process flow diagrams.</li><li>Exceptional critical thinking skills.</li><li>Strong desire for exploring, evaluating, and understanding new technologies.</li><li>Participate in design discussions and reviews providing the end user perspective.</li><li>Create comprehensive Process Design Documents including:</li><li class=\"ql-indent-1\">Develop “use cases” to ensure usability of products by conducting end-to-end manual test scenarios based on customer usage.</li><li class=\"ql-indent-1\">Evaluate the user experience or ease-of-use through the execution of test plans.</li><li class=\"ql-indent-1\">Gather data from customers or product data internally to recreate or accurately test automation areas.</li><li class=\"ql-indent-1\">Provide research and evaluation of functionality for areas of responsibility as needed.</li><li class=\"ql-indent-1\">Develop and document clear, complete, repeatable test plans. Enhance test plans as needed based off findings of internal and external testing and product utilization.</li><li class=\"ql-indent-1\">Utilize departmental templates, examples, and guidelines.</li><li class=\"ql-indent-1\">Map all requirements and acceptance criteria to functional test plans to ensure completeness of development and testing.</li><li class=\"ql-indent-1\">Provide design feedback to ensure the project definition includes enough features to allow for efficient manual and automated testing.</li><li>Participate in Scrum meetings to provide project updates, share issues that need to be addressed, and receive feedback from others within the teams.</li><li>Meet with Business Management and staff periodically to develop and maintain an understanding of how the clients rely on the functionality of the process being automated.</li><li>Attend training classes for the RPA software to gain new design concept abilities and maintain current design skills.</li><li>Be aware of industry and market changes.</li></ul><p><strong>Success Measures</strong></p><p>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><p><strong>Qualifications</strong></p><ul><li>5+ years of experience within the healthcare revenue cycle industry.</li><li>2+ years of hands-on process improvement, workflow, or technology experience, preferably in a transactional service environment (e.g. healthcare, banking, insurance, etc.).</li><li>Familiarity with RPA technology solutions and required documentation for success.</li><li>Outstanding attention to detail and ability to deliver timely and accurate products in a fast-paced and dynamic environment.</li></ul><p><strong>Special Position Requirements</strong></p><ul><li><strong>Language Skills:</strong>&nbsp;Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to write reports, business correspondence, and technical documentation.&nbsp;Ability to effectively present information and respond to questions from groups of managers, clients, and customers.</li><li><strong>Reasoning Ability:&nbsp;</strong>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.</li><li><strong>Computer Skills:&nbsp;</strong>To perform this job successfully, an individual should have knowledge of Robotic Process Automation technology.</li><li><strong>Other Skills:&nbsp;</strong>High energy level, great interpersonal skills needed for this position.&nbsp;</li></ul><p><strong>Work Requirements</strong></p><p><strong>Physical Demands&nbsp;</strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><p>While performing the duties of this Job, the employee is regularly required to sit; use hands to finger, handle, or feel and talk or hear. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.</p><p><strong>Travel Requirements&nbsp;</strong>The role will require interaction with Subject Matter Experts for observation and discovery of current processes.&nbsp;These processes may be executed within client business offices around the country.</p><ul><li>Estimated Travel: 50% or less of normal business days. No expectation of travel on non-business days.</li></ul><p><strong>Work Environment&nbsp;</strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable&nbsp;accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>The noise level in the work environment is usually quiet.</li></ul><p><strong>Qualifications</strong></p><p><strong><span class=\"ql-cursor\">﻿</span>Experience</strong></p><p><strong>Required</strong></p><p><strong>2 years:</strong>&nbsp;Hands-on Process Improvement, workflow, or Technology Experience</p><p><strong>5 years:</strong>&nbsp;Healthcare Revenue Cycle Industry</p><p>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities</p><p>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)</p><p></p>",
    "apply": "https://recruiting.ultipro.com/MED1023MEDU/JobBoard/a4519e64-6e7e-43bb-bb79-6161047f1528/OpportunityDetail",
    "company": "/companies/meduit",
    "cName": "Meduit",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Business Support Specialist II",
    "description": "<p></p><p><strong>Business Support Specialist II - Church Fundraising</strong></p><p><strong>Overview&nbsp;</strong></p><p>Compassion is looking for a Business Support Specialist II to support the sponsorship events and targeted revenue for the Church Fundraising teams. The specialist generally works independently and will focus on supporting the back end needs to enable the facilitation of sponsorship events and fundraising efforts for Relationship Managers serving high-touch churches in the western US. The specialist may accomplish any or all of the essential functions, or other professional duties of a professional administrative nature, including recommending or making improvements to significant processes and practices. At this career level, they will generally work independently on moderately complex projects or as a team member on larger projects and processes. He or she may coach other specialists.</p><p><strong>What will you do?&nbsp;&nbsp;</strong></p><ul><li>Maintain a personal relationship with Jesus Christ.&nbsp;&nbsp;</li><li>Acts as an advocate to raise the awareness of the needs of children. Understands Christ’s mandate to protect children. Commits to and prioritizes child protection considerations in all decision-making, tasks and activities across the ministry. Abides by all behavioral expectations in Compassion’s Statement of Commitment to Child Protection and Code of Conduct. Reports any concerns of abuse, neglect or exploitation of children through Compassion’s internal reporting process and appropriately supports responses to incidents if they occur.</li><li>Uphold and engage <span>in&nbsp;Compassion’s&nbsp;core </span><a href=\"http://https//www.compassion.com/employment/christian-employment.htm#cultural_behaviors\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"background-color: transparent; color: rgb(88, 183, 223);\">Cultural Behaviors</a>.&nbsp;</li><li>Works primarily in Salesforce to manage all aspects related to sponsorship events to include procuring event materials both digital and physical. Additionally works primarily in Salesforce to support a team of Relationship Managers in their fundraising efforts with large churches in the northeast US.</li><li>Reviews business processes and identifies activities required to address the issues, including process steps and impact assessment to increase productivity and efficiency.</li><li>Prepares and relays communications concerning business operations and outcomes to appropriate audiences to foster understanding and acceptance for initiatives, policies, and practices. Further, supports change integration across projects within the scope of own work. Works to identify change adoption across common audiences as needed.</li><li>May liaise between assigned department and other neighbors.</li><li>Provides meaningful input into the development of effective metrics for ministry operations and maintains data/metrics, dashboards, tools, and artifacts to provide up-to-date status of group projects, processes, and initiatives.</li><li>May develop or contribute to new programs to improve neighbor morale or relations, ministry success, and community stewardship.</li><li>Partners with other groups when required to integrate information and processes across functions. Provides individual contributions and occasional support to various projects as assigned in support of the work of Business Support management.</li><li>May provide expertise to other professionals and support staff in their work group.</li></ul><p><strong>What do you bring?&nbsp;</strong></p><ul><li>Bachelor's<span> Degree&nbsp;Business</span> Administration, Technology, or related <span>discipline.&nbsp;&nbsp;</span></li><li>Three&nbsp;years Professional experience working in business analysis, business intelligence, data analysis, project management or a similar field.&nbsp;</li><li>*Equivalent education, training and/or certification may be substituted for experience and education shown above.&nbsp;</li></ul><p><strong>Why work here?&nbsp;</strong></p><ul><li><span>The mission:</span>&nbsp;Join a team that is motivated to release children from poverty in Jesus’ name.&nbsp;</li><li><span>Our benefits</span>: Receive generous paid time off, 10% contribution to a&nbsp;403(b)<span> retirement&nbsp;fund</span> on top of your salary, excellent healthcare coverage, free short-term professional counseling, and <a href=\"http://https//www.compassion.com/employment/benefits.htm\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(88, 183, 223); background-color: transparent;\">more</a>.&nbsp;</li><li><span>Spiritual growth:</span>&nbsp;Participate in regular chapel services, prayer groups, and department devotionals.&nbsp;</li></ul><p></p>",
    "apply": "https://compassion.wd5.myworkdayjobs.com/en-US/CompassionCareers/job/Remote---USA/Business-Support-Specialist-II---Church-Fundraising_R2379",
    "company": "/companies/compassion",
    "cName": "Compassion",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Business Operations Analyst",
    "description": "<p></p><p>Postman is the world’s leading collaboration platform for API development. Postman's features simplify each step of building an API and streamline collaboration to help create better APIs—faster. More than 20 million developers and 500,000 organizations worldwide use Postman today, including 96% of the Fortune 500. Our customers are doing more and more astounding things with the Postman product every day, and as a result, we are growing rapidly.</p><p>We are seeking a passionate and highly driven individual to join the Revenue Operations team at Postman. The Business Operations Analyst role reports into the Senior Business Operations Analyst. The Revenue Operations team is integral to the success of the Sales and Customer Success organizations by helping to drive revenue, renewals and the productivity of the sales and customer success teams.</p><p>This is a full-time remote position.</p><p><strong>Responsibilities</strong></p><ul><li>Work with the various teams in the Customer Organization including Sales, Success, Solutions, Product and Legal to understand business requirements for processes which need to be implemented in our Salesforce Instance</li><li>Collaboration with subject matter experts and other business analysts to build \"best in class\" solutions and be proponent of measuring the success of those solutions</li><li>Design, develop, test and deploy solutions to the needs of the various teams in the Customer Organization</li><li>Aid in curation and scalability of all supporting process and policy documentation with relation to all Customer Org processes within the Postman Salesforce Instance</li><li>Assist with delivering trainings on all processes, policies, and best practices within the Postman Salesforce Instance</li><li>Work with the Postman Data team to ensure data is appropriately synchronized with our core data store (Amazon Redshift, Looker)</li><li>Monitor all integrations, via APIs/Web Services with other systems we use for customer interaction (such as Outreach, SurveyMonkey etc.)</li><li>Unit / Regression and User Acceptance testing and release management of modifications / updates between environment instances using Force.com IDE or other automated solution</li><li>Migration, bulk upload and bulk update of data using different data tools such as Apex Data Loader, Excel Connector, Import Wizard, SFDC Data Export, Mass Delete etc.</li><li>Generation of reports, dashboards, and customized reports along with analysis of resulting data</li><li>Development of workflow rules with time triggered tasks, email alerts, email templates, and field updates</li><li>Assistance with the management and creation of user roles, profiles, permissions, role hierarchies, public groups, security controls, and shared settings</li><li>Constantly reviewing current processes and configurations and suggesting improvements to continuously achieve sustainability</li><li>Monitor maintenance of data and mitigation of data issues</li><li>Performance of ongoing Salesforce administration activities (accounts, profiles, roles, fields, layouts, data security)</li><li>Maintain technical design documentation based on functional and stakeholders’ requirements</li><li>Regular and clear communication of project status or issues</li></ul><p><strong>Requirements</strong></p><ul><li>3+ combined years of experience with Salesforce Administration with proven track record of successful projects and implementations</li><li>Experience with Lightning Components</li><li>Salesforce Administrator Certification</li><li>Demonstrated experience across Salesforce platform services (Service Cloud, Force.com, AppExchange)</li><li>Prior work experience in an agile based environment</li><li>Experience with unit/regression testing and release management of modifications/updates between environment instances using Force.com IDE or other automated solution</li><li>Experience in all phases of Software Development Life Cycle (SDLC), which involves requirement gathering, requirement analysis, design, development, implementation &amp; enhancement of projects in Salesforce.com</li><li>Proficient in Salesforce data migration using different data tools such as Apex Data Loader, Excel Connector, Import Wizard, SFDC Data Export, Mass Delete etc.</li><li>Experience with Salesforce reports/dashboards and workflow rules</li><li>Experience with creation and management of User Roles, Profiles, Permissions, and Role Hierarchies, Public Groups, Security Controls, and Shared Settings</li><li>Personal computer skills; working knowledge of Microsoft Office (Word, Excel, PowerPoint) and other Internet applications</li><li>Proactive approach and strong communication skills (including written, presentation, and verbal)</li><li>Comfortable with ambiguity and effective with minimal guidance</li><li>Excellent partnering and collaboration skills</li><li>Excellent communication skills</li></ul><p><strong>Nice to Have</strong></p><ul><li>Salesforce Advanced Administrator Certification</li><li>CPQ Specialist Certification</li><li>Two years of experience using Agile methodologies</li></ul><p><strong>What Else? (Remote Benefits)</strong></p><p>We offer competitive salary and benefits, and a flexible schedule working with a fun, collaborative team. Enjoy full medical coverage, unlimited PTO, and a monthly lunch stipend. (Yes, seriously. We want you to eat well wherever you’re at.) Plus, our wellness program will help you stay healthy from your location with fitness-related reimbursements. Our frequent and fascinating virtual team-building events will keep you connected, while our donation-matching program can support the causes you care about. We’re building a long-term company with an inclusive culture where everyone can be the best version of themselves, and we want you to be part of it. Join us, why dontcha?</p><p></p>",
    "apply": "https://www.postman.com/company/careers/business-operations-analyst-5117894003/",
    "company": "/companies/postman",
    "cName": "Postman",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "IT Sr Business Analyst, Regulatory",
    "description": "<p></p><p><strong>IT Senior Business Analyst, Regulatory Affairs (RA) and Clinical Affairs (CA) - REMOTE</strong></p><h5><strong>Job Summary</strong></h5><p>Zimmer Biomet is a global medical technology leader. Our team members are part of a company with a heritage of leadership, a focus on shaping the future, and a mission dedicated to alleviating pain and improving the quality of life for people around the world.</p><p>The Senior IT Business Systems Analyst in this role will work with the business to ensure solutions meet business needs along with architecturally significant functional and nonfunctional requirements. S/he designs, develops, launches, and maintains systems and content authoring tools that support the Regulatory Affairs (RA) and Clinical Affairs (CA) business processes.&nbsp;</p><h5>&nbsp;<strong>Principal Duties and Responsibilities</strong></h5><ul><li>Supports RA &amp; CA Operations and all related administration functions in large-scale global solutions.</li><li>Assess, plan, evaluate, and implement information system support needs for business operations according to policies, procedures, protocols, and standards.</li><li>Responsible for system assessment, process analysis, identification of system requirements, and functional definition of planned system changes.</li><li>Translates business needs, challenges, and context into technical solutions captured in technical diagrams and other documentation.</li><li>Supports formulation of systems scope and objectives relative to the business plan by providing technical guidance concerning the business implications.</li><li>Identify and implement solutions that support more efficient and effective work performance based on inherent knowledge of business functions and processes.</li><li>Understand system behavior, inputs, and outputs as they relate to business functions and ensures new releases function as intended and there is no negative impact to existing functionality.</li><li>Collaborate with other IT and business team members to deliver project objectives and identify system improvements.</li></ul><h5><strong>Expected Areas of Competence</strong></h5><ul><li>apply proven communication, analytical and problem-solving skills to help identify, communicate, and resolve systems issues in order to maximize the benefit of IT systems investments.&nbsp;</li><li>Business applications (e.g. Windchill, CTMS, Electronic Data Capture systems (Oracle RDC, JointAssist, iMedNet, Medidata RAVE))</li><li>Understand system behavior, inputs, and outputs as they relate to business functions and ensures new releases function as intended and there is no negative impact to existing functionality.</li></ul><h5><strong>Education/Experience Requirements</strong></h5><ul><li>Bachelor's degree in Information Technology or related field required with at least 5+ years relative professional experience; OR&nbsp;Bachelor’s and Master’s degree in business, IT or related field with at least&nbsp;4+ years relative professional experience required.</li><li>3+ years of experience with PTC Windchill is required.</li><li>Experience with other PLM systems Teamcenter or Solidworks PDM and clinical affairs is preferred.</li><li>Experience with Thingworx and/or PTC Navigate is preferred.</li></ul><h5><strong>Travel Requirements</strong></h5><p>This is a 100% remote position.</p><p>Up to 20%</p><h5><strong>Additional Information</strong></h5><p>EOE/M/F/Vet/Disability</p><p>At Zimmer Biomet, we believe in The Power of Us, which means that we are stronger together. We are committed to creating an environment where every team member feels included, respected, empowered, and celebrated.</p><p>Zimmer Biomet has earned a spot on Computerworld’s 100 Best Places to Work in IT for 4 years in a row (2018, 2019, 2020, and 2021).</p><p>90000 - 119500</p><p></p>",
    "apply": "https://global3.recruitmentplatform.com/syndicated/lay/jsoutputinitrapido.cfm",
    "company": "/companies/zimmer-biomet",
    "cName": "Zimmer Biomet",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Product Manager - Analytics",
    "description": "<p></p><p>Truveris&nbsp;is a leading digital health company focused&nbsp;on delivering truth and clarity in pharmacy.&nbsp;Truveris’ proprietary technology, coupled with deep pharmacy expertise, helps to build a more efficient market that maximizes choice, accessibility and prescription drug affordability. Our solutions provide the insight and knowledge to help people lead healthier and more productive lives. For more information on our solutions, visit&nbsp;<a href=\"http://www.truveris.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">www.truveris.com</a>.&nbsp;</p><p><em>This position is not eligible to be performed remotely from Colorado.</em></p><p>Truveris is looking for an experienced Product Manager with an analytical background&nbsp;for our Unified Data Platform team. The Product Manager will work closely with product management, analysts, and engineering to deliver new capabilities and enhancements for all products that have data flowing through the platform. This position will be responsible for writing user stories and conducting research as well as gathering data and qualitative insights to evolve roadmaps from high-level requirements to achievable steps within the Truveris product development lifecycle process.&nbsp;</p><p>In addition to this, the Analytics Product Manager will also be responsible for working with the Data and Analytics team, understanding the methodologies, and converting them into actionable user stories as directed and dictated by the roadmap. This position will also assist in assessing the quality of data and determining requirements to help our analysts to get to scale on our new platform. The ideal candidate will be a hands-on product manager who enjoys the detailed work involved in analytic development and who is also skilled at abstracting this work to the goal of building a scalable platform.</p><p><strong>Responsibilities</strong></p><ul><li class=\"ql-indent-1\">Lead in the product process by gathering user requirements, writing user stories, and working with engineering on the delivery of product features and functions</li><li class=\"ql-indent-1\">Maintain a product backlog with product owners/ managers and engineering leaders</li><li class=\"ql-indent-1\">Own the release planning and release process with product owners/ managers and the PMO</li><li class=\"ql-indent-1\">Become the authority in feature planning and ensuring proper components are released in liaison with other Product Managers across the organization</li><li class=\"ql-indent-1\">Develop product documentation such as: release notes, internal wiki pages, and training materials for system functionality and analytics to help promote the broader team's product knowledge</li><li class=\"ql-indent-1\">Define new analytic product features</li><li class=\"ql-indent-1\">Identify, analyze, and evaluate the suitability of existing data to support proposed analytics/models and identify any data gaps</li><li class=\"ql-indent-1\">Conduct analyses to define appropriate benchmark analytics</li><li class=\"ql-indent-1\">Participate in Methodology Governance&nbsp;</li><li class=\"ql-indent-1\">Present and review prospective analytic algorithms and models&nbsp;</li><li class=\"ql-indent-1\">Actively participate in aligning methods for scalability and consistency&nbsp;</li><li class=\"ql-indent-1\">Review requests from product management for future analytic features and brainstorm on analytic research to be conducted&nbsp;</li><li class=\"ql-indent-1\">Guide developers on algorithms/model specifications to facilitate accurate and timely inclusion of the new analytic features in the platform</li><li class=\"ql-indent-1\">Perform analytic testing of new algorithms/models to ensure implementation into the Platform is accurate and covers edge cases.</li><li class=\"ql-indent-1\">Gather data and qualitative insights from the data science and operations teams</li><li class=\"ql-indent-1\">Work with subject matter experts across disciplines to provide recommendations on product features</li></ul><p><strong>Qualifications</strong></p><ul><li class=\"ql-indent-1\">A minimum of 3-5 years' experience in working with Agile teams in developing high-quality healthcare analytic products</li><li class=\"ql-indent-1\">Experience in working in the healthcare or pharmaceutical industry is a must</li><li class=\"ql-indent-1\">Experience with SQL and Python</li><li class=\"ql-indent-1\">Experience with using JIRA, Confluence, or other project management tools</li><li class=\"ql-indent-1\">Experience in working with and wrangling data from AWS S3 buckets</li><li class=\"ql-indent-1\">Experience with additional AWS Services such as Amazon EMR and AWS Lambda is a plus</li><li class=\"ql-indent-1\">Experience with managing code repositories (using Github or Bitbucket) is a plus</li><li class=\"ql-indent-1\">Experience in working with Data Lake or Data Warehouse is a plus</li><li class=\"ql-indent-1\">Excellent communication and documentation skills</li><li class=\"ql-indent-1\">Ability to thrive within a cross-functional collaborative environment with analysts, developers, and product management</li></ul><p>Truveris provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by&nbsp;<a href=\"https://url.emailprotection.link/?bVyFTIgmzgl_ROpk1U4VzElbXV0hz79TWw1hs2ga_WwVdbhmI50h-i6U26TQUyOGQjN-N1kNiydjDWhbF7cOxmvZrlqfaFhH7FkitqqxhJvefSfz94vhp6OwZaPba5Rcr9QjH0FHe2dFgnLaogBmdWP4lybJUcu7Ox992cZBWNBo~\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">federal, state or local laws</a>.</p><p>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p><p>Please review our&nbsp;<a href=\"https://truveris.com/privacy-policy/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">CCPA/CPRA policies here</a>.</p><p></p>",
    "apply": "https://jobs.lever.co/truveris/2e8f4d0c-428e-4457-b465-eb7775f1d8f0",
    "company": "/companies/truveris",
    "cName": "Truveris",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Head of Product",
    "description": "<p></p><h4><strong>Description</strong></h4><p>A new era has begun in private equity - with leading players increasingly looking to broaden their investor base to include smaller investors and reduce dependency on large, demanding and sometimes competing institutional LPs. And that is what we set out to do in 2019 - we provide an easy to use digital platform, enabling top-tier private equity funds access to capital from private, smaller institutional investors.</p><p>We're now a fully remote team of 80+, with hires from UBS, Bain &amp; Co, BCG Digital Ventures and more, and we've already opened up a pool of $50tn underserved capital - we're scaling this year to do even more, and looking for talented folk to join us on our journey.</p><p><strong>What is the role?</strong></p><p>We're looking for a demonstrated product leader with experience building market-leading products, recruiting, developing and hiring a product team, and creating a product-first culture within a growing start-up. In this role you'd take ownership of the delivery of our product roadmap, reporting into our CPO, as we scale and build a world-class product organisation.</p><p><strong>You will be:</strong></p><ul><li>Driving delivery of new product features according to the roadmap, collaborating with development, QA and design teams</li><li>Leading and mentoring the product team, offering feedback and actions to help them grow and perform at their best</li><li>Championing the voice of the customer, leveraging research, data insights and feedback to create actionable plans</li><li>Providing updates and reports where needed to senior management</li><li>Utilising your wealth of expertise to unblock teams where needed, to ensure we keep momentum and pace</li><li>Effectively recruiting amazing talent to help build a great team</li><li>Championing Titanbay where possible, through thought leadership, events and more</li></ul><h4><strong>Requirements</strong></h4><ul><li>Previous experience in a Head of Product or Lead PM role with a high growth B2B tech company, ideally having taken a vision from infancy to development</li><li>A track record of sculpting and delivering strategic improvements to a product to exceed customers expectations - we'll expect you to demonstrate multiple complete product cycles from inception to success, showing the material impact to business outcomes</li><li>Excellent presentation skills, able to inspire and motivate attendees at internal and external events; and the ability to persuade and influence stakeholders internally</li><li>Ability to reach and coach product management skills, having previously nurtured individuals to success in previous roles, and previous experience hiring and building a high-calibre team</li><li>Ability to prioritise effectively, with excellent time management and organisational skills</li><li>Experience working closely with development teams to build great products</li><li>Comfort working as part of a remote distributed team</li><li>A collaborative approach to work, able to form close relationships with the rest of the team</li></ul><h4><strong>Benefits</strong></h4><p>We're a growing start-up, and we are building for the future - part of our 2021 remit will be to expand our benefits programme.</p><p>Current benefits:</p><ul><li>28 days annual leave plus bank holidays</li><li>Private health insurance</li><li>8% pension access via NEST on completion of probation</li><li>Wellness offerings</li><li>Annual company offsite</li><li>Gym access in London</li><li>Flexible working</li></ul><p>Titanbay does not discriminate on the basis of race, sex, colour, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.</p><p></p>",
    "apply": "https://apply.workable.com/titanbay/j/A557173A68/",
    "company": "/companies/titanbay",
    "cName": "Titanbay",
    "location": "UK",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Director of Product Management",
    "description": "<p></p><p>WireWheel is revolutionizing the area of privacy and data protection by helping companies to build and manage cutting-edge and scalable privacy programs. Recognized by IDC Marketplace, Forrester, and Gartner as a leader in worldwide data privacy management software, our cloud-based Data Privacy &amp; Protection Platform is built by privacy experts using industry best practices to help organizations simplify, structure, and automate their approach to privacy program management.&nbsp;We help companies comply with today’s California Consumer Privacy Act (CCPA) and EU General Data Privacy Regulation (GDPR) requirements and remain ready for any future regulatory regimes.</p><p>We are currently looking for a&nbsp;<strong>Director of Product Management</strong>&nbsp;to join our team, and help shape and execute on the product vision and strategy of our Privacy SaaS platform.&nbsp;This is a multi-disciplinary role that focuses on the Product team’s mission of delivering a valuable product that customers love. Candidates will need to feel equally comfortable working directly with clients, performing market research, working with developers on feature definition, or jumping in to help with customer support issues.&nbsp;&nbsp;</p><p>A successful candidate will have the ability to shepherd an idea into a powerful new capability by balancing market factors, client feedback, technical scope, and user experience.</p><p><strong>This means you will:</strong></p><ul><li>Own the vision and roadmap for the product. Determine key product initiatives and development milestones. Make critical allocation decisions.</li><li>Lead a team of product managers to success. Make hiring decisions, manage performance, provide ongoing coaching.</li><li>Define and measure successful business outcomes. Benchmark against the competition. Assume accountability for results while delegating decision-making authority to individual PMs.</li><li>Understand user and customer pain points, translate them to broad product solutions, phase solutions to deliver incremental business value. Elegantly deal with resource and time limitations.</li><li>Act as a mentor across the product management team and the company. Proactively identify root issues and address them with little or no oversight.</li><li>Represent your product to high-profile executives inside and outside WireWheel. Participate in strategic client and partner presentations.</li></ul><p><strong><em>What we are looking for:</em></strong></p><ul><li>Demonstrated ability to define a product vision and strategy to realize it</li><li>6+ years experience working with enterprise-level customers in both customer support and success roles as well as a market researcher or working with SaaS deployments in enterprise environments</li><li>5+ years prior experience working with the full SaaS Product Management lifecycle (from idea to launch to scaling and later sunsetting a product) tools and techniques</li><li>3+ years experience managing people, ideally product managers, designers and/or engineers</li><li>Comfortable authoring and maintaining documentation</li><li>Experience and acumen working with quantitative models, especially related to forecasting</li><li>Comfortable working as well with senior members of the team as well as demonstrated experience working at fine-grain detail with high-caliber engineering and design teammates</li><li>Familiarity with competitive analysis and benchmarking techniques</li><li>Willing to roll your sleeves up to keep releases on schedule</li><li>Strong release management experience using a ‘working in an Agile product development’ process</li><li>Strong product UX design abilities</li><li>Ability to understand the product implications of technical architecture and implementation decisions</li></ul><p><strong>Bonus Points For:</strong></p><ul><li>Domain expertise in big data analytics and cloud architectures, API or data integration, or data science/machine learning enterprise SaaS and/or data security product line experience</li><li>Experience in both startup and enterprise product management</li><li>Prior experience in sales engineering, technical consulting, solution architecture or software engineering</li><li>Familiarity with value engineering or other quantitative prioritization models</li></ul><p><em>People are what make WireWheel awesome! Regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics, we want everyone to feel welcome. We are committed to building a diverse and inclusive equal opportunity workplace everyone can call home.</em></p><p></p>",
    "apply": "https://boards.greenhouse.io/wirewheel/jobs/5963521002",
    "company": "/companies/wirewheel",
    "cName": "WireWheel",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Director of Product Management",
    "description": "<p></p><p><strong>About Sundae</strong></p><p>Sundae’s mission is to help homeowners get the best outcome when it’s time to sell a house that needs some love. For too long, the process of selling outdated and damaged houses has been terrible for sellers. Local property investors capitalize on homeowner distress to purchase houses cheaply and resell them for huge profits.</p><p>Sundae is putting more of those profits back in the hands of the homeowner. We’ve developed a model to predict when sellers will need our help, and a best-in-class sales and marketing team to reach them and a trusted brand that allows us to grow even faster through word of mouth and referrals. With scale and efficiency, we’re able to redistribute economic value to sellers in the form of the most competitive price so that Sundae can become the largest buyer of homes that need love in the United States.</p><p>We are a Tier 1 Venture Capital backed&nbsp;company&nbsp;with product-market fit, scaling revenue, and a massive addressable market opportunity. Our team is composed of seasoned leaders from real estate and marketplace businesses and with significant high-growth company experience (Airbnb, Dropbox, Chime, LendingHome).</p><p>Joining Sundae means being part of the team that’s bringing compassion and transparency to the business of helping homeowners sell in their time of need. If you’re driven by making a positive impact on people’s lives and want to support our mission, we’d love to hear from you.</p><p><strong>About the Role</strong></p><p>We are looking for a product leader to drive the strategy and execution of an amazing product experience and optimal business outcomes for one side of Sundae’s unique two-sided marketplace. In this role you will collaborate with leaders from UX, Engineering, Product Marketing, and Operations to establish tactical and strategic objectives, identify problems and solutions, and establish and evangelize a roadmap. You will work with and nurture several teams to execute and iterate on different layers of the product, segments of the market, phases of the customer’s journey, and channels of engagement.&nbsp;</p><p>The Sundae team is a collection of unique skills, passions and superpowers that together make us a very capable team. We highly value curiosity, risk-taking, measurement, analytics, innovative thinking, empathy, and above all, a relentless focus on our customers. Our mission of compassion drives us to innovate experiences, business models, and technology; we are not afraid to rethink the way the real estate market serves the needs of the consumer. If you want to work in an incredibly fast paced, compassionate, and innovative environment, come join us!</p><p><strong>Responsibilities</strong></p><ul><li>Deeply understand the needs and behavior of our demand-side customers&nbsp;through interaction with customers, partners, and internal stakeholders.&nbsp;</li><li>Deeply understand Sundae’s marketplace business such that you can achieve marketplace objectives in parallel with your customer’s objectives.&nbsp;</li><li>Partner with a cross functional team of peers and stakeholders to set and prioritize goals and systematically drive to achieve those goals through planning, execution and iteration.</li><li>Collaborate with and nurture multiple product teams such that these teams have ownership of solving problems, while being coordinated to achieve higher level business objectives.</li><li>Drive both analytical and qualitative feedback loops that keep teams in constant understanding of performance, opportunities for improvement, and poised for executing and learning from experiments.&nbsp;&nbsp;</li><li>Over communicate roadmap and timelines to keep stakeholders aligned and the broader organization excited about the future.</li></ul><p><strong>About You</strong></p><ul><li>Expert project management, coordination, communication, and product analytics skills</li><li>Experience in establishing and scaling product development frameworks, inclusive of UX, product research, and cross functional stakeholders.</li><li>Experience nurturing teams</li><li>Comfortable with ambiguity and setting direction in a fast-paced, constantly evolving environment</li><li>Be curious, action, and solution oriented</li></ul><p><strong>Qualifications</strong></p><ul><li>10+ years of direct product management experience</li><li>Bachelor’s degree in engineering, economics, science, or information systems</li><li>Advanced degrees and certifications a plus</li></ul><p><strong>Why Sundae?</strong></p><ul><li>Opportunity to revolutionize the real-estate industry with a mission to help those in need&nbsp;</li><li>Scale with a rapidly growing organization, with tons of opportunity for growth</li><li>Work with a team of fun and motivated individuals in a highly collaborative culture</li></ul><p><strong>Compensation &amp; Benefits&nbsp;</strong></p><ul><li>Competitive cash salary</li><li>Stock option package&nbsp;</li><li>Extremely competitive health benefits - 100% medical, dental, vision coverage</li><li>Retirement benefits including pre- and post- tax options</li><li>Unlimited PTO</li><li>Work Remotely with home office allowance and cell and internet stipend</li></ul><p>We here at Sundae strive to build a workforce composed of individuals with diverse backgrounds, abilities, minds, and identities that will help us to grow, not only as a company, but also as individuals. Sundae is an Equal Opportunity Employer.</p><p>Where permitted by applicable law, employees must have received or be willing to receive the COVID-19 vaccine by date of hire. Reasonable accommodations will be considered.&nbsp;</p><p>Follow us on<a href=\"https://www.linkedin.com/company/sundaehq\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(220, 56, 88);\"><strong>&nbsp;LinkedIn</strong></a></p><p>Watch our<a href=\"https://www.youtube.com/watch?v=1PziMGJqMbY&amp;t\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(220, 56, 88);\"><strong>&nbsp;overview video</strong></a></p><p>Watch our<a href=\"https://www.youtube.com/watch?v=C8Bjy5dAiw0\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(220, 56, 88);\"><strong>&nbsp;customer testimonial</strong></a></p><p></p>",
    "apply": "https://boards.greenhouse.io/sundae/jobs/5987623002",
    "company": "/companies/sundae",
    "cName": "Sundae",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Product Owner, Billing",
    "description": "<p></p><p><strong>Product Owner, Billing</strong></p><p>Zedge seeks an experienced Product Owner to join our fast-paced organization. If you have a gift for thinking outside the box, enjoy solving difficult problems, and working with diverse agile teams, we want your help to keep us moving quickly as we scale our organization.</p><p>Product Owners at Zedge represent the customer at all stages of our development process, and are responsible for transforming the high-level vision of Product Managers into detailed requirements for our development Tribes. To do this, they work closely with a range of stakeholders for the product, including finance, marketing, and others to ensure all requirements for new development initiatives are clearly defined and communicated. Product Owners then groom the resulting tasks in JIRA, prioritize the backlog, and run all the SCRUM ceremonies for their Tribe: sprint planning sessions, daily stand-ups, sprint retrospectives, and initiative postmortems. They also participate in weekly Scrum of Scrums sessions for all Tribes, and are members of the Product Steering Group that approves and prioritizes new initiatives.</p><p>To succeed in this role, you must be a natural-born leader with a talent for project coordination and delegation. You will work closely with other members of the product management team, UX designers, your software development tribe and other groups across our organization to complete initiatives and launch products that require coordinating the efforts of multiple employees. You will identify dependencies and blockers, ensure they are resolved efficiently, and drive your tribe to complete all its work on schedule and within budget.</p><p>As Product Owner of Zedge’s Billing Tribe, you will support multiple Product Managers and other stakeholders across a variety of Zedge products, on any and all initiatives that have any monetization components. You should have experience managing multiple complete product development cycles, possess superior analytical abilities and expert product judgment. A successful candidate will have a technical background, strong analytical and problem-solving skills, as well as great project management and communication competencies.</p><p><strong><u>Responsibilities</u></strong></p><p>⚡️ Collaborate across teams and with architects and other leaders to identify the best technical solution for a given feature or capability, always keeping customer needs foremost</p><p>⚡️ Turn Product Managers’ and other Stakeholders’ high-level goals for product enhancements into detailed user stories</p><p>⚡️ Fully document those user stories in JIRA and Confluence, ensuring all stories have clear acceptance criteria</p><p>⚡️ Lead grooming sessions to maintain a consistently up-to-date backlog of tasks</p><p>⚡️ Work with Product Managers and technical leads to groom that backlog, plan sprints and set team priorities</p><p>⚡️ Run all the Tribe’s SCRUM ceremonies: sprint planning, stand-ups, and retrospectives</p><p>⚡️ Participate in all cross-product ceremonies: Scrum of Scrums, Product Planning, Product Steering</p><p>⚡️ Track your team’s progress towards sprint goals and realign the team’s focus each week in order to complete the highest priority deliverables on schedule</p><p>⚡️ Participate in process improvement activities</p><p><strong><u>Qualifications/Requirements</u></strong></p><p>💪 Bachelor’s degree in Software Development, Product Management (Product Manager), or equivalent experience required</p><p>💪 Minimum 3+ years of relevant work experience in mobile app and/or web development</p><p>💪 Minimum 3+ years’ experience with billing and reporting systems</p><p>💪 Minimum 3+ years’ experience in a role exhibiting excellent written and oral communications, effective interpersonal skills, project management, and strong formal presentation abilities</p><p>💪 Exceptional leadership, time management, facilitation, and organizational skills</p><p>💪 In-depth knowledge of Agile methodologies and Atlassian products (JIRA, Confluence)</p><p><strong><u>We offer:</u></strong></p><p>💰 Monthly compensation of EUR 3000-5000 gross</p><p>🧑🏻‍💻 Very little technical debt - we write most of the software from scratch, constantly learn and use the newest technologies</p><p>🏡 We are remote-first, and we will continue to be - there is no need to go to the office, but you can choose what's best for you</p><p>🎈 Perks:</p><ul><li>🩺 Private health insurance (that includes gym, mental health and many more things);</li><li>🪑 Home office budget (whatever you need – noise-canceling headphones, gaming chair, etc.);</li><li>🤓 Learning budget (a solid amount that can be spent, using up to 10% of your working time);</li><li>📚 Free books of your choice;</li><li>🎉 Extra day-off on your birthday;</li><li>🏢 24/7 access to our office located near the city center.</li></ul><p><strong>Only selected candidates will be informed.</strong></p><p></p>",
    "apply": "https://zedge.breezy.hr/p/397be26d68dc01-product-owner-billing",
    "company": "/companies/zedge",
    "cName": "Zedge",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Move-In Coordinator",
    "description": "<p></p><p><strong>What we do and why we do it</strong></p><p>As the leading marketplace for single-family rental homes, our mission is to make real estate investing radically accessible, cost effective, and simple. We successfully merge our passion for helping investors build wealth through real estate with cutting edge technology that transforms the way they do it.</p><p><strong>How it’s going (and growing)</strong></p><p>With a talented team of 500+ Roofsters, our collaborative and can-do culture is what fuels our growth. We recently closed on our series E, raising nearly $400 million, and have offices in California, Texas, and New York as well as many remote opportunities. Our growth includes recent acquisitions of Great Jones (full-service property management) and Stessa (financial management software) to empower customers with a seamless way to acquire, manage, and track their investment properties on one platform.</p><p><strong>Under our roof</strong></p><p>We get a lot of attention for our innovation—like being on the Forbes Fintech 50 and Red Herring 100—but we’re most proud of being recognized as a Great Place to Work® (Check out our reviews!). We’re nice, get things done, and have fun. We champion professional growth&nbsp;<em>and</em>&nbsp;work-life balance. In fact, our values are B.A.D.A.S.S.</p><p><strong>B</strong>e customer obsessed.</p><p><strong>A</strong>ct like an owner, because you are one.</p><p><strong>D</strong>on’t be afraid to break things in the pursuit of better.</p><p><strong>A</strong>ll of us are empowered to do the right thing.</p><p><strong>S</strong>tay curious and create what’s next. Fast.</p><p><strong>S</strong>eriously. No jerks.</p><p>As a Move-In Coordinator, you will be the direct contact to each of our future residents and responsible for delivering a positive move-in experience for the new resident. Move-in Coordinators are to update and maintain our systems with accurate and timely information. This includes lease agreements, key lease dates, move-in notes and conversations with a future resident. The move-in coordinator will perform daily workflow tasks and ensure all contact points are made on each account within the target timeframe. The key goal for each account is to be able to provide access to their new home while also providing an excellent move-in experience.</p><h3><strong>What You Will Do:</strong></h3><ul><li>Manage the day-to-day customer service needs of all prospects and residents. Provide clear communication, both verbal and written to all prospects and residents.</li><li>Provide backup support to team members when needed or directed by their Manager.</li><li>Oversee and ensure a seamless transition from resident application approval through move-in.</li><li>Provide excellent customer service while making each call as efficient as possible.</li><li>Understanding and being compliant with any market-specific requirements for each account</li><li>Ensure collection of security deposits, pet fees, third-party policies, and or other move-in funds.</li><li>Prepare lease agreements with detail specific verbiage</li><li>Handle any other projects that may be designated by the manager.</li></ul><h3><strong>What You Bring With You:</strong></h3><ul><li>Excellent verbal and written communication skills</li><li>2 years experience related to leasing coordination, property management, or real estate preferred.</li><li>Ability to prioritize and re-prioritize as situations and needs change throughout the workday</li><li>Ability to multi-task and organize workflow to manage daily responsibilities</li><li>Excellent teamwork and interpersonal skills required</li><li>Ability to work under deadlines and specific time frames</li><li>Ability to develop and maintain positive working relationships with internal and external customers</li><li>Minimum job requirements:</li><li><strong>High School diploma (Bachelor’s degree preferred)</strong></li></ul><p>#INDLRS</p><p><strong>For our regular full-time roles we offer a great benefits package!</strong></p><ul><li>Competitive compensation</li><li>Medical, Vision and Dental for you (95%) and your dependents (65%)</li><li>401k</li><li>Flexible time off and sick days</li><li>Supplemental bonus to support “work from home” office needs</li><li>Equity incentives to give you a stake in the Company’s future</li><li>We are an upbeat and collaborative work culture</li><li>Virtual company-sponsored outings</li></ul><p><em>Roofstock is an equal opportunity employer. In keeping with the values of Roofstock, we make all employment decisions including hiring, evaluation, termination, promotional and training opportunities, without regard to race, religion, color, sex, age, national origin, ancestry, sexual orientation, physical handicap, mental disability, medical condition, disability, gender or identity or expression, pregnancy or pregnancy-related condition, marital status, height and/or weight.</em></p><p></p>",
    "apply": "https://jobs.lever.co/roofstock/ab8d1196-50ea-483c-88a6-2440caf5ec8d",
    "company": "/companies/roofstock",
    "cName": "Roofstock",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Service / Call Center",
    "description": "<p></p><p>Kelly? Professional &amp; Industrial, we're passionate about helping you find a job that works for you<strong>.&nbsp;</strong>We're seeking full-time&nbsp;<strong>Remote Customer Service Representatives</strong>&nbsp;for our client, one of our top clients, one of the largest eye-wear companies in the world located in&nbsp;<strong>Mason, OH!</strong>*Immediate Consideration, Virtual Interviews are being held ASAP*<strong>*****NOTE: Must live within one hour driving distance from MASON, OH***Pay:</strong>&nbsp;$16.00<strong>Paid Training Schedule:</strong>&nbsp;Monday-Friday - 8:30am-5:00pm for first 1.5 to 2 weeks (paid training)<strong>Hours of Operation/Business hours:</strong>&nbsp;Monday through Friday - 8:00am-9:00pm (Work schedule will fall between these hours, work schedule will be assigned after training is completed)Saturday - 9:00am - 7:00pm with a weekday off if assigned to work a Saturday<strong>***NOTE: Remote Local- Must live within one hour driving distance from Mason, OH***GENERAL FUNCTION</strong>The Customer Service Representative provides high quality multi-channel (telephonic, chat, email, social media, US mail) support and problem resolution to customers each day, in a manner that meets or exceeds defined department objectives to protect and increase Retail revenues and enhance the overall customer experience. Additionally, the Customer Service Representative initiates the escalation process for unresolved customer problems.</p><p><strong>MAJOR DUTIES AND RESPONSIBILITIES</strong></p><ul><li>Assists customers telephonically and non-telephonically with service and support issues.</li><li>Resolves problems utilizing department tools, resources, business judgment and expertise, and appropriate partnerships with field/stores resulting in increased customer satisfaction and retention.</li><li>Acts as a positive role models by demonstrating continuous performance improvement, solid business skills and support of department and company objectives.</li><li>Ensures productivity, revenue generation, and quality levels are met to meet and exceed customer expectations</li><li>Uses courteous and professional language.</li><li>Works effectively in a team environment.</li><li>Creates a win-win resolution to problems.</li><li><strong>BASIC QUALIFICATIONS</strong><strong>Must live within one hour of Mason, OH</strong></li><li>High School or GED REQUIRED (Associates Degree preferred)</li><li>1+ years' experience in high-volume call center</li><li>Retail store/field experience a plus</li><li>Ability to produce quality and professional written correspondence with customers</li><li>Ability to demonstrate and perform basic math</li><li>Customer service orientation</li><li>Must have high speed internet, and able to connect hard wire/NO hot spot/WIFI</li><li>Intermediate PC knowledge, working knowledge of Windows operating systems, proficient with Microsoft Office, fluent with Internet and mainstream web browsers</li><li>Commitment to providing resolution to customer issues on the first contact</li><li>Strong English comprehension and a good command of grammar</li></ul><p><strong>Important information:</strong><span>This position is recruited for by a remote Kelly office, not your local Kelly branch. Please apply to this job posting to be considered for this position. If you have any questions, please contact the recruiter at lisa.monsivais@kellyservices.com.</span></p><p></p>",
    "apply": "https://www.adzuna.com/details/3117270290?a=e&ccd=bf1e8d2ba274e1a3abc55aec3e4e28f1&chnlid=2736&frd=67fe6f63cb06be831eb1c8d604a4c73e&i=CnIESEDR7BGmIptOz5_hNA&partnerb=1&r=9613223",
    "company": "/companies/kelly",
    "cName": "Kelly",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "RSS Helpdesk Agent",
    "description": "<p></p><p>Cayuse Commercial Services (CCS) delivers fresh solutions to business challenges in the technology and business services environment. Services available are application development, business process outsourcing, data services, and professional services. Cayuse helps clients to achieve impactful outcomes such as improved efficiency, reduced cost, increased profitability and accelerated time to market.</p><p><strong>SUMMARY:</strong></p><p>The RSS Help Desk Agent provides customer service solutions within service level agreements using company and project quality and quantity standards. It includes providing prompt, reliable, and accurate information to customers while maintaining effective communications. All duties and responsibilities will be performed in accordance with the Mission, Vision and Core Values of Cayuse.</p><p><strong>NOTE**</strong></p><ul><li><strong>- PART TIME - 29 HOURS.</strong></li><li><strong>- FULL TIME - 40 HOURS. *Ask me about the shifts</strong></li></ul><p><strong>RESPONSIBILITIES:</strong></p><p>Duties</p><p>? Provides high-quality customer service to the client, responding to requests and issues accurately and promptly.</p><p>? Operates within established guidelines and procedures to independently deliver a full range of services to the customer.</p><p>? Matches client needs with current products and services and suggests new ones to target client's unmet needs.</p><p>? Uses examples and analogies as appropriate to facilitate understanding.</p><p>? Ability to document work clearly and accurately.</p><p>? Other duties as assigned.</p><p>Problem Solving</p><p>? Provides assistance and information to the customer in a prompt manner.</p><p>? Manages continuous improvement through ongoing collection of data and information regarding customer requirements.</p><p>? Understand and responds to others' using active listening skills and tactful communication.</p><p>? Ability to perform first-line troubleshooting for customer.</p><p>? Ability to resolve issues following the parameters and guidelines of the client.</p><p>Accountability</p><p>? Contributes to the accomplishments of team objectives; works collaboratively as a team member towards solutions; solicits input from other team members; demonstrates respect for the ideas and opinions of others; employs trust and openness.</p><p>? Ensures customer satisfaction through follow up and special efforts.</p><p>? Assist new employees with training through shadowing opportunities and explanation of work process.</p><p><strong>MINIMUM QUALIFICATIONS:</strong></p><p>Education / Experience</p><p>? Requires a high school diploma or equivalent</p><p>Technical Knowledge</p><p>? Ability to change system settings via control panels or system preferences</p><p>? Foundation in Microsoft applications</p><p>? Ability to navigate common user interface elements, including opening and closing windows, navigation of the file structures through volumes and folders, launch and quit applications, select portions of text or other items using the mouse, copy/cut and paste text, save and print documents</p><p>? Sound analytic and cognitive ability to troubleshoot technical problems.</p><p>Additional Abilities</p><p>? Must be able to pass a background check. May require additional background checks as required by projects and/or clients at any time during employment.</p><p><strong>DESIRED QUALIFICATIONS:</strong></p><ul><li>Prior call center or help desk experience</li></ul><p><strong>After the interview:</strong></p><p><strong>Training hours:</strong>&nbsp;(according to where you live)</p><p>8am - 1pm&nbsp;<strong>PST&nbsp;</strong>10am - 3pm&nbsp;<strong>CST</strong>&nbsp;11am - 4pm&nbsp;<strong>EST</strong></p><p><strong>Normal operating hours Mon-Sun;</strong></p><p>Mon - Fri 4:30AM to 9PM Pacific Time, East Coast 7:30am - 12pm</p><p>Saturday 5AM to 9PM Pacific Time, East Coast 8am - 12pm</p><p>Sunday 7AM to 9PM Pacific Time.\" East Coast 10am - 12pm</p><p><strong>WORKING CONDITIONS:</strong></p><p>? Normal physical conditions</p><p>? General home environment</p><p>? Must be able to sit for long periods of time looking at computer screen</p><p>? May be asked to work a flexible schedule which may include holidays</p><p>? May be asked to travel for business or professional development purposes</p><p>? May be asked to work hours outside of normal business hours</p><p>As an equal opportunity employer, Cayuse Commercial Services is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact our Recruiting Department at (541) 278-8200 for assistance.</p><p><br></p><p></p>",
    "apply": "https://www.adzuna.com/details/3114321711?a=e&ccd=886ae2443111bea670ba697b77d881da&chnlid=2736&frd=75383a137714fa4fcc842e03303dfef3&i=1OQE6D_R7BGw51cHh6JnKw&partnerb=1&r=9613223",
    "company": "/companies/cayuse-holdings",
    "cName": "Cayuse Holdings",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Manager, Engagement Management",
    "description": "<p></p><p>Our customers are on a journey and you are their sherpa. You get the complexities of balancing the delivery of information technology to a business while at the same time protecting that business from itself and its adversaries. Expel's goal is to create space for our customers to do what they love about security. Our mission is to understand what \"create space\" means and help and encourage them to achieve it.</p><p>We believe it's important to \"meet our customers where they are,\" whatever that might entail based on where they'd like to take their security. You help us achieve exactly this! A rich background with security technology and understanding of security operations will be invaluable as you form the bridge between our SOC and our customers. A penchant for throwing down the ideal meme at the right time in a shared Slack channel will earn you bonus points. And your ability to take everything you hear and make other parts of our business better will ensure you remain an invaluable member of our team.</p><p>As a Manager of Engagement Management you provide leadership and guidance to a team of Engagement Managers as they execute on Expel's mission. You provide day-to-day management to members of your team, including setting goals, reviewing deliverables and providing coaching.</p><p>Does any of this resonate with you? If so, we'd be delighted to hear from you! And if you're thinking the chances of quotes like the one above won't happen ... ah, sorry to disappoint, but those are actual customer quotes.</p><h3><strong>What Expel can do for you</strong></h3><ul><li>Deepen your expertise in the security market and how organizations mitigate risk, execute strategy, and improve their security posture</li><li>Provide hands on experience with industry leading security technologies and analysis methodology</li><li>Provide opportunities to practice communication at technical, management, and executive audiences</li><li>Extend your network of security leaders across a wide variety of industries</li><li>Equip you with the time and opportunities to achieve some remarkable experiences for your next role at Expel or beyond</li><li>What you can do for Expel</li><li>Provide day-to-day management for team members, including goal setting, 1:1s, performance reviews and mentorship.</li><li>Ensure customer expectations are aligned with existing service delivery and roadmap</li><li>Handle and maintain multiple customers and critical issues</li><li>Develop and maintain a methodology to ensure strategic plans exist for all of Expel's customers</li><li>Drive accountability throughout the organization by continuously maturing organizational metrics that measure overall service delivery consistency and quality for daily, weekly, monthly, and quarterly service obligations</li><li>What you should bring with you</li><li>An understanding of the challenges affecting security programs today, and experience working through those challenges</li><li>Knowledge of threat tactics, attacker techniques, and how to defend against them</li><li>Experience hiring people into the organization and assessing skill sets accordingly</li><li>Depth of experience using customer organizational structures to inspire change</li><li>History of creatively finding non-obvious solutions to new or existing challenges</li><li>Expertise in mentoring and coaching other team members</li><li>Ability to travel up to 20%</li></ul><h3><strong>Additional notes</strong></h3><p>Our headquarters is in Herndon, Virginia. However, we realize that while there is a benefit to in-person interaction, good people don't all live in Northern Virginia. Remote work is an option for this role.</p><p>At Expel, we ask our crew to provide their COVID-19 vaccination status because it's helpful to understand this data at a company level and we expect that customers, partners, and conferences will start asking us to attest to the vaccination status of our people.</p><ul><li>The base salary range for this role is between $142,500 USD and $205,200 USD + bonus eligibility and equity.</li><li>We believe in paying transparently and equitably. Your salary will ultimately be based on factors such as your experience, skills, team equity, and market data. You'll also be eligible for unlimited PTO (which we model and encourage), work location flexibility, up to 24 weeks of parental leave, and really excellent health benefits</li><li>We're only hiring those authorized to work in the United States. We do not currently sponsor immigration visas.</li></ul><p>We're an Equal Opportunity Employer: You'll receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.</p><p>We'll ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please let us know if you need accommodation of any kind.</p><p></p>",
    "apply": "https://boards.greenhouse.io/embed/job_app?for=expel&token=6111678002",
    "company": "/companies/expel",
    "cName": "Expel",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "CRM Manager",
    "description": "<p></p><h3>SeedLegals is London's hottest lawtech startup - a disruptive startup to power other startups across the UK, France, Ireland, Hong Kong and Singapore.</h3><p>We have created a platform that is revolutionising the way that founders start, run and scale their companies. To date, over 30,000 startups and investors have used SeedLegals to close funding rounds, grant share options to employees, and so much more.</p><p>We're a Series A backed company and have raised ?4M to date with exceptional VCs such as Index Ventures. We're delivering fantastic year over year growth rates combined with world-class Unit Economics.</p><p>We're now working hard to grow our startup audience earlier in time, break into the SME market and accelerate international expansion.</p><p>Reporting to the Head of CRM, the CRM Operations Specialist will be responsible for helping to drive customer acquisition and retention, through the Hubspot CRM system.</p><p>Working alongside the Head of CRM and the internal stakeholders, this role will be pivotal in demonstrating the value of putting customer data at the heart of the organisation as the business continues its rapid expansion in the UK and internationally.</p><h3><strong>Requirements</strong></h3><ul><li>Work with the Head of CRM and stakeholders to implement requirements from the wider teams and supporting them with build appropriate solutions in Hubspot</li><li>Help manage Sales, CX, Account Management and Legal automation through HubSpot</li><li>Map &amp; own the customer journeys and buying cycles within HubSpot, creating campaigns and workflows that support them from contact acquisition to retention</li><li>Manage Hubspot reporting for Sales, CX, Account Management and Legal activity</li><li>Work closely with the Data team to ensure data integrity and create key insights</li><li>Work closely with the Engineering team to manage data cleanliness</li><li>Management and segmentation of customer databases to identify and target specific campaigns.</li><li>Monitor churn of new acquisitions and alert stakeholders to opportunities and threats</li></ul><h3><strong>Benefits</strong></h3><p>You'll join a friendly, motivated and multicultural team of founders, investors, developers and growth hackers. We're based in Holborn, in the heart of the legal district of London..</p><ul><li>24 days annual leave plus bank holidays and your birthday off!</li><li>Access to world class training from some of the most experienced individuals in UK startup law, investment, and entrepreneurship.</li><li>Learning, development and networking opportunities.</li><li>Share options. You'll be eligible for the SeedLegals performance-based share option scheme.</li><li>Great offices with free fruit and coffee, overlooking the gorgeous gardens at Lincoln's Inn Fields.</li><li>Fully remote or in the office: entirely up to you.</li><li>250 Working-from-home allowance to set up your home office</li><li>Flexible working</li><li>Classpass</li><li>Lunch is on us! Up to twice a week (when in the office)</li><li>Contributory pension</li><li>Enhanced Maternity and Parental Leave</li><li>Further benefits including health and dental cover, life insurance etc.</li></ul><p><br></p><p></p>",
    "apply": "https://apply.workable.com/seedlegals/j/4164B1D377/apply/",
    "company": "/companies/seedlegals",
    "cName": "SeedLegals",
    "location": "Europe",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Compliance Specialist, People Ops",
    "description": "<p></p><p>We're seeking a Compliance Specialist to help build the HR Compliance function at Discord. In this role, you'll support key functional areas within HR Compliance that serve as the backbone of several programs and processes that enable the success of the organization. The Compliance Specialist ensures adherence to established policies and procedures, and established governance processes. As a key member of the People Operations team, the Compliance Specialist often collaborates with a wide range of internal stakeholders as they develop and support internal initiatives.</p><h3><strong>What You'll Be Doing</strong></h3><ul><li>Manage Leave of Absence caseload and partnership with outside vendor to ensure timely communications and actions for employees and managers</li><li>Develop a meaningful LOA communication strategy to inform employees of significant company updates, including monthly newsletter</li><li>Facilitate smooth and timely re-entries to work from LOA; interface regularly with employees, managers and People Business Partners</li><li>Assist and lead compliance audits; analyze results and generate reports for relevant functional areas, and propose policy recommendations to department leads</li><li>Partner closely with internal teams to review and maintain business processes/policies and ensure consistent policy application.</li><li>Manage and maintain COVID-19 procedures and practices. This includes tracking cases, contact tracing, maintaining records, partnering with other functions, communicating and ensuring adherence to regulations at every stage of a reported exposure.</li><li>Develop, maintain and deliver compliance-related training, including anti-harassment training program</li><li>Develop communication strategy for regular updates and reminders on policies and compliance-related topics.</li><li>Support U.S. immigration related queries from internal and external stakeholders including candidates, employees, managers, and People Partners and department heads</li><li>Oversee the full lifecycle of immigration applications.</li><li>Partner with outside counsel to educate employees, managers, and People Partners on U.S. immigration concerns, strategies, and guidelines; collect and furnish documents to outside counsel in proper order</li><li>Maintain work authorization records, including I-9s</li></ul><h3><strong>You Will Thrive In This Role If</strong></h3><ul><li>A commitment to and track record of delivering high touch, world class service to internal and external customers</li><li>Adaptability and openness to learning and incorporating new processes and solutions</li><li>Strong organizational skills and attention to detail</li><li>A sense of urgency in juggling multiple priorities</li><li>Excellent and dynamic verbal, written and presentation skills; must be capable of communicating information to diverse audiences in a virtual and in-person environment</li><li>Comfortable interfacing with all types of people</li><li>2-3+ years of experience as a HR Compliance Specialist or closely related position</li></ul><h3><strong>Bonus Points</strong></h3><ul><li>A passion for and understanding of Discord's mission and values</li><li>Experience with Workday for HR information systems</li><li>Experience with Google, Microsoft Office, Asana and Notion for office communication</li><li>High level knowledge of employment laws, compliance requirements and human resources best practices for policies</li><li>An understanding of California and other employment laws and experience supporting or implementing initiatives to ensure compliance with state regulations preferred</li><li>New York City residents only: Minimum salary salary of $109,000/year + equity and benefits</li><li>Note: Disclosure as required by NYC Pay Transparency Law</li><li>Colorado residents only: Minimum salary of $98,100/year + equity and benefits</li><li>Note: Disclosure as required by sb19-085(8-5-20).</li></ul><h3>#buildbelonging #LI-KG1</h3><h4><strong>Benefits and Perks</strong></h4><ul><li>Comprehensive medical insurance including Health, Dental and Vision (plus up to $20,000 for gender affirmation procedures)</li><li>Mental health resources and quarterly wellness stipends</li><li>16+ paid holidays, 4 weeks of PTO + use-what-you-need sick days</li><li>Paid parental leave (plus fertility, adoption and other family planning benefits)</li><li>Generous stipends for headphones, your remote work setup, and lunch on a daily basis (while we're all remote)</li><li>Flexible long-term work options (remote and hybrid)</li><li>Volunteer time off</li><li>A diverse slate of Employee Resource Groups</li><li>Plus commuter contributions and other perks for office-based employees</li></ul><h3><strong>About Us</strong></h3><p>Discord is a voice, video and text app that helps friends and communities come together to hang out and explore their interests - from artists and activists, to study groups, sneakerheads, plant parents, and more. With 150 million monthly users across 19 million active communities, called servers, Discord has grown to become one of the most popular communications services in the world. Discord was built without selling ads or user data and instead, offers a premium subscription called Nitro that gives users special perks like higher quality streams and fun customizations.</p><p>We're working toward an inclusive world where no one feels like an outsider, where genuine human connection is a click, text chat, or voice call away. A place where everyone can find belonging. Challenging? Heck yes. Rewarding? Double heck yes. It's a mission that gives us the chance to positively impact millions of people all over the world. So if this strikes a chord with you, come build belonging with us!</p><p></p>",
    "apply": "https://discord.com/jobs/5957695002",
    "company": "/companies/discord",
    "cName": "Discord",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Regulatory Compliance Manager",
    "description": "<p></p><h3><strong>About Revolut</strong></h3><p>People deserve more from their money. More visibility, more control, more freedom. And since 2015, Revolut has been on a mission to deliver just that. With an arsenal of awesome products that span spending, saving, travel, transfers, investing, exchanging and more, our super app has helped over 20 million customers get more from their money. And we're not done yet.</p><p>As we continue our lightning-fast growth, we believe that two things are essential to continuing our success: our people and our culture. So far, we have more than 3000 people, based in 20 offices around the world, working on our mission. And we're looking for more. We want brilliant people that love building great products, love redefining success, and love turning the complexity of a chaotic world into the simplicity of a beautiful solution.</p><h3><strong>About the role</strong></h3><p>Please note: We are actively recruiting Regulatory Compliance Managers to be based and have local knowledge in Hungary or Belgium only.</p><p>The Revolut bank licensed in Lithuania is preparing to establish a branch in Belgium &amp; Hungary is seeking an experienced Regulatory Compliance Manager - Regulatory Affairs Manager specializing in banking activities. This newly hired person will be tasked to ensure that the Revolut Regulatory Compliance Frameworks are compliant with the relevant Belgian / Hungarian and EU regulations and proper controls exist in the newly established branch. Regulatory Compliance is a key team that ensures Revolut's products and processes meet the wording and spirit of regulatory requirements, then translate this into good customer outcomes. Regulatory Compliance also facilitates open and transparent relationships with our regulators. The Regulatory Compliance Manager will be working in Belgium or Hungary for the local branch.</p><p>At Revolut, we are committed to the highest standards of control, governance and independent oversight. We are searching for someone with extensive experience in the banking industry and proven experience in a compliance function that is excited to design, lead and shape the future of oversight and compliance.</p><p>Strong problem solving, operational process and analytical skills are a must as is experience with the financial market regulators in Belgium or Hungary. This role will demand high-levels of energy and creativity, an entrepreneurial spirit and the desire to work in a growing and changing environment.</p><h3><strong>What you'll be doing</strong></h3><ul><li>Developing, managing, refining and documenting regulatory compliance processes to manage regulatory risk and provide reporting which meets the needs of the regulator, local and Group management</li><li>Scanning the horizon for the upcoming relevant regulations and coordinating efforts of complying with them</li><li>Conducting thematic reviews of existing policies / procedures and processes to identify any compliance gaps and leading the remediation where any are identified</li><li>Working closely with the Group Regulatory Compliance function and other senior managers across the business to identify, assess, update and mitigate the regulatory compliance risks posed to Revolut and determining the priorities and resources required to effectively control them</li><li>Receiving and promptly responding to enquiries from the regulator</li><li>Support to the business where necessary regarding the launch of products to ensure regulatory requirements are met, as appropriate</li><li>Work cross-functionally across multiple teams to ensure execution against regulatory requirements and internal policies</li><li>Partner with Product Owners to educate and drive the appropriate execution of compliance requirements</li></ul><h3><strong>What you'll need</strong></h3><ul><li>+8 years of experience in compliance role in a bank licensed in Belgium or Hungarian at the regulator institution</li><li>Project management and communication skills including the ability to oversee implementation of complex projects</li><li>Knowledge and experience of best practice in Belgian or Hungarian payments/EMI/ banking sector regulations, (note that compliance with anti-money laundering regulations is outside the scope of this role)</li><li>Problem-solving and decision-making skills, with the ability to analyse complex information to identify the key issue/action and drive resolution</li><li>Deep knowledge of the Belgian / Hungarian, EU regulatory environment and key regulatory compliance regimes</li><li>Understanding of payments/EMI/banking systems and markets with a focus on technology and mobile applications</li><li>Fluent in (French or Dutch) or Hungarian and English</li><li>A relevant degree for example in business or law is required</li><li>A compliance qualification for example ACAMS or a Masters in a related field would be advantageous</li><li>Attestation Requirements: The role may be required to provide a formal attestation at periodic intervals.</li></ul><h3>#li-ap3</h3><p>By applying for the above position, you will confirm that you have reviewed and agreed to our&nbsp;<a href=\"https://www.revolut.com/legal/data-privacy-for-candidates\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Data Privacy Notice for Candidates</a>.</p><p></p>",
    "apply": "https://jobs.lever.co/revolut/09a66261-34a8-4d28-abe2-533f237971cd/apply",
    "company": "/companies/revolut",
    "cName": "Revolut",
    "location": "Europe",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Legal Counsel",
    "description": "<p></p><h3><strong>About Revolut</strong></h3><p>People deserve more from their money. More visibility, more control, more freedom. And since 2015, Revolut has been on a mission to deliver just that. With an arsenal of awesome products that span spending, saving, travel, transfers, investing, exchanging and more, our super app has helped over 20 million customers get more from their money. And we're not done yet.</p><p>As we continue our lightning-fast growth, we believe that two things are essential to continuing our success: our people and our culture. So far, we have more than 3000 people, based in 20 offices around the world, working on our mission. And we're looking for more. We want brilliant people that love building great products, love redefining success, and love turning the complexity of a chaotic world into the simplicity of a beautiful solution.</p><h3><strong>About the role</strong></h3><p>Revolut continues to grow and is entering India with a multi million pound investment in India over the next few years. Revolut India will look to introduce multiple digitally-enabled products across banking, cards and payments, foreign exchange remittances, investments and other financial services. We will help customers improve their financial health, give them more control, and connect people seamlessly across the world.</p><p>When you join Revolut, it's not just another job. You'll have the chance to build something that really matters, with a team that will become like family to you. We'll give you the freedom and tools to bring your absolute best, and the opportunities will be limitless.</p><p>We look for people who apply deep logic to their thinking and back everything up with data. We look for natural self-starters who see things through from start to finish, and who learn from every mistake.</p><p>The legal department sits at the heart of Revolut and is a core part of the business. Members of the team provide front-line guidance and support to all areas of the company, contributing to decisions that impact on Revolut's growth every day. The breadth of work you will encounter (and level of commercial involvement) is pretty unique for an in-house role, from structuring credit programmes to launching into new territories. We hire both generalists (typically corporate/commercial solicitors) as well as specialists (such as compliance), alongside operations analysts, all of whom have a large degree of responsibility for Revolut's ongoing development and growth.</p><p>We are seeking a highly motivated Legal Counsel and Company Secretary to join the Legal team in India. This legal counsel will provide general-level support on a variety of matters.</p><h3><strong>What you'll be doing</strong></h3><ul><li>Draft, review, negotiate and advise internal stakeholders and negotiate with external counterparts on a variety of commercial agreements, including third party agreements, operations agreements, services agreements, partnerships, and marketing agreements</li><li>Develop and implement processes for efficient and streamlined operations surrounding contract negotiation and processes</li><li>Develop and maintain form agreements, contract management systems, and other databases</li><li>Serving as counsel in resolving issues that arise in existing commercial relationships, and handling pre-litigation legal disputes and inquiries</li><li>Provide strategic advice on governance and regulatory policies working with the global governance and employment law teams and working with regulators on matters including on labour law matters.</li></ul><h3><strong>What you'll need</strong></h3><ul><li>Strong client-service and customer orientation and strengths in forming good working relationships</li><li>High degree of independence, initiative and decisiveness</li><li>An enthusiasm and drive for delivering results</li><li>Strong analytical skills and an ability to demonstrate sound legal and business judgment, even in ambiguous situations</li><li>Ability to work independently and also contribute successfully to cross-functional teams</li><li>Excellent organizational skills, and an ability to manage multiple projects at once, to meet deadlines</li><li>Demonstrated ability to adopt technology, being comfortable with use of tech tools, PPTs etc. will be an added advantage.</li><li>Common sense, great judgment, and a good sense of humour</li><li>Strong experience in advising clients on commercial contract matters (past experience in: IP, IT/ITES is a plus) and experience in handling employment law matters.</li><li>Working in a fast-paced, high pressure, entrepreneurial environment</li><li>Work hard but have a lot of fun doing it!</li></ul><h3><strong>Nice to have</strong></h3><ul><li>Excellent academic credentials and a LLB (or equivalent) degree</li><li>A Company Secretary qualification is an added advantage.</li><li>4+ years PQE with strong experience as a lawyer dealing with IT/ITES at a top law firm or in-house experience in the same.</li><li>Excellent English skills (written and oral) are a must</li><li>By applying for the above position, you will confirm that you have reviewed and agreed to our&nbsp;<a href=\"https://www.revolut.com/legal/data-privacy-for-candidates\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Data Privacy Notice for Candidates</a>.</li></ul><p><br></p><p></p>",
    "apply": "https://jobs.lever.co/revolut/842fabf4-c174-4306-a037-c59bafba7c05/apply",
    "company": "/companies/revolut",
    "cName": "Revolut",
    "location": "India",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Sr Counsel, Employment & Litigation",
    "description": "<p></p><p>Figma is growing our team of passionate people on a mission to make design accessible to all.&nbsp;<a href=\"https://www.figma.com/blog/meet-us-in-the-browser/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Born on the Web</a>, Figma helps entire product teams&nbsp;<a href=\"https://www.figma.com/blog/introducing-figjam/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">brainstorm</a>, create, test, and ship better designs, together. From great products to long-lasting companies, we believe that nothing great is made alone-come&nbsp;<a href=\"https://www.figma.com/blog/inside-maker-week-more-than-a-hackathon/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">make</a>&nbsp;with us!</p><p>We are looking for a self-starter to join our dynamic, tight-knit global team of legal professionals. In this role, you will support the Head of Corporate Legal and manage employment and litigation matters globally. There will be many opportunities to grow and learn while enjoying the excitement of a high-growth company.</p><h3><strong>What you'll do at Figma:</strong></h3><ul><li>Lead our global employment efforts as the primary legal resource to Figma's global People organization</li><li>Provide counseling and support on recruiting, employment, employee relations, and compensation/benefits matters</li><li>Draft, revise, and update employment and benefits related documentation and agreements as needed</li><li>Advise on internal investigations and recommend appropriate outcomes</li><li>Identify and operationalize compliance-based requirements and build scalable employment-related policies with partner teams</li><li>Manage employment-related and other litigation including strategy, discovery, drafting, and coordination with external counsel</li><li>Highlight developing legal requirements including identifying and addressing employment legal risks and potential future legal risks to the business</li><li>Work cross-functionally with teams including recruiting, HR, operations, total rewards, workplace, and equity administration, to support Figma's goals and manage its legal obligations</li></ul><h3><strong>We'd love to hear from you if you have:</strong></h3><ul><li>Licensed to practice law in the United States</li><li>7+ years (or more) experience at a leading law firm and/or in house at a company with a focus on advising on employment law and related litigation</li><li>Familiarity with drafting and reviewing employment documentation, including agreements, policies, and handbooks</li><li>Extraordinary communication skills both written and verbal, with a strong attention to detail</li><li>Ability to provide clear explanations to members of other teams, including senior management</li><li>Ability to think creatively and effectively balancing legal constraints with business goals</li><li>Collaborative approach, with strong ability to build relationships, gain credibility, and partner with others</li><li>Willingness to tackle projects both large and small</li><li>Confidence operating in a fast-paced, rapidly changing environment</li></ul><p>At Figma, one of our values is Grow as you go. We believe in hiring smart, curious people who are excited to learn and develop their skills. If you're excited about this role but your past experience doesn't align perfectly with the points outlined in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.</p><h3><strong>Read more about our team:</strong></h3><ul><li><a href=\"https://a16z.com/2020/04/30/figma/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Investing in Figma: The Decade of Design</a></li><li><a href=\"https://www.figma.com/blog/how-work-is-changing-at-figma/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">How work is changing at Figma</a></li><li><a href=\"https://www.protocol.com/figma-figjam\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Figma's next product is a multiplayer whiteboard called FigJam</a></li><li><a href=\"https://www.bloomberg.com/news/articles/2021-06-24/software-design-startup-figma-is-now-worth-10-billion\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Software Design Startup Figma Is Now Worth $10 Billion</a></li></ul><p>We will work to ensure individuals with disabilities are provided reasonable accommodation to participate in the interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please let your recruiter know if you require accommodation.</p><h3><strong>About Figma</strong></h3><p>Dylan Field and Evan Wallace co-founded Figma in 2012 with the vision of building tools for designers in the browser. Their goal was to create the first design tool that combined the accessibility of the Web with the functionality of a native app. Today Figma is a platform with tools and spaces to support the entire product development process-idea to design to build-and has simplified collaboration for&nbsp;<a href=\"https://www.figma.com/customers/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">companies</a>&nbsp;like Microsoft, Uber, and The New York Times to name a few.</p><p>At Figma, we celebrate and support our differences. We know employing a team rich in diverse backgrounds, experiences, and opinions allows our employees, products, and community to flourish. Figma is an equal opportunity workplace-we are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national orientation, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.</p><p>By applying for this job, the candidate acknowledges and agrees that any personal data contained in their application or supporting materials will be processed in accordance with the applicable candidate section of&nbsp;<a href=\"https://www.figma.com/privacy/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Figma's Privacy Policy</a>.</p><p><br></p><p></p>",
    "apply": "https://boards.greenhouse.io/figma/jobs/4498118004?gh_jid=4498118004",
    "company": "/companies/figma",
    "cName": "Figma",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Compliance Analyst",
    "description": "<p></p><p>If you don't think you meet all of the criteria below but are still interested in the job, please apply. Nobody checks every box - we're looking for candidates that are particularly strong in a few areas, and have some interest and capabilities in others.</p><h3><strong>About the role:</strong></h3><p>The Compliance Analyst is responsible for the execution, facilitation, implementation, operation, and maintenance of Governance, Risk &amp; Compliance (GRC) efforts to support our Compliance team's goals and objectives. The role will be heavily focused on evaluating and remediating information security controls, supporting audits for the company certification programs and acting as a compliance subject matter expert to the business. A successful candidate for this role will be a strong communicator who excels at explaining complex compliance requirements to diverse audiences (across varying technical and business backgrounds) in a way that fosters understanding and ownership. Innovation, creativity and strategic thinking are key qualifications, as this role will assist business and technical partners in designing scalable, sustainable approaches to satisfying our regulatory requirements. The ability to build influence and evangelize for new initiatives among stakeholders in multiple organizations will be an essential driver for success, as will an unflappable demeanor and grace under pressure. This role will work with the business at all organizational layers, so it will be important to demonstrate flexibility in approach, communication style and depth of understanding.</p><ul><li>Why should you want to work at Kong?</li><li>Market Opportunity - We are on a quest to build a $10b+ software company over the next few years and need YOUR help!</li><li><a href=\"https://www.forbes.com/sites/tomtaulli/2020/01/18/api-economy--is-it-the-next-big-thing/?sh=1120884c42ff\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">APIs are driving innovation</a>&nbsp;across every industry!</li><li><a href=\"https://www.crunchbase.com/organization/konghq/company_financials\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Strong VC team, Series D</a>, strong year over year revenue growth!</li><li>Technical Leadership - We are recognized as the leader in innovation in the connectivity space.</li><li><a href=\"https://www.youtube.com/watch?v=wd-VjsYrPMs\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Marco, our CTO/co-founder&nbsp;</a>- \"We are the Cisco of L4 and L7\" - CUBE Conversation, March 2021</li><li><a href=\"https://venturebeat.com/2021/05/17/how-the-api-economy-is-powering-digital-transformation/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">We are the leading innovator</a>&nbsp;in the connectivity space!</li><li>Amazing Team &amp; Culture - Come be a \"Konger\" and find out what we mean.</li><li><a href=\"https://www.greatplacetowork.com/certified-company/7020766\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Great Place to Work Certified</a>&nbsp;in 2020 &amp; 2021</li><li>Kong employees discuss our culture at our&nbsp;<a href=\"https://www.youtube.com/watch?v=0MTCBuMvE1I\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">2020 Company Kickoff</a></li><li>Building Great Products - Learn why the world's largest companies love our tech!</li><li><a href=\"https://konghq.com/blog/kong-named-leader-2020-gartner-magic-quadrant-api\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Kong Named a Leader in the 2020 Gartner Magic Quadrant</a></li><li>Over 250m+ downloads of our open source API gateway! Over 40k+ stars on Github between&nbsp;<a href=\"https://github.com/Kong/kong\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Kong API</a>&nbsp;and&nbsp;<a href=\"https://github.com/Kong/insomnia\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Kong Insomnia</a>!</li></ul><h3><strong>What you'll be doing:</strong></h3><ul><li>Proactively identify gaps or conflicts in existing processes and work to develop solutions with business partners</li><li>Drive the remediation of control deficiencies and gaps identified internally and externally</li><li>Assist in the automation and maintenance of compliance processes</li><li>Assist in building and maintaining compliance dashboards in support of compliance reporting</li><li>Provide guidance to control owners in the planning, design, implementation, operation, maintenance &amp; remediation of control activities and other supporting requirements (such as policies, standards, processes, system configurations, etc.)</li><li>Assist with external 3rd party audits, customer assessments, due diligence security questionnaires and perform vendor security risk reviews</li><li>And any additional tasks required by manager.</li></ul><h3><strong>What you'll bring</strong></h3><ul><li>3-5 years experience in audit engagements, certification programs and control assessments, including but not limited to defining control procedures based on requirements, policies and standards, control testing, mapping issues to risks</li><li>Knowledge of and experience in security risk management and with frameworks including related regulatory compliance requirements (such as SOC, SOX, NIST 800-53, PCI)</li><li>Passionate about policies, processes and documentation</li></ul><p>We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.</p><h3><strong>What is a Konger?</strong></h3><p>We are a group of makers, thinkers, and doers focused on helping today's developers build tomorrow's technology. Our teams work on the bleeding edge of API innovation to provide our users with a central nervous system for data and services.</p><p>We put design at the heart of everything we do, and we're relentlessly focused on creating beautiful experiences for our customers. That's why technology companies, major banks, e-commerce innovators, and government agencies put Kong in front of their most important web applications.</p><p>We believe in the power of Open Source and everything it stands for. That's why developers around the world enthusiastically contribute on top of our open-source platform.</p><p>We are passionate about solving challenges that will fundamentally shape the future of technology, and we're looking for the right people to join us on our mission. If you believe in taking ownership of your work, making an impact, and having fun along the way, we would love to talk to you.</p><h3><strong>Kong Core Values:</strong></h3><ul><li>Be Inclusive. We work together from anywhere to achieve our common goals. Our differences make us stronger.</li><li>Be Authentic. We are genuine, principled and confident without arrogance. Show respect and kindness, especially in tough moments.</li><li>Be Relentlessly Resourceful. We work with purpose, obsession and grit. It takes muscle to do hard things and doing hard things build muscle.</li><li>Be Customer Obsessed. We care. Customers are everything, we put them at the center of everything you do. We are all empowered to make an impact.</li><li>Be Curious. We value ideas over hierarchy. Never accept the status quo. We make bold bets, fail, and learn everyday. There is always a way.</li><li>Be an Owner. We are drivers not passengers and own the quality and outcomes of our work.</li></ul><h3><strong>About Kong:</strong></h3><p>Kong creates software and managed services that connect APIs and microservices natively across and within clouds, Kubernetes, data centers and more using intelligent automation. Built on an open source core, Kong's service connectivity platform enables digital innovation by allowing organizations to reliably and securely manage the full lifecycle of APIs and services for modern architectures, including microservices, serverless and service mesh. By providing developer teams with unprecedented architectural freedom, Kong accelerates innovation cycles, increases productivity, and seamlessly bridges legacy and modern systems and applications. For more information about Kong, please visit&nbsp;<a href=\"https://konghq.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">konghq.com</a>&nbsp;or follow&nbsp;<a href=\"https://twitter.com/thekonginc\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">@thekonginc</a>&nbsp;on Twitter.</p><p></p>",
    "apply": "https://jobs.lever.co/kong/9bd83947-3b55-46c4-9136-25dd9c390e38/apply",
    "company": "/companies/kong",
    "cName": "KONG",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Senior Field Marketing Manager",
    "description": "<p></p><p>Landing a construction project on schedule and on budget is a herculean task– different teams, different designs, every single time. With hundreds of thousands of variables changing everyday, optimizing construction outcomes has become a massive challenge.</p><p>Doxel is here to change that.</p><p>Doxel is an AI Powered Project Controls solution. By contextualizing vast amounts of disparate project data across site, BIM, schedule, and budget, Doxel empowers teams with an objective view of their project today and an accurate prediction of where it will be tomorrow. Leveraging machine generated and prioritized risk analysis, teams are guided to the right problems in order to stay ahead of cost overruns and schedule delays.</p><p>Backed by Insight Partners and Andreessen Horowitz and with a growing team of technologists, creatives, and industry veterans, we’re focused on helping customers realize the best outcomes on their construction projects.</p><p>As Doxel’s Senior Field Marketing Manager you will drive and execute against all customer facing activities, including large and small-scale events. You will collaborate with many internal stakeholders including but not limited to Sales reps, the Product team, Head of Demand Generation, and Content Marketing. You will be a critical part of expanding the Doxel brand and voice of the customer through field marketing activities.&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li class=\"ql-indent-1\">Help to create and execute the field marketing plan for Doxel in North America that positions Doxel as a leader in its category.</li><li class=\"ql-indent-1\">Support the overall demand generation plan through all event and customer-centered activities, including, but not not limited to, events, webinars, roundtables, customer advisory boards, and more.</li><li class=\"ql-indent-1\">Support the Head of Demand Generation with ABM campaigns where event and customer engagement channels serve as a key element to acquiring and expanding accounts.&nbsp;</li><li class=\"ql-indent-1\">Work closely with Demand Generation and Product Marketing to ensure messaging and positioning of Doxel in the field is aligned to with our Go-To-Market</li><li class=\"ql-indent-1\">Manage the Field Marketing Budget along with the associated purchasing process. Work closely with Finance.</li><li class=\"ql-indent-1\">Regularly report against field activities in support of overall Marketing OKRs</li></ul><p><strong>Qualifications</strong></p><ul><li class=\"ql-indent-1\">5+ years of field marketing experience, software industry preferred</li><li class=\"ql-indent-1\">Able to plan out a field marketing strategy, and then utilizing internal and external resources to achieve against plan.</li><li class=\"ql-indent-1\">Posses excellent communications skills with the ability to interface at all levels within the organization as well as with customers.</li><li class=\"ql-indent-1\">Able to manage events on-site.</li><li class=\"ql-indent-1\">Bachelor’s Degree in Business, Management, Marketing or a related field</li></ul><p>Doxel is an equal opportunity employer and actively seeks diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p><p></p>",
    "apply": "https://jobs.lever.co/doxel/bf3b2336-f5df-46c3-abb7-413095a7282c",
    "company": "/companies/doxel",
    "cName": "Doxel",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Associate Field Marketing Mgr",
    "description": "<p></p><p>Here at Anaplan, we have reinvented how companies see, plan, and run their businesses. Our platform allows our customers to uncover new insights, connect their strategy to their plans, and work in ways they had not previously thought possible. We’re growing fast, constantly innovating, and couldn’t be prouder to help our customers move forward with confidence in a sophisticated and changing world.</p><p>We are looking for forward-thinking people who put customer experience at the forefront of every decision. Individuals who thrive on challenges and are ready to grasp the opportunity of a lifetime. Because we fundamentally believe every colleague brings outstanding value to our whole. We are a workplace where each person feels seen, heard, and valued, and can contribute their unique talent to our collective effort. We believe that for ourselves and for our customers.</p><p><strong>This position can be located remotely in the U.S.</strong></p><p>At Anaplan, we are looking for a highly-motivated, results-driven Associate Field Marketing Manager to join our Americas Field Marketing team. This role reports into to one of our Senior Field Marketing Managers responsible for driving a number of strategic Marketing campaigns across North America and Canada. You will work closely with them to plan and execute Marketing programmes under these Campaigns, and ensure the readiness of Corporate Marketing programmes for the Americas region, to drive pipeline and accelerate growth.</p><p>If you are ready to roll-up your sleeves on execution, lean in to analytics and be a team player and a team builder, this role is for you.</p><p><strong>What You’ll Be Doing:</strong></p><ul><li>Help execute regional/local marketing plans to support aggressive growth goals for acquisition and expand pipeline and revenue in the supported regions; identify relevant activities for the supported regions and build business cases to secure funding and approvals</li><li>Work cross-functionally to oversee the timely execution of the Marketing plans; execute and manage activities, including logistics, budgeting, content development, scheduling, creative themes and social media strategies</li><li>Manage multiple projects and marketing programmes simultaneously under the direction of the Senior Field Marketing Manager, ensuring clear and proactive communication to meet deadlines and stay within budget</li><li>Build and maintain ongoing communications across the AMER Field Marketing team, the Global Anaplan Marketing Team and the AMER Go-To-Market teams (Sales, Presales, Partner, Customer Success, SDR teams)</li></ul><p>&nbsp;<strong>Technologies You’ll Work With:</strong></p><ul><li>Marketo</li><li>Salesforce</li><li>Workfront</li><li>Anaplan</li><li>Demandbase</li><li>Workday including Scout</li></ul><p>&nbsp;<strong>What Experience You’ll Need:</strong></p><ul><li>3+ years of field marketing experience in B2B / SaaS technology markets with progressive growth and demonstrable experience in implementing successful field marketing plans</li><li>Strong project management skills, creative thinking and analytical ability</li><li>The ability to execute field events and programs from start to finish</li><li>Excels at cross-group collaboration</li><li>Comfortable with accountability for clear, quantified performance targets</li><li>Motivated self-starter who thrives on working in complex and challenging environments of a rapidly evolving business</li><li>Ability to manage multiple priorities in fast-paced environment, work collaboratively with cross-functional teams, and ensure high quality deliverables with high attention to detail</li><li>Strong team-player and self-starter who can initiate and drive activities to successful conclusion while maintaining strong cross-functional working relationships</li><li>Independence and initiative in high profile situations with strong project management, organization and time management skills</li></ul><p>#LI-Remote</p><p><strong>Our Commitment to Diversity and Inclusion</strong></p><p>Build your job in a place that thrives on diversity, inclusion, and belonging. We believe in maintaining a hiring and working experience in which all people are respected and valued, regardless of gender identity or expression, sexual orientation, religion, ethnicity, age, neurodiversity, disability status, citizenship, or any other aspect which makes people unique. We hire you for who you are, and we want you to bring your true self to work every day!</p><p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive equitable benefits and all privileges of employment. Please contact us to request accommodation.</p><p><strong>COVID-19</strong></p><p>Protecting the health and safety of our communities, including our employees and of those considering a career at Anaplan, is our highest priority. We continue to closely monitor the evolving situation, and we appreciate your understanding and flexibility with any related changes to our interviewing process.</p><p></p>",
    "apply": "https://boards.greenhouse.io/anaplan/jobs/6011296002",
    "company": "/companies/anaplan",
    "cName": "Anaplan",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Account Based Marketing Specialist",
    "description": "<p></p><p><strong>ABOUT BEAMERY</strong></p><p>We help businesses become talent-first. Everything we do is about people. We’re shaping the future of work, by building the software and services that enable the world's largest companies to unleash human potential. Beamery is Talent Lifecycle Management.</p><p>We believe that where you work is much more than just a job. For many of us, it's our livelihoods. It’s how we provide for our families and it shapes the legacy we'll leave behind. This is why our purpose is to create access to opportunities regardless of where someone is born.&nbsp;</p><p>We’re excited to have&nbsp;<a href=\"https://beamery.com/resources/news/beamery-raises-138m-as-battle-for-talent-intensifies\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(241, 88, 82);\"><strong>raised a $138m Series C&nbsp;</strong></a>backed by world-class investors from some of tech’s most disruptive companies.</p><p>So, what are you waiting for? Join us and help us transform the future of work once and for all.</p><p><strong>ABOUT THE ROLE</strong></p><p>We are looking to add another Account Based Marketing Specialist to join the team! This role will be working alongside our Senior Manager of Account-Based Marketing and diving into every aspect of account based marketing and collaborating across sales, account development and other teams, playing an integral role in scaling our brand in North America.</p><p><strong>WHAT YOU WILL BE DOING AT BEAMERY</strong></p><ul><li>Support the NORAM (North America) sales teams with specialized events, content and programs that allow them to start and progress conversations with Fortune 500 companies</li><li>Maximize on the impact of existing demand generation efforts such as our existing web assets and digital marketing campaigns to target our focus accounts</li><li>Plan, set up and deliver region specific events (virtual and offline) to engage high value prospects</li><li>Work with the content and product marketing teams to commission or re-purpose content and product launches that will help us move the needle on opportunity creation targets</li><li>Partner with the ADR teams to enable best-in-class personalized outreach</li></ul><p>Curate multi channel experiences tailor made for our key target accounts</p><p><strong>WHO ARE WE LOOKING FOR?</strong></p><ul><li>B2B marketing and Demand Generation experience; SaaS Tech B2B a huge plus</li><li>An understanding and awareness of account based marketing and a desire to learn more about this methodology</li><li>Strong written and verbal communication skills, organizational skills, agile and collaborative</li><li>You’ll be great at understanding and creating content we put out and synthesizing the essential points for audiences</li><li>Some experience in hosting events like webinars, breakfast meetups and roundtables</li><li>Stakeholder management skills to interact with staff, colleagues, cross-functional teams and third parties</li></ul><p><strong>BENEFITS&nbsp;(UK)</strong></p><ul><li>Competitive pay</li><li>Stock options</li><li>Pension Plan</li><li>Unlimited Holiday</li><li>Wellness days</li><li>Private Healthcare</li><li>Family Friendly Leave Policies</li><li>Dog friendly office</li><li>Regular socials, food &amp; drink</li><li>Quarterly team-building events</li><li>Flexible learning &amp; development budget</li></ul><p><strong>BENEFITS&nbsp;&nbsp;</strong></p><ul><li>Competitive pay and stock options.</li><li>401k contribution</li><li>Unlimited PTO</li><li>100% paid medical, dental and vision care options</li><li>Gym stipend, wellness days, and whatever else you need to keep you at your best</li></ul><p><em>Beamery is an Equal Opportunity Employer. We do not discriminate on the basis of ethnicity, religion, color, sex, gender identity, sexual orientation, age or mental disability. Not only do we not discriminate, but we celebrate differences. If for whatever reason you need us to make reasonable adjustments and adaptations to our recruitment process please let your recruiter know.</em></p><p></p>",
    "apply": "https://careers.beamery.com/jobs/job/370-account-based-marketing-specialist/",
    "company": "/companies/beamery",
    "cName": "Beamery",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Product Marketing Manager",
    "description": "<p></p><p><strong>About Huckleberry</strong></p><p>Our goal at<a href=\"https://huckleberrycare.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">&nbsp;Huckleberry</a>&nbsp;is to help every family thrive.</p><p>Huckleberry’s first product improves children’s sleep. By combining human experts with AI, the app + service understands each sleep situation, predicts what will happen, and provides a personalized, easy-to-follow program that results in better sleep.</p><p>The app has 4.9 stars out of 5, garnering rave reviews from parents who call it “life-changing” and their “#1 recommendation to parents.” We are expanding beyond sleep into additional big challenges for parents, to create the source that parents rely on as their children grow and develop. We’d love for you to come with us on that journey!</p><p><strong>About The Role</strong></p><p>Huckleberry is looking for a Product Marketing Manager to play a key role in bringing new products to market to parents of young children. This individual will bring a deep knowledge of the consumer and consumer landscape to help inform product strategy as well as help educate internal/external teams and partners on our current and future products.</p><p><strong>Areas of Responsibility</strong></p><ul><li>As a Product Marketing Manager, this role will shape the vision and narrative around the products we have and will create to assist parents on their parenting journey</li><li>Own the go-to-market strategy and ongoing release cadence for all products</li><li>Collaborate with our Product teams on developing new products, including product value proposition, communication strategy, naming, and pricing</li><li>Work closely with cross-functional (Product, Dev, Customer Support, etc.) teams to bring products to market thoughtfully</li><li>Develop marketing programs &amp; campaigns to drive product engagement in partnership with the wider Brand Marketing team</li><li>Lead thinking and analysis to help us better understand parents’ needs and the competitive landscape</li><li>Shape and influence product strategy with a focus on consumers by drawing on research insights, subject matter expertise and developing a strong understanding of the broader company ecosystem and competitive landscape</li><li>Develop yearly marketing strategy and plan to achieve consumer product goals, with emphasis on driving consumer awareness, usage, and retention</li></ul><p><strong>Requirements</strong></p><ul><li>You have 4+ years experience in product marketing for a mobile app/tech company</li><li>You have worked with cross-functional teams such as product management, design, research, and engineering functions</li><li>You have experience influencing product development and product strategy</li><li>You’ve launched and driven the adoption of new products and services, owning and achieving key KPIs</li><li>You’re a great communicator with experience conveying ideas to end-users and engineering teams alike</li><li>You’re comfortable developing marketing strategies and campaigns using both quantitative and qualitative insights</li><li>You have strong personal organization and project management abilities</li></ul><p><strong>Preferred but not required</strong></p><ul><li>Direct experience working on subscription-based businesses</li><li>Experience working in a vertical that caters to parents of young children (0-5 years old)</li></ul><p></p>",
    "apply": "https://huckleberry.breezy.hr/p/138ae86c2d96-product-marketing-manager-remote",
    "company": "/companies/huckleberry-labs",
    "cName": "Huckleberry Labs",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "CRM and Email Campaign Manager",
    "description": "<p></p><p><strong>About the role</strong></p><p>As the CRM and Email Campaign Manager you will be responsible for planning, developing, and executing B2C omni-channel automated campaign setup &amp; ongoing support. This role will create and deploy all automated lifecycle related trigger and journey campaigns through all CRM channels, as well as reporting on success metrics, along with strategy for improvement. Your goal will be to increase activation, retention, and reactivation of the StockX customers. You will collaborate with all parts of the business to build and execute these customer journeys and programs, which will positively impact business metrics, migrate customers through their purchase funnels, and engage our customers to increase conversions.</p><p>This is a chance to work with an extraordinary digital marketing team and help drive this fast-growing company’s customer contact strategy, from end-to-end. We are looking for a seasoned B2C e-commerce or retail marketer, with experience in not only managing but also executing B2C automated messages from beginning to end. In addition, this person will have experience in a fast-paced company and is comfortable in constantly evolving landscapes.</p><p><strong>What you'll do</strong></p><ul><li>Build and deploy automated campaigns to increase user engagement and retention through multi-channel strategies (email, push, SMS, app inbox, etc.)</li><li>Lead the testing behind understanding how to motivate and migrate our customers through their lifecycles, which will eventually fuel our loyalty program and journeys</li><li>Develop deep understanding of current customer data, identify core insights to drive effective audience segmentation, targeting, to plan effective communications</li><li>Work cross-functionally with creative, finance, product, BI, etc. to coordinate lifecycle campaigns and customer journey offers, return on investment, and analysis</li><li>Establish and own the annual and weekly automated campaign performance goals, and have the skillset to translate data into actionable insights</li><li>Responsible for designing, tracking, and analyzing A/B testing experiments to help optimize our strategy</li><li>Partner with the analytics and growth teams to assess performance and identify key opportunities</li><li>Work collaboratively with other Creative, Marketing, Engineering, and Product Managers to develop outstanding content, user experience, and promotion of product features</li><li>Continually and proactively search for new opportunities to grow, assess new partners and technology, and innovate on communication strategies</li><li>Partner with the Global Director of CRM Marketing to deliver a cohesive, unified message to our customers</li></ul><p><strong>About you</strong></p><ul><li>Minimum 3 years of experience within campaign automation, email marketing execution, and CRM deployment tools</li><li>Bachelor's Degree a plus</li><li>Working knowledge of HTML and email marketing best practices</li><li>Experience with CRM/ESP platforms (e.g., Leanplum, SendGrid, Salesforce, etc.)</li><li>Proven experience in creating customer lifecycle journeys targeted at activating new customers, retaining existing customers, and reactivating those inactive customers</li><li>Proven experience within a B2C e-commerce or retail industry</li><li>Seasoned with the usage of data to create customer contact strategy</li><li>Strong analytical skills with data-driven approach to solving sophisticated problems</li></ul><p><em>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.</em></p><p><em>Pursuant to the Colorado Fair Pay Act, the base salary range in Colorado for this position is $75,000 to $92,000, plus opportunities for benefits (e.g., medical, dental), equity and discretionary bonuses. Compensation in other geographies may vary.&nbsp;</em></p><p><strong>About Us</strong></p><p>In a world where consumers increasingly value self-expression and individuality, the market for hard-to-find fashion, collectibles, and electronics has never been hotter. Our global platform offers unique access to current culture while our data-driven, bid-ask model provides buyers with the real-time visibility to know they’re getting a fair price.</p><p>With key leadership and an inspiring vision in place, we believe we’re poised for significant growth: into new product verticals, new audiences, and new geographies. To get there we’re looking for flexible, all-in teammates who are excited by ownership and the opportunity to take on emerging challenges.</p><p>If you’re a doer who’s ready to solve tough problems with plenty of laughs along the way, we’d love to hear from you. We welcome, embrace, and respect all dimensions of diversity. We’re committed to creating an inclusive environment where all team members are valued, supported, and respected—and no, you don’t need to know a thing about sneakers or fashion.</p><p><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. This job description is intended to convey information essential to understanding the scope of the job and the general nature and level of work performed by job holders within this job. However, this job description is not intended to be an exhaustive list of qualifications, skills, efforts, duties, responsibilities or working conditions associated with the position. StockX reserves the right to amend this job description at any time.</em></p><p></p>",
    "apply": "https://boards.greenhouse.io/stockx/jobs/6029354002",
    "company": "/companies/stockx",
    "cName": "StockX",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  }
]