[
  {
    "title": "React Developer",
    "description": "<p></p><p><strong>The opportunity</strong></p><p>At Kin + Carta, we’ve got opportunities to offer you — for growth, for leadership, for big, world-changing impact and for, dare we say it, fun. We are a global workforce that is committed to building a world that works better for everyone. And that starts with our Kin. That’s why we’re proud of:&nbsp;</p><ul><li><a href=\"https://www.kinandcarta.com/en-us/careers/life-at-kin-and-carta/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 80);\">The life we create within our virtual walls, every day</a></li><li><a href=\"https://www.kinandcarta.com/en-us/insights/2021/12/kin-and-carta-first-lse-b-corp/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 80);\">Being B Corp certified</a></li><li><a href=\"https://www.kinandcarta.com/en-us/insights/2021/09/2021-consulting-magazine-best-large-firm-award/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 80);\">Our honor as a “Best Large Firm to Work For” by Consulting Magazine</a></li></ul><p><strong>The role</strong></p><p>Kin + Carta is looking for an experienced&nbsp;React Developer&nbsp;who is passionate about emerging tech to join our team. We are seeking someone with advanced web development experience, as well as exposure to or interest in mobile application development. You will be working on client-facing projects within Fortune 500 companies in the enterprise software space. You will be given the opportunity to innovate using the latest technology trends.</p><p><strong>Role responsibilities</strong></p><ul><li>Building enterprise web and mobile applications</li><li>Working in an Agile Scrum environment</li><li>Partnering with top-notch designers to create award-winning user experiences</li><li>Participating in design and code reviews to ensure best practices and high-quality code</li><li>Documenting and following best practices and recommending best practices around source control, deployment, and issue tracking</li><li>Providing mentorship to junior engineers while also being mentored by more experienced engineers and architects to foster your career path and growth</li><li>Must be able to work in a team environment</li><li>Gaining technical knowledge of software, hardware, and open source technology stacks</li></ul><p><strong>Minimum qualifications</strong></p><p>We want all new hires to succeed in their roles at Kin + Carta. That's why we've outlined the job requirements below. To be considered for this role, it's important that you meet all Minimum Qualifications. If you do not meet all of the Preferred Qualifications, we still encourage you to apply.</p><ul><li>5+ years of experience in front end web technologies</li><li>3+ years of experience working in React Development</li><li>3+ years of experience working with at least one object-oriented language</li><li>Bachelor's degree in Computer Science, Engineering or MIS/IT or equivalent experience</li></ul><p><strong>Preferred qualifications</strong></p><ul><li>Knowledge of unit testing frameworks (Jest, Jasmine/Karma, Mocha, JUnit, etc.)</li><li>Experience or interest in full-stack development including technologies like Angular, Node.js, .NET or Java</li><li>Knowledge of cloud platforms like AWS, Azure, Pivotal Cloud Foundry</li><li>Experience working with third-party APIs</li><li>Experience in Modern Tech Stacks like Angular, React, es6 and Spring Boot</li><li>Knowledge of front-end state management libraries is a plus (NgRx, Redux, Flux, etc.)</li><li>Record of being a team player - you care about those around you and are excited to share knowledge with your peers</li></ul><p><strong>About Kin + Carta</strong></p><p>Kin + Carta is a global digital transformation consultancy committed to working alongside our clients to build a world that works better #ForEveryone. Our 1,700 curious minds make creative connections between people, data and technology to create connected outcomes across the full lifecycle of the product and platform ecosystems.</p><p>We’re makers, builders and creators by nature, and we come to work every day to build experiences for some of the world’s most influential companies. We help businesses accelerate their digital roadmap, rapidly innovate, modernize their systems, enable their teams and optimize for continued growth.&nbsp;</p><p>We are a technology business with trust and human connection at its heart.&nbsp;<a href=\"https://www.kinandcarta.com/en-us/social-responsibility/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 80);\">As a Certified B Corp</a>, our triple bottom line focus on people, the planet and profit is at the core of everything we do.</p><p>We welcome our Kin to show up as their full selves every day. Because this is so important to us, Kin + Carta is proud to be an equal opportunity employer. To read further about our commitment to Inclusion, Diversity, Equity and Awareness, check out the&nbsp;<a href=\"https://www.kinandcarta.com/en-us/idea/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 80);\">IDEA page</a>&nbsp;on our website.&nbsp;</p><p>If you need accommodations at any point in the application or interview process, please let us know.</p><p><strong>Apply for this role</strong></p><p>Whoever you are, wherever you’re from and whoever you love, you’ll find an open door at Kin + Carta. It’s yours to walk through if you’re passionate about building a better world for everyone, and you’re keen to be part of a diverse and inclusive culture that plays to people’s strengths and thrives on togetherness.</p><p></p>",
    "apply": "https://www.kinandcarta.com/en-us/careers/job/",
    "company": "/companies/kin-carta",
    "cName": "Kin + Carta",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Java Developer",
    "description": "<p></p><p><strong>We help the world run better</strong></p><p>Our company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from. Apply now!</p><p><strong>Who We Are</strong></p><p>Your career at SAP Fieldglass is what you make of it. You can forge your own path, switch business units or solve a problem that no one has before. With office space in Chicago, London and Brisbane, as well as an employee presence on 6 continents, we are a diverse global company with a family feel. Inspired by change and by each other, we take pride in our innovative culture that created and continues to shape our market-leading, best-in-class solution. At SAP Fieldglass we don’t follow trends, we set them!</p><ul><li>Best of both worlds: start-up culture with the backing and benefits of SAP</li><li>Focus on continuous professional growth and development</li><li>Promote healthy work / life balance</li><li>Committed to our communities and the environment</li><li>2016 Moxie Award winner for best office space.</li></ul><p><strong>What We Do</strong></p><p>Businesses are racing to be more competitive in an environment where workforce is pivotal. Companies need the right talent at the right price at the right time. SAP Fieldglass accelerates the engagement of talent and provides total workforce visibility to maximize cost savings and improve worker quality. Our cloud-based, open platform has been deployed in more than 140 countries and helps companies transform how work gets done.</p><ul><li>Forrester Research, Inc, positions SAP Fieldglass as a leader among services procurement providers</li><li>KellyOCG® Supplier Excellence Award Winner</li></ul><p><strong>Developer</strong></p><p>We are currently seeking a Software Developer who will be responsible for designing, developing, and delivering software modules and components related to Java technologies. In this hybrid role, a key part of your work will be centered around researching and evaluating security threats, vulnerabilities, and finding solutions, so having prior experience addressing security issues is a must. This is an On-site/Remote position in either our Naperville or Chicago office, but we open to other locations within US too.</p><p><strong>Responsibilities Include:</strong></p><ul><li>Participate in the lifecycle development of software systems using either waterfall or agile methodologies.</li><li>Analyze and translate functional specifications and change requests into technical specifications.</li><li>Perform impact analyses of new features or changes to existing features within the Fieldglass application.</li><li>Execute unit and system testing of the design once the solution has been developed and work closely with other team members to efficiently deploy the code to production.</li><li>Support software deployments to customers.</li><li>Institute programming techniques that are free from logical design and technical implementation flaws.</li><li>Design and build software for integrating multiple systems.</li><li>Counsel your colleagues on secure programming practices.</li><li>Research/identify flaws and remedy development mistakes.</li></ul><p><strong>We’re Looking For:</strong></p><ul><li>At least 2.5 years of experience as a Software Developer.</li><li>Bachelor's or master’s degree in computer science or related course of study</li><li>At least 2 years of Software development experience in Java.</li><li>2 years Javascript or other UI Framework&nbsp;is a plus</li><li>Adequate knowledge of web related technologies (Web applications, Web Services and Service Oriented Architectures) and of network/web related protocols</li><li>Should have previous experience with API development.</li><li>Knowledge with UI and backend integration is a plus.</li><li>Technical knowledge of techniques, standards and state-of-the art capabilities for authentication and authorization is required</li></ul><p>#LI- Remote</p><p class=\"ql-align-justify\"><strong>SAP'S DIVERSITY COMMITMENT&nbsp;</strong></p><p class=\"ql-align-justify\">To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.</p><p class=\"ql-align-justify\">SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com&nbsp;</p><p class=\"ql-align-justify\">For SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the&nbsp;<a href=\"https://one.int.sap/me@sap/jobs_at_sap#17498858-1050-415e-8d82-21f91655666b_96fc\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 143, 211);\">SAP Referral Policy</a>.</p><p class=\"ql-align-justify\"><strong>Additional Locations :</strong></p><p><strong>Nearest Major Market:&nbsp;</strong>Naperville</p><p><strong>Nearest Secondary Market:&nbsp;</strong>Chicago</p><p><strong>Job Segment:&nbsp;</strong>Developer, ERP, Cloud, Testing, Java, Technology</p><p></p>",
    "apply": "https://jobs.sap.com/job/Naperville-Developer-IL-60563/802592501/",
    "company": "/companies/sap",
    "cName": "SAP",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Java Developer",
    "description": "<p></p><p><strong>GEICO's Claims Technology Solutions Group</strong>&nbsp;is looking for a<strong>&nbsp;Java developer</strong>&nbsp;to join the team and help develop and support claims internet applications in a fast paced and high energy environment. The person in this role will support current Claims Applications and participate in exciting projects involving large scale client server applications. The candidate must also be process and results oriented.<span>&nbsp;&nbsp;</span>As a Developer this position will work in a highly collaborative environment with other teams such as Infrastructure, Architecture, Release Management, Application Security, and the Business to develop and deliver critical solutions for GEICO.</p><p><strong><u>Required Qualifications:</u></strong></p><p>• Excellent Technical Skills In Java and J2ee with at least 3 – 5 years of development experience.</p><p>• Strong testing, debugging, and triage skills.<span>&nbsp;</span></p><p>• Knowledge of open source frameworks.</p><p>• Good Understanding of the Software Development Life Cycle.</p><p>• Good Understanding of Agile Development Methodologies.</p><p>• Excellent written and verbal communication skills.</p><p>• Excellent analysis and design skills and troubleshooting skills in object oriented technologies.</p><p><strong><u>Preferred Qualifications:</u></strong></p><p>• Bachelor’s Degree in Computer Science, Computer Engineering, MIS, or an equivalent field of study.</p><p>• Experience with JIRA, Web Services, Apache Camel, Spring Framework, Eclipse, Perforce, Dynatrace, Splunk, SonarQube, Veracode, or similar tools</p><p>• Familiar with Testing Framework tools such as SOAPUI and JUnit.</p><p>• Experience troubleshooting Application/Client Server connectivity issues</p><p>• Experience with MQ messaging.</p><p>• Experience with databases such as Sql Server and Oracle.</p><p>• Experience with Visio tool.</p><p><strong><u>Benefits:</u></strong></p><p><span>At GEICO, we make sure you have the support and resources to leverage and develop your skills, secure your financial future, and take care of your health and well-being. GEICO continually seeks to provide a workplace where everyone can be their authentic self. To help achieve this goal, we support associate-led Employee Resource Groups that foster a true sense of community. Through GEICO’s competitive benefits offerings and various training and development opportunities, we have you covered with our Total Rewards Program* that includes:</span></p><ul><li><span>Premier Medical, Dental and Vision Insurance with no waiting period**</span></li><li><span>Paid Vacation, Sick and Parental Leave</span></li><li><span>401(k) Plan with Profit Sharing</span></li><li><span>Tuition Reimbursement</span></li><li><span>Paid Training and Licensures</span></li></ul><p><em>*Benefits may be different by location. Benefit eligibility requirements vary and may include length of service.</em></p><p><em>**Coverage begins with the pay period after hire date. Must enroll in New Hire Benefits within 30 days of the date of hire for coverage to take effect.</em></p><p><span>GEICO is proud to be an equal opportunity employer. We are committed to cultivating an environment where equal employment opportunities are available to all associates and job applicants regardless of race, color, religious creed, national origin, ancestry, age, gender, pregnancy, sexual orientation, gender identity, marital status, familial status, disability or genetic information, in compliance with applicable federal, state and local law. GEICO celebrates diversity and believes it is critical to our success. As such, we are committed to recruit, develop and retain the most talented individuals to join our team.</span></p><p><span>GEICO also provides a work environment in which each associate is able to be productive and work to the best of their ability. We do not condone or tolerate an atmosphere of intimidation or harassment. We expect and require the cooperation of all associates in maintaining an atmosphere free from discrimination and harassment with mutual respect by and for all associates and applicants</span></p><p>Explore Location</p><p></p>",
    "apply": "https://careers.geico.com/us/en/job/GEICUSR0036102EXTERNALENUS/Java-Developer-REMOTE",
    "company": "/companies/geico",
    "cName": "GEICO",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Product Designer, Desktop app",
    "description": "<p></p><p><strong><em>Job Title:</em></strong></p><p><span>Product Designer, Desktop app - Remote</span></p><p><strong><em>Role Overview:</em></strong></p><p><span>As a Product Designer in McAfee Consumer Experience Design (CxD) team, you will play a pivotal role in the transformation by crafting and leading the delivery of best-in-class experiences for a variety of initiatives within our products. You will join the Desktop app team, where you will help redefining security and shaping the future of our core suite of desktop applications. The work you do at McAfee will positively influence the lives of millions of consumers around the globe every single day.</span></p><p><span>This is a remote position based in either the United States or Canada. We will only consider candidates in the United States or Canada and are not offering relocation assistance at this time.</span><strong><em>About the Role</em></strong></p><ul><li>Help redefining security and shaping the future of our core suite of desktop applications through user-centered design and cross-functional collaborations</li><li>As a part of the Cross OS &amp; Form Factors team, we make sure to create solid foundations for each platform and all the features are integrated in a cohesive manner, and drive consistency in experience across all McAfee products</li><li>Deliver extraordinary end-to-end experiences that bring delight to our customers by applying your deep knowledge of UX design (research, ideation, conceptual design, prototyping, user testing)</li><li>Create user flows, journey maps, interaction patterns, wireframes, storyboards, design specs, prototypes, UI mockups to effectively communicate interaction and design ideas</li><li>Help to facilitate cross-functional design workshops with business, marketing, product management, and engineering, to explore multiple concepts with clear user goals and testable hypotheses</li><li>Participate in design sprints, stand-ups, sprint planning, and lean product testing</li><li>Learn to measure and present actual UX outcomes using qualitative and quantitative methods&nbsp;</li></ul><p><strong><em>About You&nbsp;</em></strong></p><ul><li>You have been driving Product/UX designs for large-scale digital products for leading brands for 3+ years.</li><li>You have a portfolio that showcases a spectrum of creative design solutions from concept to launch</li><li>Able to identify, analyze, and communicate user and business needs</li><li>Excellent at sketching, wireframes, user flows, visual design, and prototyping to create engaging experiences</li><li>Comfortable working in a very dynamic and collaborative work environment across time zones and geographies.</li><li>Good understanding of data driven design activities, such as storyboarding and experience models, solid experience using these strategies to create high quality designs</li><li>Mastery of standard professional tools (Figma, Sketch, Principle, Adobe Creative Suite, etc…)</li><li>Proven ability to create mock-ups and produce multiple iterations efficiently and proficiency in interactive prototyping.</li><li>Good knowledge of agile software development processes.&nbsp;</li></ul><p>#LI-Remote</p><p><strong><em>Company Overview</em></strong></p><p>McAfee is a leader in personal security for consumers. Focused on protecting people, not just devices, McAfee consumer solutions adapt to users’ needs in an always online world, empowering them to live securely through integrated, intuitive solutions that protects their families and communities with the right security at the right moment.</p><p><strong><em>Company Benefits and Perks:</em></strong></p><p>We work hard to embrace diversity and inclusion and encourage everyone at McAfee to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees.</p><ul><li>Pension and Retirement Plans</li><li>Medical, Dental and Vision Coverage</li><li>Paid Time Off</li><li>Paid Parental Leave</li><li>Support for Community Involvement</li></ul><p>We're serious about our commitment to diversity which is why McAfee prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.</p><p></p>",
    "apply": "https://careers.mcafee.com/job/-/-/731/30019048224",
    "company": "/companies/mcafee",
    "cName": "McAfee",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "UX Designer",
    "description": "<p></p><h4><strong>Description</strong></h4><p>Be Smart. In It to Win It. Teamwork Makes the Dream Work. Yes, We Can. We Got Your Back. Built on Trust</p><p>These values define who we are and they have empowered our staggering growth to become the #1 leader in Click2Cart technology.</p><p>Let's be honest. Job posts are boring, but working with SmartCommerce is far from it.</p><p><strong>The Candidate</strong></p><p>Our ideal candidate is an A+-player/achiever with an entrepreneurial spirit, infectious personality, and the ability to earn instant rapport with internal and external clients. The right candidate learns fast, is self-motivated, and wants to grow while truly contributing to the success of the team.</p><p><strong>The Company</strong></p><p>At SmartCommerce employees are passionate go-getters who partner with CPG brands to take their sales to the next level through a proprietary one-click path to purchase technology \"MOE\". These partnerships increase clients' profit margins and their sales exponentially.</p><p><strong>The Culture</strong></p><p>What really matters is that the vision, the culture, and the rules of engagement align and are something that team members truly want to embrace. We are a \"Family First\" organization where our families at home, work-family, and clients are all a priority. When SmartCommerce's cultural beliefs align with yours, success will follow.</p><p><strong>Responsibilities</strong></p><ul><li>Gather and evaluate user requirements in collaboration with product managers and engineers</li><li>Illustrate design ideas using storyboards, process flows and sitemaps</li><li>Design graphic user interface elements, like menus, tabs and widgets</li><li>Build page navigation buttons and search fields</li><li>Develop UI mockups and prototypes that clearly illustrate how sites function and look like</li><li>Create original graphic designs (e.g. images, sketches and tables)</li><li>Prepare and present rough drafts to internal teams and key stakeholders</li><li>Identify and troubleshoot UX problems (e.g. responsiveness)</li><li>Conduct layout adjustments based on user feedback</li><li>Adhere to style standards on fonts, colors and images</li></ul><h4><strong>Requirements</strong></h4><ul><li>Proven work experience as a UX Designer or similar role</li><li>Portfolio of design projects</li><li>You are proficient in Adobe Creative Suite (specifically Illustrator, InDesign and Photoshop)</li><li>You are proficient in prototyping tools such as Sketch, InVision, etc.</li><li>Basic HTML5, CSS3 required and JavaScript skills are a plus</li></ul><h4><strong>Benefits</strong></h4><ul><li>Health Care Plan (Medical, Dental &amp; Vision)</li><li>Retirement Plan (401k, IRA)</li><li>Life Insurance (Basic, Voluntary &amp; AD&amp;D)</li><li>Long Term Disability</li><li>Short Term Disability</li><li>Paid Time Off (Vacation, Sick &amp; Public Holidays)</li><li>Family Leave (Maternity, Paternity)</li><li>Work From Home</li><li>Wellness Resources</li></ul><p></p>",
    "apply": "https://apply.workable.com/smartcommerce/j/6909EB156B/",
    "company": "/companies/smartcommerce",
    "cName": "SmartCommerce",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Motion Designer",
    "description": "<p></p><h4><strong>Description</strong></h4><p>Motion at&nbsp;<a href=\"http://www.makebttr.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Bttr</a>&nbsp;is an essential part of our working environment. Brands, products and services do not sit still and our motion designers are there from the start of every project, collaborating from day one to impact how our work for our clients and internal work will move.</p><p>In this role, you’ll work closely with a global team of designers, strategists, product managers, engineers, data analysts, and stakeholders to shape brand and product experiences across a variety of industries.</p><p>We are looking for an inspired, highly creative and energetic Full-Time Mid to Senior Motion Designer to help drive this area of our working practice. Using your ability to construct wonderful and engaging stories, encouraging new narratives and pushing to go beyond current trends and constantly challenge the level.</p><p>Your focus will be to deliver best in class solutions for our clients. You will champion the Bttr business and design team and take pride in career defining work.</p><p><strong>Requirements</strong></p><p><strong>You Will:</strong></p><ul><li>Set the bar for digital design craft and motion interaction design.</li><li>Lead the inception of new ideas and problem-solve.</li><li>You’ll produce elegant and modern designs, and obsess over the finest details in design and function, creating next-level animations and films.</li><li>Take part in video conference calls, project meetings, internally and externally.</li><li>Understand business requirements whilst advocating for everyday users.</li><li>Use storytelling to influence and educate stakeholders about design.</li><li>Have a real passion for organization, simplicity, efficiency, and action.</li><li>Be able to implement traditional animation principles into branding and to come up with new unique overarching concepts to guide motion graphics.</li><li>Someone with strong people skills, you should be comfortable working as a team and confident to take part in interviews, workshops and interactions with clients.</li><li>You will have proven ability to present clearly and show experience with internal and external presentations and are able to put an attractive and compelling presentation together.</li><li>Be willing to work across global time zones and travel when necessary.</li><li>At Bttr we know the best work comes from bringing great people together, from diverse backgrounds, stories and communities.</li><li>Either be based in an East Coast or Pacific Coast Time Zone or able to work these hours</li></ul><p><strong>Your Experience:</strong></p><ul><li>4+ years of industry experience.</li><li>A high level of skill in After Effects, Adobe CC suite &amp; Trapcode.</li><li>Solid experience with Cinema 4D inc. Octane/Arnold/RedShift renderer.</li><li>Expert editing, color grading, audio production.</li><li>A demonstrative interest in AR and VR.</li><li>Experience of using Lottie, Figma/Flinto/Framer/ProtoPie are a big bonus.</li><li>Impeccable sense of timing and a deep understanding of motion curves.</li><li>Strong operational and facilitation skills, with a proven ability to plan, coordinate and execute projects.</li></ul><p></p>",
    "apply": "https://apply.workable.com/bttr/j/3B927E7005/",
    "company": "/companies/bttr",
    "cName": "bttr",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Sr Editor, Android Central",
    "description": "<p></p><h4><strong>Description</strong></h4><p>We’re Future. We’re 3000+ colleagues over 250+ brands speaking to 400 million people every month across the globe through websites, events and magazines. We haven’t just survived over the past couple of years, we’ve thrived, increasing our audience share, taking more number one positions, acquiring new businesses and launching new brands.</p><p>And we don’t plan on stopping any time soon.</p><p>We’ve got ambitious plans that build on our growth momentum and unlock new opportunities and we’re looking for talented people who want to be a part of it.</p><p>Android Central is the THE online destination for the most passionate Android enthusiasts. But it’s also more than that — Android Central hosts news, reviews, how-to guides, and buying guides across a variety of topics, from Android smartphones to wearables to tablets, health and fitness tech to smart home, and AR/VR to mobile gaming.</p><p>As Senior Editor you will be responsible for building and maintaining relationships with many of the companies that work with Android Central on a regular basis. Working alongside the Editor-in-Chief, you'll brainstorm, plan and execute stories that stand out from the relentless cycle of similar online content. You will champion Future's values, positively impacting the culture through promoting interaction between teams and the audience, demonstrating decisiveness in decision making and having a clear focus on results.</p><h4><strong>Requirements</strong></h4><ul><li>Professional writing and editing experience.</li><li>Excellent time-management and prioritization skills.</li><li>Decision-making and problem resolution skills.</li><li>Ability to perform at a high level on strict deadlines.</li><li>Clear understanding of basic modern SEO best practices.</li></ul><h4><strong>Benefits</strong></h4><p>As well as our standard benefits, we have a number of awesome perks available to our staff including:</p><ul><li>Unlimited paid time off (yes you read that right!)</li><li>A share in our success- every member of staff receives a profit pool bonus at the end of our financial year</li><li>Huge opportunities to learn and develop whether through professional qualifications, exposure to incredible business projects or informal lunch &amp; learns, hosted by your colleagues</li><li>Healthcare</li><li>401k match</li></ul><p>Our Future, Our Responsibility - Inclusion and Diversity at Future</p><p>We have a voice and we’re going to use it. We promote diversity and inclusion not just in our recruitment processes, but everything we do. We’re an equal opportunity employer and we will continue to ensure our recruitment process is free of bias and our workplaces are inclusive, positive, free of discrimination and respecting of all backgrounds and beliefs. Our culture is underpinned by our values and employees - current and future - are treated with respect and fairness. Find out more about Our Future, Our Responsibility on our website.</p><p>#LI-SC1</p><p></p>",
    "apply": "https://apply.workable.com/futureplc/j/C93578A8F4/",
    "company": "/companies/future-plc",
    "cName": "Future PLC",
    "location": "USA",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Content Curator",
    "description": "<p></p><p><strong>About the Position</strong></p><p><span>WebstaurantStore&nbsp;is the leading restaurant supply &amp; equipment e-commerce retailer. As an Content Curator on our team, you’ll collaborate with other professionals that embody our core values: embracing the entrepreneurial spirit, displaying a passion for excellence, and always doing the right thing. You will serve the purchasing needs of foodservice professionals worldwide by being part of a team that creates meaningful content and product images. We carry 300,000+ unique products including large equipment, countertop appliances, dinnerware, textiles, consumables, and more!&nbsp;&nbsp;</span></p><p><strong>As a content curator, you will:&nbsp;</strong></p><ul><li><span>Use a&nbsp;proprietary workflow&nbsp;management software&nbsp;to&nbsp;meet all SLAs&nbsp;defined by the department. This will be done&nbsp;by:&nbsp;</span></li><li><span>Reviewing&nbsp;daily additions of new items and determining the appropriate path for supplying visual content (in-house photography, 3D, vendor supplied images)&nbsp;based on defined standards.</span></li><li><span>Navigating vendor resources and existing assets to locate images that meet brand standards.</span></li><li><span>Meeting defined timeframes for locating assets and communicating with content writers/vendors/purchasers when assets are not available.</span></li><li><span>Communicating effectively with other departments and vendors&nbsp;in meetings or via email.</span></li><li><span>Maintaining&nbsp;clear&nbsp;and accurate&nbsp;notes&nbsp;on&nbsp;the status of all assigned items&nbsp;in the workflow tool.&nbsp;</span></li><li><span>Meet weekly KPIs (key performance indicators).</span></li><li><span>Work out of a shared email inbox to respond to inquiries relating to photo/video/3D production.</span></li><li><span>Assist the lead curator with maintenance projects relating to images and new items as&nbsp;needed.</span></li></ul><p><strong>We are looking for driven, motivated candidates who:&nbsp;</strong></p><ul><li><span>Embrace change, show agility, and are comfortable with ambiguity and working at a fast pace.&nbsp;</span></li><li><span>Learn new processes&nbsp;quickly.&nbsp;</span></li><li><span>Complete&nbsp;projects/assignments on time despite tight time restraints.&nbsp;&nbsp;</span></li><li><span>Communicate effectively with multiple personality types both in-person and through email.&nbsp;&nbsp;</span></li><li><span>Demonstrate initiative and follow through.&nbsp;&nbsp;</span></li><li><span>Have exceptional organizational skills.&nbsp;&nbsp;</span></li><li><span>Find a balance between organizational, personal, and team needs.</span></li><li><span>Experience using Adobe&nbsp;Photoshop is plus, but not required.&nbsp;&nbsp;</span></li></ul><p><span>We offer competitive compensation and a comprehensive benefits package including paid time off, medical/dental insurance, wellness programs, gym membership reimbursement, and a 401k with company match. Employees also enjoy regular food service industry training from top manufacturers and product experts.&nbsp;</span></p><p><span>Our Pennsylvania headquarters feature an on-site fitness center, regular training sessions, game room, and the chance to cook and eat delicious meals in our test kitchen, outfitted with some of our newest and best professional restaurant equipment.&nbsp;</span></p><p><span>This position is also available as a remote position. If you're searching for a full-time, permanent work-at-home career, we’ve got an opportunity for you to join our fast-growing team! Currently, we are employing legal residents of the following states: (AL, AZ, AR, DE, FL, GA, KS, KY, MD, MI, MS, NV, NC, OH, OK, PA, SC, TN, TX, VA, WV, WI or WY). H-1B Visa Sponsorship Not Available, W2 only.&nbsp;</span></p><p><span>As a&nbsp;WebstaurantStore&nbsp;remote employee, you'll enjoy the same training and support to be successful in your position as employees at our physical corporate locations. We stay connected through video meetings, training sessions, and collaborative forums, and provide opportunities for you to connect with other employees from across the country both professionally and personally.&nbsp;</span></p><p><strong>To qualify, candidates must have:&nbsp;</strong></p><ul><li><span>Access to a reliable and secure high-speed internet connection. Cable or fiber internet connections (at least 25mbps download/10mbps upload) are preferred, as satellite connections often cannot support the technologies used by&nbsp;WebstaurantStore&nbsp;to perform day-to-day tasks.&nbsp;</span></li><li><span>Access to a home router and modem.&nbsp;</span></li><li><span>A dedicated home office space that is noise and distraction-free. The space should have strong wireless connection or a wired Ethernet connection (wired connection is preferred, if possible).&nbsp;</span></li><li><span>A valid, physical address (apartment, suite, etc.); PO Boxes are not&nbsp;supported;&nbsp;as a physical address is required for you to receive your computer equipment.&nbsp;</span></li><li><span>The desire and ability to work and communicate with other team members via chat, webcam, etc.&nbsp;</span></li></ul><p><strong>Work from home benefits include:&nbsp;</strong></p><ul><li><span>The essential computer equipment, such as hardware and software, needed to perform your job.&nbsp;</span></li></ul><p><span>If you’re ready for a&nbsp;challenge and&nbsp;have the ambition to succeed in a fast paced, growing industry, we’d love to discuss the Content Curator position with you! Submit your resume and apply online today.&nbsp;</span></p><p></p>",
    "apply": "https://www.clarkassociatesinc.biz/careerdetail",
    "company": "/companies/webstaurantstore",
    "cName": "WebstaurantStore",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Lead Technical Writer",
    "description": "<p></p><p><strong>Lead Technical Writer</strong></p><p>Tetrate is a leading enterprise service mesh company that enables a safe and fast application modernization journey for our customers.&nbsp;We were recently named a 2022 Forbes America’s Best Startup Employer after being evaluated for employer reputation, employee satisfaction, and growth. Grow with us and complete our ‘mesh’!</p><p>Join a team of world-class engineers working on the next generation of networking services using Istio, Envoy and other open source projects to define the next generation of cloud native network service.&nbsp;</p><p>We are seeking a technical writer and a leader whose job is to build, maintain, and improve user-facing documentation of our product.</p><p>We are building a secure, robust, and highly available service mesh platform for mission-critical enterprise applications spanning both legacy and modern infrastructure. Providing the documentation that allows our customers to achieve their goals in developing their application will be the main challenge you will be solving.</p><p>If you believe that great software alone does not make a great product, and you care about user experiences when they are confronted with the daunting task of building complex, large infrastructure, you will find this role to be a fit for your wants.&nbsp;</p><p><strong>What You’ll Do:</strong></p><ul><li>Write new documentation, or review and edit raw material provided by the development team and turn them into user-facing documentation</li></ul><p><strong>Skills You Have:</strong></p><ul><li>Understanding of the needs from an average developer with regards to documentation. Documentation will be read by developers of various skill levels, and it will need to provide ample background information for the untrained, and direct access to the solution for the veterans.</li><li>Excellent command of written English, specifically in technical writing.</li><li>Excellent reviewing and editing skills over documentation submitted by other developers. You will need to correct grammar, edit for consistency, and sometimes rewrite sections or entire documents on your own.</li><li>Either of</li><li class=\"ql-indent-1\">1) Intimate knowledge of application development on modern cloud native environments including Google Cloud Platform, AWS, Azure, etc, using service mesh technologies such as Istio and Envoy, or</li><li class=\"ql-indent-1\">2) Excellent communication skills to draw out information from the developers, especially about the underlying assumptions that our products make about the environment.</li><li>Good understanding of fundamental networking protocols and concepts, as well as related middlewares.</li><li>Experience being a developer on software projects is a plus. While it is technically not a requirement, it will be much easier if you have experience being on the receiving end of product documentation.</li><li>Experience in writing technical articles, such as blog zines, for a wide audience is a plus.&nbsp;Meaning, you know how to write a convincing article to people who aren’t as familiar about networking, let alone a service mesh or TSB</li><li>Experience in maintaining and developing documentation using Docusaurus, as well as some ability to diagnose and fix documentation build systems using Docusaurus is a plus.</li><li>Fundamentals-based problem-solving skills; Drive decision by function, first principles based mindset. We are not “title” driven and we value results over process</li><li>Demonstrate bias-to-action and avoid analysis-paralysis; Drive action to the finish line with high quality and on time</li><li>You are ego-less when searching for the best ideas; You contribute effectively outside of your specialty; You think about solving problems from the standpoint of the best outcome for the team.&nbsp;&nbsp;</li><li>Values autonomy and results over process</li></ul><p><strong>Location:</strong></p><p>Worldwide – We are a 100% globally distributed company.</p><p></p>",
    "apply": "https://www.tetrate.io/career/lead-technical-writer/",
    "company": "/companies/tetrateio",
    "cName": "Tetrate.io",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Pricing & Business Optimization Mgr",
    "description": "<p></p><p><strong>Why Valvoline?</strong></p><p>We’ve been in the car business for more than 150 years, starting with the invention of the world’s first motor oil. Today, we’re a global leader in automotive services and lubricants, driven every day by a people-centered focus on innovation and service excellence.</p><p>As we often say, it starts with&nbsp;<strong>all</strong>&nbsp;of our people — and that’s where you come in. We’re looking for humble, hungry and smart people to help us power the future of mobility. If you’re looking for a collaborative and flexible work environment that invests in your growth and success, you’ve come to the right place.</p><p><strong><em>*VALVOLINE WORLD&nbsp;HEADQUARTERS IS LOCATED IN LEXINGTON, KY, BUT&nbsp;WE INVITE&nbsp;REMOTE&nbsp;CANDIDATES TO APPLY AS WELL.&nbsp;IDEALLY,&nbsp;WE&nbsp;WOULD LIKE CANDIDATES LOCATED IN NEARBY MARKETS (CINCINNATI AND LOUISVILLE).</em></strong></p><p><strong>Careers for the Driven</strong></p><p>Valvoline has a rewarding opportunity as a&nbsp;<strong>Pricing &amp; Business Optimization Manager</strong>. We whole-heartedly adopt a ‘never idle' mindset. We also know that outstanding service begins and ends with our employees. So, we’re looking for good people to join our team. You bring your skills, talents and drive. We will give you a great place to work, a competitive salary and benefits, and the resources and support to develop and advance within our global company.</p><p><strong>HOW YOU’LL MAKE AN IMPACT</strong></p><p>The&nbsp;<strong>Pricing &amp; Business Optimization Manager</strong>&nbsp;will play a key role in evolving and reshaping Valvoline’s revenue and margin growth strategy in Latin America as well as building a strong business analytics foundation for the organization, while ensuring a flawless sales back-office support. The key objectives of this&nbsp;role include improving value capture from new and existing customers while maintaining pricing integrity and consistency, building market-driven and systematic pricing structures, processes and framework, while leading a consistent competitor pricing analytics mechanism across key regions/segments, leading the development and disciplined execution of a cohesive pricing strategy, leading business analytics in the region towards setting up a data-enabled decision-making process and being the single source of reliable and valuable information for our commercial teams, and ensuring a flawless business processes connection with key customers and partners while leading our efforts and strategy to be easier to do business with.&nbsp;&nbsp;</p><p><strong>In the role, you would be responsible for:</strong></p><ul><li>Working closely with BU leader/ Supply Chain/Marketing team to&nbsp;<strong>develop and implement pricing strategy that supports sustainable business growth</strong>. Drives projects related to price points and tier differentiation for new and current products, customer segments to target, feature prioritization, and deal level guidance. Develop deep expertise in how customers perceive and derive value from the product and price elasticity. Provides strategic pricing guidance and profitability analysis. Leads and directs analysis to provide leading and lagging KPIs for pricing initiatives, compile reports/dashboards and distribute to stakeholders across the organization. Builds and maintains price database to support pricing/ cost activities, as well as market intelligence/competition benchmark. Oversees the effectiveness of customer and segment pricing through internal and primary market research, competitive pricing research, deal analysis and a variety of other research methods.</li><li>Driving definition, implementation and tracking of&nbsp;<strong>internal pricing procedures and framework that enable a flawless execution of our company’s pricing strategy</strong>. Definition and implementation of pricing tiers and structures by region/product family/segment, end use customer and special pricing accounts framework, deal and profitability analysis tools development, maintenance and deployment along with system flawless integration are among key tasks.</li><li>Creating, developing, and leading execution and maintenance of a data analytics and business intelligence environment (dashboards, reports, presentations) that equips the whole organization with the information/analysis/insights required to make the right decisions and profitably grow the business.</li><li>Leading and championing our strategy to be easier to do business with including our digital transformation journey and ad-hoc projects.</li><li>Leading analyst team ensuring a flawless and disciplined pricing execution, customer rebate management and key customer business processes integration.</li><li>Other duties and responsibilities as determined by Valvoline from time to time in its sole discretion</li></ul><p><strong>WHAT YOU’LL NEED</strong></p><ul><li>Bachelor’s Degree in Economics, Finance, Engineering, Mathematics, or related technical field&nbsp;</li><li>Minimum 8 years of professional experience in pricing or with business intelligence, economic data, financial data analytics or related field</li><li>Minimum 3 years pricing experience</li><li>Bilingual language capability&nbsp;</li><li>Experience on commercial roles</li><li>Experience in auto aftermarket or consumer goods industry</li><li>Strong commercial sense and an entrepreneurial and results oriented style&nbsp;</li><li>Strong project management skills</li><li>Solid data analysis and presentation skills&nbsp;</li><li>Track record of being a self-starter; motivated for professional growth</li><li>Proficiency in relevant tools and software (Excel, SAP, etc.)</li><li>Experience in a SaaS pricing role delivering strategic recommendations to leadership and developing analytical frameworks to determine the best outcomes</li><li>Advanced experience with data analysis, dashboarding, and financial modeling/analysis</li><li>Expertise in market, customer and competitor research</li><li>Experience managing pricing processes with cross-functional partners</li><li>Strong research and synthesis skills (translate data into insights and actions)</li><li>Strong problem-solving and strategic thinking skills</li><li>Must be authorized to work in the U.S.&nbsp;</li></ul><p><strong>What Will Set You Apart</strong></p><ul><li>MBA</li><li>Strong technical skills: Power BI, Python or other programs&nbsp;</li></ul><p><strong>Benefits That Drive Themselves</strong></p><ul><li>Health insurance plans (medical, dental, vision)</li><li>HSA and flexible spending accounts</li><li>401(k)&nbsp;&nbsp;</li><li>Incentive opportunity*</li><li>Life insurance</li><li>Short and long-term disability insurance</li><li>Paid vacation and holidays*</li><li>Employee Assistance Program</li><li>Employee discounts</li><li>Tuition reimbursement*</li><li>Adoption assistance*</li></ul><p><em>*Terms and conditions apply, and benefits may differ depending on position.</em></p><p>Females and minorities encouraged to apply.</p><p>COVID-19 Vaccine Mandate:&nbsp;</p><p>Valvoline is committed to protecting the health of our current and future team members and our customers. COVID-19 vaccines will be required for certain positions and situations effective January 4, 2022, including new U.S. employees joining our company. For more information, you may speak with a member of our HR team during your recruitment process.</p><p>Females and minorities encouraged to apply.</p><p><em>Valvoline provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Are you good at what you do? Join us.</em></p><p><em>The Company endeavors to make its recruitment process accessible to any and all users.&nbsp;Reasonable accommodations will be provided, upon request, to applicants with disabilities in order to facilitate equal opportunity throughout the recruitment and selection process.&nbsp;Please contact Human Resources at 1-800-Valvoline or email&nbsp;1-800Valvoline@valvoline.com&nbsp;to make a request for reasonable accommodation during any aspect of the recruitment and selection process.&nbsp;The contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications.</em></p><p></p>",
    "apply": "https://jobs.valvoline.com/pricing-and-business-optimization-manager/job/19040060",
    "company": "/companies/valvoline",
    "cName": "Valvoline",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Business Analyst-Wealth Management",
    "description": "<p></p><p><strong>Job Description:</strong></p><p><strong>Job Title: Business Analyst</strong></p><p><strong>Location: Remote for now</strong></p><p><strong>Required Qualifications:</strong></p><ul><li><span>Senior Business Analyst with demonstrated qualitative and quantitive skills at industry Brokerage Wealth Management Private banking or Asset Management firms</span></li><li><span>The candidate should have minimum 5 years of relevant experience and be familiar working using the Agile methodology Knowledge</span></li></ul><p><span>- Client On boarding Financial planning Portfolio Construction Portfolio</span></p><p><span>-Trading tax advantaged accounts and the independent advisory business RIA</span></p><ul><li><span>This manager position requires someone with agile scrum skills along with Wealth Management domain experience</span></li><li><span>This seasoned business analyst will compile JIRA artefacts drawing heavily upon product owner input referencing each of the domain dimensions described above referencing the following Client On boarding STP automated workflow experience with DocuSign</span></li><li><span>Intellidox PEGA or IB automated workflow Financial planning Monte Carlo simulation retirement optimization Goals Based Planning Social Security optimizer tax advantaged and taxable accounts glide path probability Portfolio Construction rebalancing asset allocation drift tracking error asset classes portfolio diversification alpha beta benchmarking ETF s Portfolio Trading trade inputs trade types Order Management systems E g Experience with Charles River McGregor or a proprietary retail trading platform highly desirable RIA Registered Independent Advisor product suite including onboarding assets held away trust creation reporting planning Asset held away etc Experience with LPL SEI or a compDuties</span></li></ul><p><strong>About Capgemini:</strong></p><p class=\"ql-align-justify\">Capgemini is a global leader in consulting, digital transformation, technology and engineering services. The Group is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms.&nbsp;Building on its strong 50-year+ heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services&nbsp;from strategy to operations. Capgemini is driven by the conviction that the business value of technology comes from and through people. Today, it is a multicultural company of 270,000 team members in almost 50&nbsp;countries. With Altran, the Group reported 2019 combined revenues of €17billion.</p><p class=\"ql-align-justify\"><strong>What we offer:</strong></p><p>Your career matters to you and is important to us too. Because your goals and needs are constantly evolving, we offer visibility, leeway and support to help you grow and progress in your career. This approach builds notably on our comprehensive competency framework, our personal development, training and career management programs, and our University innovative and business-focused learning curriculums.</p><p>We promote a culture of diversity. We believe working with talented individuals from different backgrounds and points of view is a strategic advantage and an ongoing opportunity. Diversity enriches our creative solutions and adds value for our clients.</p><p><span>With the digital tech sector growing at a rapid pace and women significantly underrepresented in the industry, we are determined to inspire and recruit more women into technology and build diverse teams&nbsp;</span><em style=\"color: rgb(0, 112, 173);\">that reflect the clients we serve</em><span>.</span></p><p>Our Shared values have been at the heart of the group since our formation. They are honesty, boldness, trust, freedom, team spirit, modesty and fun. These values influence the way we meet client needs while respecting the regulatory requirements of each country in which we operate, and the way we promote ethically sound practices within Capgemini and in our partnerships.</p><p>Capgemini is committed to building a workforce of employees with diverse backgrounds and work experiences. We strongly encourage women, veterans and active military service personnel to apply.</p><p><strong>Disclaimer</strong></p><p>Capgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.</p><p>This is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.</p><p>Click the following link for more information on your rights as an Applicant -&nbsp;<a href=\"http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(5, 99, 193);\"><u>http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law</u></a></p><p>Applicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.</p><p></p>",
    "apply": "https://jobs.capgemini.com/us-en/job/New-York-Business-Analyst-Wealth-Management-NY/791121901/",
    "company": "/companies/capgemini",
    "cName": "Capgemini",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Program Assistant",
    "description": "<p></p><p><strong>Organization Overview</strong></p><p>New Incentives uses a cost-effective, evidence-based approach to increase routine childhood vaccinations in northern Nigeria, a region with some of the highest child mortality rates and lowest childhood vaccination rates in the world. Working within government clinics and in conjunction with existing programs, New Incentives provides small cash incentives to caregivers after their infant has received the latest round of vaccinations while also raising awareness about vaccinations and supporting vaccine supply efforts. New Incentives has been named a top charity by GiveWell for two years in a row.</p><p><strong>Job Description</strong></p><p>New Incentives is seeking a Program Assistant to support the organization in its review of team performance to ensure that the organization is achieving its goals.</p><p>The ideal candidate possesses should demonstrate strong work ethics, integrity, and accountability and should have a strong sense of responsibility.</p><p><strong>Responsibilities</strong></p><p>Under the direction of the Program Associate the Program Assistant will assist and provide a supervisory role in the following:</p><ul><li>Weekly routine program review protocols</li><li>Month-end review and closing procedures</li><li>Data analysis and review</li><li>Regular reporting to different units and teams</li><li>Review of staff productivity and output</li><li>Review of program monitoring indicators</li></ul><p><strong>Qualifications and skills</strong></p><ul><li>Can work independently</li><li>Strong supervisory skills</li><li>Relationship builder and team player</li><li>Great attention to detail</li><li>Proactive and process oriented</li><li>Problem-solver</li><li>Fast learner</li><li>Strong analytical skills</li><li>Graduate of any 4-year course, MBA is a plus</li><li>Minimum 5 Years Experience in a similar role</li><li>Minimum 2 Years Experience in Remote Work Environment</li><li>Proficient in Google Sheet or Excel</li><li>Proficiency in LiveAgent is not required but a plus</li><li>Excellent oral and written communication skills in English</li><li>Comfortable working with a diverse group of individuals in different locations and time zones to meet project objectives within established timelines</li></ul><p><strong>What you can expect from this role</strong></p><ul><li>An opportunity to work with an innovative team that is recognized as&nbsp;<a href=\"https://www.givewell.org/charities/new-incentives\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">one of the most cost-effective charities in the world</a></li><li>A challenging role where your abilities will lead to material change and personal growth</li><li>An opportunity to work with a highly accountable and passionate team</li><li>A healthy work-life balance</li><li>The flexibility to work remotely</li><li>A position with significant growth opportunities</li></ul><p>We invite applicants who are highly motivated, detail oriented, and have demonstrated a good fit with the organization's principles of accountability, diligence, and cost-effectiveness. In this role, you will receive significant responsibility and will be responsible for delivering consistently. This role is only for those who are able to meet the challenges of a quickly growing organization running a pioneering program with unique execution. If you succeed in this role, there will be significant opportunities to grow.</p><p>Deadline for the application is&nbsp;6 June, 2022. Applicants will be considered on a rolling basis.</p><p><em>New Incentives is committed to the principles of Equal Employment Opportunity for making employment decisions based on merit and value. We are committed to complying with all federal, state, and local laws providing Equal Employment Opportunities, as well as all laws related to terms and conditions of employment. We desire to maintain maintain a work environment free of harassment or discrimination due to race, sex, color, religion, disability, national origin, or age.</em></p><p><em>Nothing contained in this job description should be construed as an offer or guarantee of employment.</em></p><p></p>",
    "apply": "https://new-incentives.breezy.hr/p/1bae7b904e96-program-assistant",
    "company": "/companies/new-incentives",
    "cName": "New Incentives",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "SVP, Chief Product Manager",
    "description": "<p></p><p>Are you passionate on establishing and driving Service and Operations technology transformation delivering reliable and scalable customer centric product solutions? Are you a seasoned leader who worked with senior business leaders to establish the product roadmap delivering delightful experiences? Do you have proven capability driving digital transformation promoting Omni channel experiences steering away the volumes from traditional voice channel to self-service?</p><p>If yes, then this could be the role for you!&nbsp;</p><p>We have an exciting opportunity to join our Technology organization as a SVP, Chief Product Manager who will be responsible to lead a group of Product Managers driving the digital transformation delivering exceptional end-to-end digital client experiences within Service and Operations functions. As a trusted business partner, you will drive outcomes, lead cross-functional teams, and contribute to the deep and thoughtful analysis that enables our leadership team to make informed decisions regarding product development for our customers.</p><p><strong>Responsibilities:</strong></p><ul><li>Develop roadmaps, plans and metrics that communicate progress, risks, issues and approach to execution that support continuous learning and improve outcomes. Sets a high bar for results through repeatable, scalable processes.</li><li>Work closely with business and technology partners to align goals and priorities, including providing vision for PI events and backlog management.</li><li>Assist in the management of strategic initiatives through the establishment and ongoing leadership of a program governance structure that ensures stakeholder engagement and efficient program and product execution.</li><li>Create best-in-class reports and prepare presentations related to LPL’s strategic plays and growth initiatives that are SVP+, C-Suite, and Board ready.</li><li>Collaborate across the firm to maintain alignment on vision, strategy, and performance to goals, approaching strategy with an entrepreneurial mindset, leveraging critical thinking to increase the value proposition of assigned products and programs.</li><li>Drive decision-making for the business and demonstrate persistence in raising issues to the proper levels for attention and driving transparency at all levels surrounding program execution.</li><li>Coach, mentor and lead a high performing Product manager supporting the products.</li></ul><p><strong>What does your success look like in the first 90 days?</strong></p><p>Learn the LPL business functions, key components of products and technologies within the Service and Operations space. Meet with the executive leadership across technology and business to gain insights into the priorities (OKRs). Support the ongoing efforts to establish the framework to help accelerate outcomes. Share a vision for the team to deliver delightful experiences as the organization transforms and continues to expand.</p><p><strong>What are we looking for?</strong></p><p>We want&nbsp;<strong>visionary leaders who collaborate effectively across the departments and obsess on delivering delightful experiences at scale for our Advisors and Investors.&nbsp;</strong>We are looking for people who thrive in a fast-paced environment, are client-focused, team-oriented, and can execute in a way that encourages creativity and continuous improvement. A leader who promotes an&nbsp;<strong>inclusive and fun culture</strong>.</p><p><strong>Requirements:</strong></p><ul><li>12+ years of experience in product management, management consulting, contact center solutions, program &amp; project management preferably within a financial service or related FinTech firm.</li><li>7+ years of developing, cultivating, and leading strong, high-performing teams in an agile environment.</li><li>Ability to create a strategy/plan that articulates and incorporates compelling business vision.</li><li>Expert communication skills, both written and oral, with ability to create/present executive presentations and serve as one of the recognized subject matter experts on the team.</li><li>Demonstrate business acumen and the ability to interact with senior leaders, including developing, presenting, and gaining approval on any business cases and funding requests.</li><li>Flexibility and organizational change management experience.</li><li>The ability to work in a cross-functional team and drive outcomes without having direct authority.</li><li>Strong analytical skills with demonstrated ability to evaluate business opportunities and evaluate results against established objectives.</li><li>Actively anticipates, identifies, and manages risks within position scope and at the company.</li><li>Expert consensus-builder who drives change across initiatives within and outside direct accountability and evaluates solutions to the most complex business challenges.</li></ul><p><strong>Core Competencies:</strong></p><ul><li>Establish compelling product vision that is grounded on the business needs, competition and industry outlook.</li><li>Obsess on delivering exceptions Advisor, Investor and Employee experiences.</li><li>Ability to synthesize complex solutions into easily implementable solutions paving the way for incremental delivery.</li><li>Data driven leader who establishes OKRs, KPIs and inspires the delivery of customer centric solutions</li><li>Strategic leader who anticipates the future and inspires the team to deliver platforms that enable delightful experiences at scale</li><li>Excellent people leader who has demonstrated experience building highly effective teams</li></ul><p></p>",
    "apply": "https://careers.lpl.com/job/fort-mill/svp-chief-product-manager/702/30019028864",
    "company": "/companies/lpl-financial",
    "cName": "LPL Financial",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Product Documentation Manager",
    "description": "<p></p><p>Tetrate is a leading enterprise service mesh company that enables a safe and fast application modernization journey for our customers.&nbsp;We were recently named a 2022 Forbes America’s Best Startup Employer after being evaluated for employer reputation, employee satisfaction, and growth. Grow with us and complete our ‘mesh’!</p><p>Join a team of world-class engineers working on the next generation of networking services using Istio, Envoy and other open source projects to define the next generation of cloud native network service.&nbsp;</p><p>We are seeking a&nbsp;Product Documentation Manager&nbsp;and a leader whose job is to build, maintain, and improve user-facing documentation of our product.</p><p>We are building a secure, robust, and highly available service mesh platform for mission-critical enterprise applications spanning both legacy and modern infrastructure. Providing the documentation that allows our customers to achieve their goals in developing their application will be the main challenge you will be solving.</p><p>If you believe that great software alone does not make a great product, and you care about user experiences when they are confronted with the daunting task of building complex, large infrastructure, you will find this role to be a fit for your wants.&nbsp;</p><p><strong>What You’ll Do:</strong></p><ul><li>Work with the development team to come up with user-facing documentation&nbsp;</li><li>Create and maintain the process/workflow to make continuous improvements on the documentation.</li><li>Develop and lead a team to drive the documentation writing process.</li></ul><p><strong>Skills You Have:</strong></p><ul><li>Understanding of the needs from an average developer with regards to documentation. Documentation will be read by developers of various skill levels, and it will need to provide ample background information for the untrained, and direct access to the solution for the veterans.</li><li>Excellent command of written English, specifically in technical writing.</li><li>Either of</li><li class=\"ql-indent-1\">1) Intimate knowledge of application development on modern cloud native environments including Google Cloud Platform, AWS, Azure, etc, using service mesh technologies such as Istio and Envoy, or</li><li class=\"ql-indent-1\">2) Excellent communication skills to draw out information from the developers, especially about the underlying assumptions that our products make about the environment.</li><li>Good understanding of fundamental networking protocols and concepts, as well as related middlewares.</li><li>Experience being a developer on software projects is a plus. While it is technically not a requirement, it will be much easier if you have experience being on the receiving end of product documentation.</li><li>Experience in writing technical articles, such as blog zines, for a wide audience is a plus.&nbsp;Meaning, you know how to write a convincing article to people who aren’t as familiar about networking, let alone a service mesh or TSB</li><li>Fundamentals-based problem-solving skills; Drive decision by function, first principles based mindset. We are not “title” driven and we value results over process</li><li>Demonstrate bias-to-action and avoid analysis-paralysis; Drive action to the finish line with high quality and on time</li><li>You are ego-less when searching for the best ideas; You contribute effectively outside of your specialty; You think about solving problems from the standpoint of the best outcome for the team.&nbsp;&nbsp;</li><li>Values autonomy and results over process</li></ul><p><strong>Location:</strong></p><p>Worldwide – We are a 100% globally distributed company.</p><p></p>",
    "apply": "https://www.tetrate.io/career/product-documentation-manager/",
    "company": "/companies/tetrateio",
    "cName": "Tetrate.io",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Product Manager-Ecological Data",
    "description": "<p></p><h4><strong>Description</strong></h4><p>Are you a blockchain enthusiast or geo-spatial data nerd looking to make the move from big tech? Do you have experience managing open source development? Are you a seasoned technical leader or product manager looking for a new challenge? One where you can play a key role in leveraging technology to help combat climate change?</p><p>Regen Network Development, Inc is looking for a Product Manager to lead and manage several initiatives related to how ecological data manifests on Regen Network, both on- and off-chain. Working closely with our internal product team, credit class issuers, project developers, and the Regen Registry Program team, you will lead standards definition for how we index and store structured data on&nbsp;<a href=\"https://regen.network/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Regen Network</a>. As our resident expert on data best practices, you will utilize current available functionality on Regen Ledger and our Registry application to champion and educate on data usage of Regen Network for key partners, projects and methodology developers.</p><p>You will be responsible for driving the direction and milestones of our Data Standards Working Group, where we’ve convened a set of key partners and collaborators to help us refine standards, best practices and key use cases for ecological data on Regen Network.</p><p>You will work closely with the rest of the product team to drive product evolution for our data infrastructure tooling and applications. Long term, success in this role will lead to growing a team focused specifically on delivering our ecological data story, where you would lead use case analysis, product definition, partnering with design, and managing a development backlog for a dedicated ecological data product team.</p><h4><strong>Requirements</strong></h4><ul><li>Guide Regen’s data product strategy by collecting, analyzing and assimilating information and feedback from users, internal stakeholders, and external collaborators to guide product specifications</li><li>Lead the Regen’s Data Standards Working Group, defining milestones and facilitating meetings</li><li>Work with key partners to provide education for, and support implementation of indexing ecological data on Regen Network</li><li>Define data schemas, standard, and architecture for off-chain data storage for Regen Registry</li><li>Identify user segments, define personas, prioritize problems and needs, ideate solutions, define MVP, create feature backlog and guide implementation</li><li>Operationalize carbon credit tokenization and related Regen Registry technical operations</li><li>Identify business goals. Define and analyze metrics that inform the success of our products.</li><li>Run effective meetings and work sessions. Facilitate continuous process improvement.</li></ul><p><strong>Your background &amp; skills</strong></p><ul><li>4+ years experience in product or technical project management, working collaboratively with engineering and design.</li><li>Experience in highly technical environments with difficult technology challenges.</li><li>Enthusiasm and curiosity about blockchain and/or distributed systems.</li><li>Track record in a fast moving startup environment</li><li>1+ years experience in a technical role (software engineering, developer relations, devops, etc)</li></ul><p><strong>Nice to Haves</strong></p><ul><li>Experience in blockchain, distributed systems, and related cryptographic technologies</li><li>Experience with geospatial data storage, agriculture, and/or life sciences</li><li>Experience with graph based frameworks for structuring data such as RDF, SHACL, JSON-LD, or JSON Schema</li></ul><h4><strong>Benefits</strong></h4><p>A rapidly growing small team of experienced individuals, iterating and scaling fast, where you’ll be hands-on, collaborating, and learning right away. The opportunity to work with a diverse, global, and passionate team that celebrates personal agency. Collaboration with leading projects and thought leaders in the blockchain, Cosmos, and refi space. We are a fully-remote team working across 4 continents.</p><p>Work week: Monday to Thursday (<a href=\"https://www.4dayweek.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">4 day work week</a>). Unlimited time off. Company computers. This position includes a token/equity incentive compensation plan.</p><p>For US based employees we offer full health insurance including medical, dental and vision, and we offer an unlimited vacation policy.</p><p>Regen Network is committed to inclusion and diversity and is an equal opportunity employer. All applicants will receive consideration without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, disability, or veteran status.</p><p>If you're up for the challenge of a lifetime, we're looking for outstanding talent to join our team.</p><p></p>",
    "apply": "https://apply.workable.com/regen-network/j/728427FEC6/",
    "company": "/companies/regen-network",
    "cName": "Regen Network",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "CUSTOMER SUCCESS SPECIALIST",
    "description": "<p></p><p><strong>Job Description</strong></p><p><span>The Customer Success Specialist manages a focused portfolio of site-based accounts to ensure that they achieve their business outcome with Rockwell Automation’s subscription and services contracts.&nbsp; Responsible for ensuring effective technology and services adoption that leads to high renewal rates and expansion of annuity-based contracts and subscriptions.</span></p><ul><li>Uses data and workflow information from Customer Success Platform (Gainsight) to remotely execute Onboarding, Adoption, Expansion, and Renewal motions relevant to each account in portfolio</li><li>Remotely communicates value delivered to customer on a periodic cadence using Business Review methodology and other means of<span> communication/cadences</span></li><li>Analyze customer contract usage data contained within Customer Success Platform and other sources to look for trends and remotely communicate value delivered to the customer by engaging in Services contracts and software subscriptions</li><li>Accountable for monitoring and driving contract renewal proposal goals</li><li>Support Internal and External field-based Customer Success teams remotely with contract onboarding, adoption and expansion opportunities and assist with renewal of contracts</li><li>Foster a cohesive team environment with Sales, Delivery and Distributor team members on behalf of customer.</li><li>Collaborate with team members to ensure an optimal customer experience</li><li>Takes ownership in overall development including technical, commercial and personal by having a documented 70-20-10 plan</li><li>Leverage Gainsight automated escalation rules to connect contract customers with the broader Customer Success team to promote contract adoption, expansion opportunities, or avert risk</li><li>Proactively intervene with customer when contract usage is low or account is deemed at risk, to improve contract adoption and reduce customer churn</li><li>Conduct internal and external presentations focused on processes and best practices related to accelerating customer adoption and expansion</li><li>Work on issues where analysis of the situation requires a good understanding of organizational objectives.</li><li>Frequently interact with functional peer groups, channel partners, and customers.</li><li>Enhance service contract renewal process to improve on-time renewal, expansion and<span> profitability.&nbsp;</span> Deliverables include:</li><li class=\"ql-indent-1\">Document renewal price and scope changes so they can be easily articulated</li><li class=\"ql-indent-1\">Analyze lifecycle changes in customer’s installed base, identifying opportunities for modernization</li><li class=\"ql-indent-1\">Analyze trends in customer’s contractual and transactional usage, identifying opportunities for expansion</li><li class=\"ql-indent-1\">Maximize renewal price realization based on contract costs, customer usage and health</li><li class=\"ql-indent-1\">Deliver renewal proposals 180 to 90 days prior to expiration</li><li>Influence a companywide culture focused around the customer and their journey with our technology.</li></ul><p><strong>Basic Qualifications</strong></p><ul><li><span>Bachelor's Degree</span></li><li><span>Legal authorization to work in the US is required. We will not sponsor individuals for employment visas, now or in the future, for this job opening.</span></li></ul><p><strong>Preferred Qualifications</strong></p><ul><li>2+ Years of Experience working with customers</li><li>Experience working in teams</li></ul><p><span>*For the right candidate, this position could be worked remotely from any location in the US</span></p><p><span>**This position is part of a job family. Experience will be the determining factor for position level and compensation.</span></p><p>#LI-AA1</p><p>We are an Equal Opportunity Employer including disability and veterans.&nbsp;</p><p>If you are an individual with a disability and you need assistance or a reasonable accommodation during the application process, please contact our services team at +1 (844) 404-7247.</p><p></p>",
    "apply": "https://rockwellautomation.wd1.myworkdayjobs.com/en-US/External_Rockwell_Automation/job/Mayfield-Village---Ohio/CUSTOMER-SUCCESS-SPECIALIST_R22-5793-1",
    "company": "/companies/rockwell",
    "cName": "Rockwell Automation",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Engagement Specialist",
    "description": "<p></p><h4><strong>Description</strong></h4><p>Leadfeeder is a remote first, fast-growing international SaaS startup, headquartered in Finland. We are on a mission to bring web intelligence to our customers. Simply put, Leadfeeder helps companies know more about their website traffic, which enables them to convert promising visitors into sales leads.</p><p>What sets us apart? We are a market leader with a solid business model ready to be scaled. Our data-driven and customer-centric approach keeps us grounded while providing a basis for sustainable and ambitious growth. We have a buzzing international team of 130+ people based in 30 different countries, and we are currently hiring top talent across borders to help us double in size in the next 12 months.</p><p>Are you a self-starter looking to learn and grow as part of a world-class team? Join our journey!</p><p>We are now looking for a Customer Engagement Specialist to work on various initiatives to improve the service we offer to our premium customers. We are open to either remote or office based - we have offices in Helsinki, Stockholm, Copenhagen and Utrecht which you could work from if you wish.</p><p><strong>Responsibilities</strong></p><ul><li>Further developing our Leadfeeder Academy - the place where many of our customers go to learn how to use our product.</li><li>Creating and implementing engagement strategies that will drive more of our customer base to use our academy and spend more time using Leadfeeder itself.</li><li>Creating and implementing strategies to improve customer retention.</li></ul><p><strong>Requirements</strong></p><ul><li>Experience with B2B sales and marketing.</li><li>Understanding of modern saas businesses such as ours.</li><li>Experience in Customer Success or Customer Marketing (both would be a huge plus!)</li><li>Excellent written and spoken communication in English.</li><li>High level of customer empathy and commercial awareness.</li><li>A self starter with the ability to craft the role to your own skill set.</li><li>Ability to work independently and as part of a team.</li><li>Collect and socialise customer successes and feedback to the wider Team.</li></ul><p><strong>What will you be doing?</strong></p><p>Creating content for premium clients with a high focus on our smallest customers (&lt;$145 MRR- Tier 4)</p><ul><li>Creating (and iterating upon) automated messaging through intercom and Freshsuccess.</li><li>Creating and updating Academy courses - videos, transcripts and accompanying articles</li><li>One-off messaging and campaigns based on short term business goals - i.e. winback campaigns.</li><li>Working with customers 1-2-1 where circumstances require - i.e gathering churn feedback, executing winback activities.</li><li>Helping with help centre content as necessary</li></ul><p><strong>Analysing Tier 4s and spotting trends / behaviour / potential, including:</strong></p><ul><li>Product usage</li><li>Content consumption &amp; how this impacts usage, adoption and churn.</li></ul><p><strong>Goals for the role;</strong></p><p><strong>Improve the following metrics for Tier 4 customers:</strong></p><ul><li>Adoption</li><li>Gross / Net Churn</li><li>Expansion Revenue</li><li># of case studies</li><li>NPS</li><li>Academy usage</li></ul><p><strong>Benefits</strong></p><ul><li>The chance to work with a very knowledgeable, high-achieving, and fun team</li><li>An international, diverse, fast-paced, and results-oriented work environment</li><li>The opportunity to work remotely, with a flexible work schedule to suit your needs</li><li>Competitive compensation</li><li>Bi-annual company retreats abroad - the last two were in Spain &amp; Greece</li></ul><p></p>",
    "apply": "https://apply.workable.com/leadfeeder/j/D189E85974/",
    "company": "/companies/leadfeeder",
    "cName": "Leadfeeder",
    "location": "UK",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Success Specialist",
    "description": "<p></p><h4><strong>Description</strong></h4><p>LearnWorlds is on a mission to educate. Our all-in-one platform empowers online trainers, educators and enterprises to create unique, interactive, and social learning experiences. A fully customizable, white-label solution to train employees and associates, educate customers or sell online courses to a wide audience.</p><p>We enable our users to create whole e-learning websites, author online courses, and provides the tools to market &amp; sell them both as B2B and B2C products. We have done this through the creation of a cloud based e-learning platform that can be tailored to the users specific needs. Much more than just selling online courses, we have created everything required for a holistic and complete online learning experience.</p><p>Today, LearnWorlds has c.5,000 customers in more than 120 countries with 40% of them coming from the US. Our headquarters are in Limassol, Cyprus, and we have offices in Chania, Greece, however over 90% of the 120-member team is fully remote. With the latest funding, the company plans to double the number of its current employees and reach 170 full-time employees in 2022 by hiring more international talent beyond Greece whilst opening an office in Athens.</p><p>Reflective of growing activity in the ed-tech sector, LearnWorlds has recently secured a $32m investment from Insight Partners, a world-class VC firm, with a view to boost customer success, accelerate the marketing function and build out the customer base, with a focus on SMBs.</p><p><strong>About the role</strong></p><p>We are looking for a technically savvy Customer Success Specialist who possesses a strong drive for results. Duties for the Customer Success Manager will include a broad range of tasks such as maintaining ongoing customer relationships and networking, implementing success programs, contributing to sales, onboarding and training clients, and minimizing churn. You should also be able to provide insights on client-to-business interactions, improve customer experience through product support, and handle customer complaints and requests.</p><p><strong>Responsibilities</strong></p><ul><li>Develop and manage client portfolios</li><li>Drive adoption and make sure customers use LearnWorlds to its full extent</li><li>Focus on customer loyalty and build close long-term client relationships</li><li>Sustain business growth and profitability by maximizing value</li><li>Hold product demonstrations for customers</li><li>Improve customer onboarding processes</li><li>Mediate between clients and LearnWorlds</li><li>Handle and resolve customer requests and complaints</li><li>Minimize customer churn</li><li>Be part of product design and product development discussions with your input</li></ul><h4><strong>Requirements</strong></h4><ul><li>At least 2+ years of experience in Customer Support, Customer Success or Sales</li><li>Experience in SaaS would make a huge difference</li><li>BS or BA degree in Marketing, Communications or other related fields</li><li>Highly organized and able to multi-task with strong time management skills</li><li>Self-driven and proactive nature</li><li>Excellent English communication and interpersonal skills</li><li>Tech-savviness and ability to learn new software</li><li>Knowledge of customer success processes</li><li>Basic understanding of digital marketing principles will be a plus</li><li>Passion for service, positive attitude and a team player</li><li>Calm and fast problem-solver</li></ul><h4><strong>Benefits</strong></h4><ul><li>Competitive salary and a bonus scheme</li><li>Private life and health insurance plan for you and you family</li><li>Fully remote work if you prefer to work from home</li><li>Work in one of the top five e-learning courses platform with customers in more than 100 countries</li><li>An opportunity to grow alongside us and shape the look and feel of tomorrow's e-learning</li><li>An entrepreneurial, international, and highly motivated team with a flat hierarchy that will both challenge you and help you reach your highest potential</li><li>Continuous training and mentoring opportunities. Access to books, resources, training, and conferences</li><li>Culture committed to work-life balance and flexible hours</li><li>Annual company retreats (<a href=\"https://www.youtube.com/watch?v=wP0jHl_liGg\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">see the video of our latest retreat</a>)</li></ul><p></p>",
    "apply": "https://apply.workable.com/learnworlds/j/6A291C2F80/",
    "company": "/companies/learnworlds",
    "cName": "LearnWorlds",
    "location": "Greece",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Ethics and Compliance Specialist",
    "description": "<p></p><p><strong>Job Description </strong></p><p><strong>Summary</strong></p><p>embecta, formerly part of BD, is one of the largest pure-play diabetes care companies in the world, leveraging its nearly 100-year legacy in insulin delivery to empower people with diabetes to live their best life through innovative solutions,&nbsp;partnerships&nbsp;and the passion of more than 2,000 employees around the globe. For more information, visit <a href=\"http://embecta.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 69, 147);\">embecta.com</a>.</p><p><strong>This role offers the flexibility to work remotely!</strong></p><p><strong>Job Summary</strong></p><p>The Ethics and Compliance Specialist will assist in the day-to-day development, maintenance, and oversight of the global compliance program at embecta.&nbsp;This is a great opportunity for a compliance professional looking to broaden their expertise in the healthcare compliance space.&nbsp;This position requires strong attention to detail, organizational, collaboration and communication skills and reports to the Senior Director, Ethics, Compliance and Privacy.</p><p><strong>Main responsibilities will include:</strong></p><ul><li>Administer day-to-day operation of embecta’s reporting hotline and case management database, including conducting appropriate follow-up activities in consultation with the Senior Director, Ethics, Compliance and Privacy.</li><li>Provide support for compliance committees, including the review and update of agenda items, charters, schedules and communication schedules, and the development of materials and presentations.</li><li>Assist with the review and assessment of submissions for proposed activities or expenditures related to healthcare professionals, medical institutions and other government officials to ensure compliance with the organization’s policies and procedures.</li><li>Provide administrative support of third-party due diligence activities and coordinate with internal and external stakeholders to resolve issues.</li><li>Co-develop and track and maintain compliance dashboard(s) and provide periodic reporting.</li><li>Collaborate cross-functionally across the organization to support the implementation of policies, systems and programs that drive organizational compliance with relevant laws, regulations, and standards.</li><li>Maintain template forms and agreements for healthcare professional/organization events, consultancies, sponsorships, etc.</li><li>Based on interest, support other compliance priorities and special assignments related to Export &amp; Trade Controls, Sanctions, Anti-Bribery and/or Data Privacy.</li></ul><p><strong>About you</strong></p><ul><li>For this role, we are looking for a compliance professional with approximately 5 years of experience in compliance, healthcare compliance experience is a plus</li><li>The ideal candidate is hands-on, willing to roll-up their sleeves and acts as a partner to the business</li><li>Bachelor’s degree in Healthcare, Business, Legal, Accounting, or Finance, or in a related field required; paralegal degree or certification is a plus</li><li>Ability to handle ethics and compliance matters with sensitivity and maintain strict confidentiality of all work materials and activities</li><li>Adept at identifying compliance issues, act decisively when needed and to instruct the business accordingly</li><li>Excellent oral and written communication skills, strong interpersonal skills, ability to work well independently and cross-functionally</li><li>Thrives in a fast-paced environment, prioritizes and handles multiple tasks, and exhibits attention to detail</li></ul><p>For certain roles at&nbsp;embecta, employment is contingent upon the Company’s receipt of sufficient proof that you are fully vaccinated against COVID-19. In some locations, testing for COVID-19 may be available and/or required. Consistent with BD’s Workplace Accommodations Policy, requests for accommodation will be considered pursuant to applicable law.</p><p>Embecta&nbsp;is an Equal Opportunity/Affirmative Action Employer. We do not unlawfully discriminate&nbsp;on the basis of&nbsp;race, color, religion, age, sex, creed, national origin, ancestry, citizenship status, marital or domestic or civil union status, familial status, affectional or sexual orientation, gender identity or expression, genetics, disability, military eligibility or veteran status, or any other protected status.</p><p>Primary Work Location</p><p>USA NJ - Franklin LakesAdditional Locations</p><p>USA FL - Miami, USA GA - Covington BMD, USA IL - Vernon Hills, USA MA - Andover, USA MD - Sparks - 26 Loveton Circle, USA MN - Minneapolis Medina Rd, USA NC - Cary, USA OH – Mason, USA SC - Sumter, USA TX - Austin, USA TX - San Antonio, USA UT - Salt Lake CityWork Shift</p><p></p>",
    "apply": "https://jobs.bd.com/job/-/-/159/29850807616",
    "company": "/companies/bd",
    "cName": "BD",
    "location": "North America",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Director, Financial Operations",
    "description": "<p></p><p><strong>Company Description</strong></p><p>When you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For more than 20 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 16,000 academic institutions, publishers, and corporations use our services: Gradescope by Turnitin, iThenticate, Turnitin Feedback Studio, Turnitin Originality, Turnitin Similarity, ExamSoft, and ProctorExam.</p><p>Turnitin has offices in Australia, India, Indonesia, Japan, Korea, Mexico, the Netherlands, the Philippines, Ukraine, the United Kingdom, and the United States. Our diverse community of colleagues are all unified by a shared desire to make a difference in education. Come join us, and let's make change together.</p><p><strong>Job Description</strong></p><p>“The CFO organisation at Turnitin is at a pivotal moment in securing our ability to scale with the business as it grows and to support our stakeholders. Establishing a dedicated financial operations Group will be key to our success”​</p><p><strong>&nbsp;Job Description</strong></p><p>The Director, Financial Operations role is for a strategic, experienced leader to oversee Accounts Payable, Payroll, Accounts Receivable and other related activities, globally.&nbsp;</p><p>Reporting into the VP of Accounting, the successful candidate will become part of a fast-growing business upon which they will be expected to exercise their influence and leadership in achieving consistency and compliance across our key business processes as well as identifying and putting into action any opportunities for improvement.</p><p>This role will suit a candidate who is experienced partnering with stakeholders at all levels in the organisation, has experience driving organisational change and most importantly is willing to roll up their sleeves and get involved.</p><p><strong>Key Responsibilities&nbsp;</strong></p><ul><li>You will partner with the VP of Accounting in defining how Turnitin will approach financial operations in the future, including</li><li class=\"ql-indent-1\">The definition, implementation and ongoing monitoring of operational KPIs;</li><li class=\"ql-indent-1\">The design and implementation of an organisational structure to enable the operational finance team to scale with the business as it grows in line with the long range financial plan</li><li>You will work with the VP of Accounting to lead an ambitious finance systems and process transformation programme through 2022. Your previous experience in systems/process design will empower you to lead and inspire innovation on the project, managing internal and external stakeholders.</li><li>&nbsp;</li><li>You will lead the adoption of new/improved business processes flows, managing the transition from the existing processes, communication to stakeholders and adherence with policy;</li><li class=\"ql-indent-1\">Procure to Pay (P2P)</li><li class=\"ql-indent-1\">Order to Cash (O2C)</li><li class=\"ql-indent-1\">Payroll</li><li>You will lead a team of 15 subject matter experts across four key functional areas and four geographies, inspiring them to do their best work and be successful in what they do.</li><li>As part of this you will own the finance element of the customer experience (billing and collections), the vendor experience (onboarding and payments) and the employee experience (payroll).</li><li>You will lead the expansion of this team as the business continues to grow.</li><li>You will lead the implementation of additional payrolls as we expand globally including transitions from PEOs, where necessary</li><li>You will lead the provisioning of additional billing and collections models as we expand globally</li><li>You will be a key point of contact for internal and external stakeholders, including</li><li class=\"ql-indent-1\">Sales colleagues</li><li class=\"ql-indent-1\">Requesitioners and buyers across the business</li><li class=\"ql-indent-1\">The Global People team</li><li class=\"ql-indent-1\">Vendors</li><li class=\"ql-indent-1\">Customers</li><li class=\"ql-indent-1\">Employees</li></ul><p><strong>Qualifications</strong></p><p>You are an accomplished leader, with experience of working in a complex, global organisation. You have a proven record of driving continuous improvement and inspiring your people to embrace change. You are a strong communicator. You are an independent worker who is proactive and results-driven.</p><p><strong>Highly desirable:</strong></p><ul><li>Experience of working within, auditing or overseeing the activities of a finance shared service centre</li><li>Leadership experience within a complex, global organisation</li><li>Strong presentation skills to all levels of management including Executive</li><li>Experience of leading a multi-functional team</li><li>Experience of having ownership/oversight of ERP subledger activities, such as Accounts Payable, Accounts Receivable and Payroll</li><li>Experience of the design and reporting of operational financial KPIs</li><li>A proven track record of process improvement</li><li>Experience of leading a finance systems transformation project</li><li>Prior working knowledge of NetSuite, SFDC, ADP and Tipalti systems would be advantageous</li></ul><p><strong>Additional Information</strong></p><p><strong>Our Mission</strong>&nbsp;is to ensure the integrity of global education and meaningfully improve learning outcomes.&nbsp;</p><p><strong>Our Values&nbsp;</strong>underpin everything we do.</p><ul><li><strong>Customer Centric&nbsp;</strong>- We realize our mission to ensure integrity and improve learning outcomes by&nbsp;putting educators and learners at the center of everything we do.</li><li><strong>Passion for Learning</strong>&nbsp;- We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.</li><li><strong>Integrity</strong>&nbsp;- We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.</li><li><strong>Action &amp; Ownership</strong>&nbsp;- We have a bias toward action and empower teammates to make decisions.</li><li><strong>One Team</strong>&nbsp;- We strive to break down silos, collaborate effectively, and celebrate each other’s successes.</li><li><strong>Global Mindset</strong>&nbsp;- We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.</li></ul><p></p>",
    "apply": "https://jobs.smartrecruiters.com/TurnitinLLC/743999829495357-director-financial-operations-usa-remote-",
    "company": "/companies/turnitin",
    "cName": "Turnitin",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Sr. Financial Analyst",
    "description": "<p></p><p>Openly is rebuilding insurance from the ground up. We are re-envisioning and enhancing every aspect of the customer experience. Doing this requires a rapidly growing team of exceptional, curious, empathetic people with a wide range of skill sets, spanning technology, data science, product, marketing, sales, service, claims handling, finance, etc.</p><p><strong>Now is the perfect time to join the journey. Here’s why:</strong></p><ul><li>It’s working. We’re in multiple states and on our way to operating countrywide. We have thousands of agents selling our product and millions of dollars of annual customer premiums.</li><li>We’re well backed &amp; stable. We closed our $40M Series B fundraise. We are supported by some of the top investors globally, including Google’s “<a href=\"https://www.gradient.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">Gradient</a>” AI-focused fund,&nbsp;<a href=\"https://obvious.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">Obvious Ventures</a>&nbsp;(Beyond Meat, etc.), and&nbsp;<a href=\"https://www.avp.vc/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">Advance Venture Partners</a>.</li><li>It’s not too late! Despite this traction and stability, we’re still early enough in the journey that there’s time to make a real difference during Openly’s formative period.</li></ul><p>If you’d like to understand more about Openly’s mission, consider checking out this&nbsp;<a href=\"https://vimeo.com/267654520\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">video</a>&nbsp;from a company pitch we gave several years ago at Techstars.</p><p><strong>Job Details</strong></p><p>We are seeking a highly capable Senior Financial Analyst to support our growing finance organization. In this role, your duties will include supporting the financial month-end close and consolidation, reporting on financial results, developing business financial plans, producing ad-hoc financial analysis, and supporting the implementation of financial systems.</p><p>To ensure success as a financial analyst, you should possess extensive accounting or financial planning and analysis experience within the insurance industry.</p><p><strong>Key Responsibilities</strong></p><ul><li>Assist in preparing financial reporting packages, which includes the accounting and preparation of monthly/quarterly/annual financial statements in US GAAP and Statutory basis, as well as internal financial reporting dashboard and presentations</li><li>Perform accounting close functions including reconciliations, journal entry preparation, accrual processes, and cash accounting.</li><li>Support the development of a rolling forecast and assist in the creation of annual financial planning and budgeting</li><li>Analyze monthly financial results and generate monthly reporting dashboards</li><li>Prepare ad-hoc financial analysis to support management decision making</li><li>Support tax and audit processes</li><li>Support the implementation and maintenance of new general ledger and other financial systems</li></ul><p><strong>Requirements</strong></p><ul><li>Minimum 3-5 years of experience in accounting and financial analysis</li><li>Bachelor's degree</li><li>Progress towards MBA or CPA preferred</li><li>Insurance industry experience preferred</li><li>Experience with NetSuite is preferred but not required</li></ul><p><strong>Benefits &amp; Perks</strong></p><ul><li>Competitive salary, corporate bonus program, equity position in a start-up company</li><li>Company-sponsored medical, dental, vision insurance plans, short-term and long-term disability, life insurance, 401k with corporate contribution, and FSA plan</li><li>Company-paid 12 weeks parental leave policy</li><li>The company fully embraces the “work-from-anywhere” mentality, even before COVID restrictions.</li><li>Paid Time Off</li><li>Fun, fast-paced, startup environment</li></ul><p>U.S. Citizens, Green Card Holders, and those authorized to work in the U.S. for any employer will be considered.</p><p>Openly is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, sex, gender identity or expression, age, religion, national origin, ancestry, ethnicity, disability, veteran status, genetic information, sexual orientation, marital status, or any characteristic protected under applicable law. Openly is an E-Verify Employer in the United States. Openly will make reasonable accommodations for qualified individuals with known disabilities under applicable law.</p><p></p>",
    "apply": "https://openly.breezy.hr/p/463e56976609-sr-financial-analyst",
    "company": "/companies/openly",
    "cName": "Openly",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Head of Marketing",
    "description": "<p></p><p><strong><em>YOUR JOURNEY STARTS HERE...</em></strong></p><p><strong><u>OUR VALUES</u></strong></p><p>This position presents the opportunity to work in a business-critical role in a rapidly growing company. You will also uphold our four core values:</p><ul><li>Be the solution - take ownership, drive collaboration</li><li>Be resourceful - strive for new wins every day</li><li>Be honest - default to transparency</li><li>Be respectful - treat others like you want to be treated</li></ul><p>We encourage applicants from diverse backgrounds and underrepresented groups and would invite you to apply. A diverse workforce is a highly productive one, so why not take a chance, send us your application&nbsp;<u>even if you don't meet all our requirements,</u>&nbsp;we may surprise you!</p><p><em>“Culture add”</em>&nbsp;is so much better than \"culture fit\" and welcome applications from all groups, irrespective of your, age, disability, gender reassignment, gender, marriage and civil partnership, pregnancy and maternity, race, religion or belief, sex, veteran status and sexual orientation.</p><p><strong><u>THE ROLE</u></strong></p><p>Reporting to the CRO/Co-founder, WeTravel is seeking a dynamic individual to join our growing global team as the Head of Marketing.</p><p>You will be responsible of overseeing 3 managers (direct reports) and 7 specialists.</p><p>This is a remote opportunity with preference of working U.S East Coast hours.</p><p><strong>Responsibilities</strong></p><ul><li>Define marketing strategy to support the scaling of the company from $5-10M ARR to $30-$50M ARR</li><li>Double MQLs to 30-40% of sales team's new leads</li><li>Establish and strengthen WeTravel's brand as a thought leader in the multi-day travel segment</li><li>Manage and build a team of marketing managers and specialists (currently split across 3 functions: inbound marketing, PR/communications, and product marketing)</li><li>Oversee all marketing campaigns and monitor the results/CAC/ROI</li><li>Work and coordinate with three other heads of the company's revenue-side organization: Head of Sales, Head of Partnerships, and Head of Account Management</li></ul><p><strong><em>Must-have</em></strong></p><ul><li>B2B marketing experience</li><li>SMB SaaS experience</li><li>People management experience</li><li>Working knowledge of inbound marketing</li><li>Working knowledge of public relations/brand</li><li>Working knowledge of product marketing/sales enablement</li></ul><p><strong><em>Nice-to-have</em></strong></p><ul><li>Travel tech, travel, or fintech experience</li></ul><p><strong><u>ABOUT US</u></strong></p><p>WeTravel (www.wetravel.com) is an online fintech payment platform that transforms travel companies’ finances, communication, and marketing from a lot of manual paperwork to digital. We are a very well funded VC-backed company, bringing together a diverse and highly motivated team.</p><p>Read about us on TechCrunch, Huffington Post, Yoga + Life, Financial Times (FT), Skift, Lonely Planet, etc:&nbsp;<a href=\"http://www.wetravel.com/press\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">www.wetravel.com/press</a></p><p><strong><u>Compensation</u></strong></p><ul><li>Attractive compensation</li><li>Unlimited Paid Time Off!</li><li>Remote first option</li><li>As a travel-related company, we have fantastic team retreats, two of our founders love surfing, so it's normally beside a great beach</li><li>The latest tech you need to be successful</li><li>1099 / consulting agreement</li><li>Employee status also available for selected locations to include medical insurance contribution.</li><li>For candidates resident outside North America salaries are weighted according to local factors and considerations</li></ul><p></p>",
    "apply": "https://wetravel.breezy.hr/p/2e9aa427d09501-head-of-marketing-remote",
    "company": "/companies/wetravel",
    "cName": "WeTravel",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Product Marketing Director",
    "description": "<p></p><h4><strong>Description</strong></h4><p>ioby seeks a Product Marketing Director to join our small and growing national team. Reporting to the CEO, the Product Marketing Director will be responsible for setting the organization’s marketing strategy including inbound marketing and lifecycle marketing, and will play a critical role in shaping the way ioby changes our products and services grounded in learnings from our work responding to the many crises of the past two years.</p><p>ioby’s ideal candidate must be committed to racial justice and asset-based ethical storytelling, comfortable and experienced in reprioritization, excited to collaborate closely with ioby’s product, communications, and support teams, and be the expert in product marketing for our team with diverse backgrounds and experiences.</p><p>This is a full-time role.</p><h4><strong>Requirements</strong></h4><p><strong>Qualified candidates&nbsp;<em>must have&nbsp;</em>the following characteristics:</strong></p><ul><li>2+ years experience managing staff</li><li>Experience building a lifecycle marketing strategy that includes organic and paid reach, lead generation, customer conversion, and remarketing strategies</li><li>A natural planner who is able to quickly recalibrate priorities and convert requests from various teams into a manageable and organized workload for the Community and Marketing team</li><li>Civic-minded; dedicated to ioby's mission to invest in civic leaders</li><li>Committed to Antiracism; Desire to contribute to a Racial, Equity, and Inclusion framework at a company or nonprofit organization, including ioby’s&nbsp;<a href=\"https://blog.ioby.org/announcing-iobys-digital-inclusion-policy/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">Digital Inclusion Policy</a></li><li>Committed to working equitably across lines of reporting</li><li>Demonstrated success with inbound marketing, content calendars, and content marketing</li><li>Experience building email nurturing series in Hubspot or other email automation tool</li><li>Experience managing a marketing and ads budget and a number of simultaneous marketing campaigns, including evaluation and insights</li><li>Experience managing SEO, digital &amp; social media channels; growing and building trust with audience</li><li>Experience setting and measuring progress on marketing goals, and in translating business goals into marketing strategies</li><li>Nimble, flexible, strong in reprioritization</li><li>Thoughtful, tactful, and considerate of a variety of audience backgrounds</li><li>Thrilled by the idea of reinventing ioby's product and service offerings grounded in lessons learned through serving and co-creating with the communities we served during the many crises of 2020 and 2021.</li><li>Thrives in a fast-paced, dynamic work setting</li></ul><p><strong>Extraordinary candidates may have the following&nbsp;<em>nice-to-have</em>&nbsp;characteristics:</strong></p><ul><li>3 years leading a digital marketing team</li><li>Experience working with software engineers or product managers to accomplish marketing and customer journey goals</li><li>Experience working with UX staff to optimize the customer journey and deepen customer relationships</li><li>A working understanding of tech accessibility and tech equity</li><li>Experience building a comms and marketing team from the ground up in a growing organization</li><li>Experience coaching and mentoring junior staff</li><li>Experience working with and contributing to a Racial, Equity, and Inclusion framework at a company or nonprofit organization</li><li>Experience writing technical requirements and selecting an email automation tool</li></ul><h4><strong>Benefits</strong></h4><h4><strong>Job Location</strong></h4><p>ioby is a distributed team. This position can be based remotely anywhere in the United States. This job may require occasional work hours outside of ioby’s regular business hours (9am–6pm Eastern; Monday through Friday) and some occasional travel.</p><p>About ioby</p><p>ioby is a tech-powered nonprofit, and is designed to be responsive to the communities we serve. As a result, we constantly evolve our program offerings and technology products to serve best, and we strive to move at a fast pace on balance with our resources and working in relationship with our community.</p><p>Our team is distributed across the country so we use a variety of online tools for project management and communication. You’ll be expected to bring new ideas and strategies and bring an attitude of continuous improvement to contribute to a strong and innovative culture. For the right candidate, this is an exciting opportunity to be part of a mission-driven, community-based organization that is contributing to a broad movement of resident-led neighborhood development.</p><p><strong>Hiring Process</strong></p><p>ioby is dedicated to continuously improving our work to become more anti-racist. We have a written commitment to racial equity published here:&nbsp;<a href=\"https://ioby.org/equity\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">https://ioby.org/equity</a>&nbsp;which includes a link to our Hiring Practices:&nbsp;<a href=\"https://ioby.org/hiring-practices\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: inherit;\">https://ioby.org/hiring-practices</a>&nbsp;Please join us on this journey!</p><p>To Apply</p><p>To apply, please fill out the application form through workable and attach including your resume and cover letter describing why you want to work at ioby.</p><p>Deadline to Apply: Friday, May 20, 2022</p><p><strong>ioby's Non-Discrimination Policy:</strong></p><p>ioby is committed to the principles of equal opportunity. ioby’s organizational policies, practices, programs, activities and decisions regarding employment, hiring, assignment, promotion, compensation, volunteerism, internships and other terms and conditions of employment or voluntary service shall not be based on a person’s race, color, sex, age, religion, national origin, mental or physical disability, ancestry, military discharge status, sexual orientation, gender identity or expression, marital status, source of income, parental status, housing status, or other protected status, in accordance with applicable law.</p><p>Women, people of color and LGBTQ people are always strongly encouraged to apply.</p><p>This is a full-time, salaried position and includes a generous benefit package (including full coverage for health, vision, and dental; 27 vacation days; 10 sick days; at least 8 holidays; a 401(k); and an attractive \"Whole Person\" policy).</p><p>ioby sets salary bands in three regions. This position is salary grade 5.</p><p>Region 1 is for locations that are 80%-100% of the cost of living of New York or San Francisco.</p><p>Region 2 is for locations that are 36%-79% of the cost of living of New York or San Francisco; for employees in Region 2 we pay 85% of Region 1.</p><p>Region 3 is for locations that are less than 36% of the cost of living of New York or San Francisco; for employees in Region 3 we pay 75% of Region 1.</p><p>The salary range for this position in Region 1 is $70,000 - $80,500, Region 2 is $59,500 - $70,125, Region 3 is $52,550 - $61,875.</p><p></p>",
    "apply": "https://apply.workable.com/ioby/j/38877F4602/",
    "company": "/companies/ioby",
    "cName": "ioby",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Manager, Sales Development",
    "description": "<p></p><p><strong>Job description</strong></p><p>We’re looking to hire a world-class leader who can help us build and scale the Sales Development program at Qwilr.</p><p>As the leader of our&nbsp;<strong>Global Sales Development</strong>&nbsp;team, you’ll be an integral part of the Revenue Leadership team and will play a key role in helping us develop a world-class sales organization.</p><p>An already established function within the business, you will be reporting to the VP of Sales based in San Francisco, working closely to define the go-to-market strategy, identify team success metrics, and deliver team growth.</p><p><strong>What you'll do</strong></p><ul><li>Manage the day-to-day operations of the Sales Development organization.</li><li>Create repeatable sales processes grounded in rigorous sales measurement and key performance metrics to help exceed revenue targets</li><li>Assist in the development of our outbound sales motion and the optimization of our inbound sales motion</li><li>Identify, interview, hire sales talent and continually \"raise the bar\" with each new hire</li><li>Provide on-boarding, regular coaching, feedback, and professional development for everyone on your team</li><li>Analyze and report on key metrics and forecasts to senior management</li><li>Work cross functionally with Sales Management, Sales Operations, Marketing, Product and Customer Success to build / scale the Sales Development playbook</li></ul><p><strong>Requirements</strong></p><p><strong>About You</strong></p><ul><li>3+ years experience managing, developing, and leading a team of individual contributors in a growth-stage environment (startup experience highly preferred)</li><li>Outbound SDR and/or sales experience preferred</li><li>Comfortable working in fast-paced environments as well as working through unknowns that can often develop with a GTM that iterates and adapts quickly</li><li>Strategic thinker with a knack for persuading and negotiating with internal and external stakeholders</li><li>Lead with a player-coach mentality: hands-on, empower teams to creatively problem-solve, and is motivated to mentor up-and-coming talent</li></ul><p></p>",
    "apply": "https://jobs.qwilr.com/o/manager-sales-development",
    "company": "/companies/qwilr",
    "cName": "Qwilr",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  }
]