[
  {
    "title": "SalesForce Developer",
    "description": "<p></p><p><strong>Position Summary</strong></p><p><span>Are you an experienced, passionate pioneer in technology – a solutions builder, a roll-up-your-sleeves technologist who wants a daily collaborative environment, think-tank feel and share new ideas with your colleagues - without the extensive demands of travel?&nbsp;If so, consider an opportunity with our US Delivery Center – we are breaking the mold of a typical Delivery Center.&nbsp;</span></p><p><span>Our US Delivery Centers have been growing since 2014 with significant, continued growth on the horizon.&nbsp;Interested? Read more about our opportunity below …</span></p><p><strong>The Team</strong></p><p><strong>Customer &amp; Marketing</strong></p><p><span>The Customer &amp; Marketing Offering Portfolio integrates our most differentiated, globally recognized customer and marketing businesses. It focuses on owning the commercial agenda through growth strategy, enhanced user experiences, and engagement through the entire customer lifecycle. From our core strengths in creative design, to strategy, platforms and solutions, as well as our continued growth through acquisitions, we are specifically positioned to bring fully integrated solutions to our clients.</span></p><p><span>We are all consumers and personal marketers. This reality is what makes the Customer &amp; Marketing Offering Portfolio so exciting. What we deliver in the market each and every day directly impacts who we are as customers. We are able to deliver on outcomes for the very products and services that we have the privilege of engaging with ourselves.</span></p><p><strong>Digital Customer</strong></p><p><span>Our Digital Customer team focuses on designing and implementing sales and service experiences, capabilities, and architectures to bring customer strategies to life. Our ambition is to be the best in the world at driving customer transformation through the development of clever commercial strategies, distinctive experiences, and the application of digital technologies. We help make the “creative digital consultancy” real and in doing so, make new markets.</span></p><p><span>Professionals will serve our clients through the following types of work:</span></p><p><span>•&nbsp;Sales Excellence &amp; Service Excellence | delivers sales and service strategies and plans, operating model definition, incentive design and implementation, and operations support for digitally-enabled sales, channel, and customer service capabilities</span></p><p><span>•&nbsp;Digital Experience | creates engaging omni-channel digital experiences across web, mobile, AR/VR, voice, gesture, IoT, and video</span></p><p><span>•&nbsp;Flexible Consumption | the commercial strategy, operating model definition, and capability delivery of subscription/flexible consumption business models</span></p><p><span>•&nbsp;Digital Foundry | a flexible, end-to-end delivery model emphasizing innovation and disruption</span></p><p><strong>Salesforce Developer</strong></p><p><strong>Work you’ll do/Responsibilities</strong><span>&nbsp;</span></p><p>•&nbsp;Build Salesforce solutions on Salesforce Cloud, Service Cloud, Marketing Cloud, Salesforce Communities or Knowledge</p><p>•&nbsp;Develop end to end Salesforce solutions using Configuration and Customization - APEX Class, Triggers, Visualforce pages, Lightning components etc.,</p><p>•&nbsp;Automate business processes using Salesforce automation tools, such as Process Builder, Workflows, Formulas, Flow, Assignment Rules and email Alerts</p><p>•&nbsp;Build integrations between Salesforce and external applications using REST, SOAP APIs, oAuth and Single Sign-On.</p><p>•&nbsp;Migrate changes from development to test to production environment(s) using CI technologies like&nbsp;Salesforce DX, Jenkins and ANT</p><p>•&nbsp;Perform data updates / migration using Data Loader and other similar tools</p><p>•&nbsp;Participate in daily scrum meetings, analyze assign user stories, identify/resolve gaps in functional user stories/business requirements</p><p>•&nbsp;Adhere to defined coding standards and develop well-structured, maintainable and easy to understand code.</p><p>•&nbsp;Perform independent code reviews and write unit/integration test cases to achieve 85% test coverage</p><p>•&nbsp;Ability to effectively debug and resolve issues and/or defects which may be reported as a result of faults in the production system</p><p>•&nbsp;Assist in writing technical approach and design documentation as required</p><p><strong>Qualifications Required</strong></p><p><span>•&nbsp;4-6 years of total IT experience with at least 4+ years of Salesforce project development experience&nbsp;</span></p><p><span>•&nbsp;Strong Salesforce customization and configuration experience (at least 1 or more of the following five Salesforce modules: Sales Cloud, Service Cloud, Marketing Cloud, Salesforce Communities and knowledge)&nbsp;</span></p><p><span>•&nbsp;Hands on development experience using Salesforce configuration and customizations using Apex, Visualforce, Triggers, Scheduled and Batch classes etc.,</span></p><p><span>•&nbsp;Development experience in UI technologies like Bootstrap, Lightning Design System (LDS), Lightning Components Development, AngularJS, jQuery, JavaScript would be a plus</span></p><p><span>•&nbsp;Proven integration experience using integration techniques - REST, SOAP APIs, oAuth and Single Sign-On.</span></p><p><span>•&nbsp;Ability to migrate Salesforce classic features to Lightning experience, including converting Visualforce pages to lightning components and / or using Lightning Design System with Visualforce pages.</span></p><p><span>•&nbsp;Knowledge of Product Development Lifecycle and DevOps Tools like GIT, Jenkins, JIRA etc.</span></p><p><span>•&nbsp;A thorough understanding of Salesforce Deployment Process and tools like ANT, Change Sets and Force.com IDE.</span></p><p><span>•&nbsp;Ability to work collaboratively in a creative, Agile environment and manage agile task assignments</span></p><p><span>•&nbsp;Strong preference for candidates who are Salesforce.com certified in the following areas – Certified Platform Developer I, Certified Platform Developer II.</span></p><p><span>•&nbsp;Experience with ETL tools like MuleSoft or Informatica Cloud would be a plus</span></p><p><span>•&nbsp;Bachelor's degree, preferably in Computer Science, Information Technology, Computer Engineering, or related IT discipline; or equivalent experience</span></p><p><span>•&nbsp;Ability to travel up to 20 percent (While 20% of travel is a requirement of the role, due to COVID-19, non-essential travel has been suspended until further notice.)</span></p><p><span>•&nbsp;Must live a commutable distance to one of the following cities: Atlanta, GA; Austin, TX; Charlotte, NC; Chicago, IL; Cincinnati, OH; Cleveland, OH; Dallas, TX; Detroit, MI; Gilbert, AZ; Houston, TX; Indianapolis, IN; Kansas City, MO; Lake Mary, FL; Mechanicsburg, PA; Miami, FL;&nbsp;Minneapolis, MN; Nashville, TN; Philadelphia, PA; Phoenix, AZ; Pittsburgh, PA; Sacramento, CA; St. Louis, MO; San Diego, CA; Tallahassee, FL; Tampa, FL; or be willing to relocate to one of the following USDC locations: Gilbert, AZ; Lake Mary, FL; Mechanicsburg, PA</span></p><p><span>•&nbsp;Limited immigration sponsorship may be available&nbsp;</span></p><p><span>Additional US Delivery Center Requirements</span></p><p><span>•&nbsp;Should be sharp, proactive, good communicator and able to manage client expectations</span></p><p><strong>Recruiting tips</strong></p><p>From developing a stand out resume to putting your best foot forward in the interview, we want you to feel prepared and confident as you explore opportunities at Deloitte.&nbsp;<a href=\"https://www2.deloitte.com/us/en/pages/careers/topics/recruiting-tips.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 124, 176);\">Check out recruiting tips from Deloitte recruiters</a>.</p><p><strong>Benefits</strong></p><p>At Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits.&nbsp;<a href=\"https://www2.deloitte.com/us/en/pages/careers/articles/life-at-deloitte-benefits-and-rewards-usdc.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 124, 176);\">Learn more about what working at Deloitte can mean for you</a>.</p><p><strong>Our people and culture</strong></p><p>Our diverse, equitable, and inclusive culture empowers our people to be who they are, contribute their unique perspectives, and make a difference individually and collectively. It enables us to leverage different ideas and perspectives, and bring more creativity and innovation to help solve our client most complex challenges. This makes Deloitte one of the most rewarding places to work.&nbsp;<a href=\"https://www2.deloitte.com/us/en/pages/about-deloitte/articles/deloitte-inclusion.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 124, 176);\">Learn more about our inclusive culture</a>.</p><p><strong>Professional development</strong></p><p>From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to build new skills, take on leadership opportunities and connect and grow through mentorship. From on-the-job learning experiences to formal development programs, our professionals have a variety of opportunities to continue to grow throughout their career.</p><p></p>",
    "apply": "https://apply.deloitte.com/careers/InviteToApply",
    "company": "/companies/deloitte",
    "cName": "Deloitte",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Sr Salesforce Developer",
    "description": "<p></p><p><strong>Description</strong></p><p><strong>Senior&nbsp;Salesforce Developer&nbsp;(Remote-US)</strong></p><p><strong>Job Summary:</strong></p><p>WhiteHat Security, a wholly owned subsidiary of NTT Security is seeking a&nbsp;Salesforce Developer&nbsp;to cross functionally&nbsp;assess, design,&nbsp;configure&nbsp;and support&nbsp;our&nbsp;suite of&nbsp;Business Systems,&nbsp;supporting&nbsp;Sales, Marketing, Customer Success, Support, and Engineering functions.</p><p><strong>Position Responsibilities:</strong></p><p>Duties will include&nbsp;designing&nbsp;and implementing&nbsp;key technical components of Salesforce solutions and&nbsp;working&nbsp;collaboratively with&nbsp;other technical&nbsp;and non-technical&nbsp;resources to develop and deliver&nbsp;solutions&nbsp;for evolving business initiatives and challenges.&nbsp;Daily functions may also include ongoing support of WhiteHat’s&nbsp;internal business systems tech stack,&nbsp;ensuring&nbsp;compatibility with evolving business requirements. In this role,&nbsp;you will communicate with&nbsp;executive leadership,&nbsp;managers&nbsp;and&nbsp;end-users to&nbsp;ensure a complete development lifecycle, including&nbsp;building, testing and deployment&nbsp;of projects to multiple stakeholder groups.&nbsp;We operate in a flexible and proactive work environment to facilitate a quick response to changing business objectives and growth.</p><p><strong>The Ideal Candidate</strong>:</p><p>The ideal candidate&nbsp;must&nbsp;be&nbsp;a&nbsp;proactive, critical thinker,&nbsp;possess a&nbsp;strong sense of ownership, and be able to work&nbsp;both&nbsp;independently and&nbsp;collaboratively. He / She&nbsp;is comfortable and successful in a&nbsp;fast-paced, dynamic environment and thrives on&nbsp;identifying and providing&nbsp;solutions to daily challenges&nbsp;as well as large corporate initiatives.&nbsp;Characteristics&nbsp;must&nbsp;include attention to detail, proficient problem solving and the ability to&nbsp;prioritize and&nbsp;multitask. Self-motivation and an inherent sense of urgency is critical.</p><p><strong>Qualifications&nbsp;and Experience:</strong></p><ul><li>5+ years’ experience as a&nbsp;Salesforce Developer,&nbsp;including Apex Classes and Triggers,&nbsp;Visualforce, Lightning components, Test coverage&nbsp;and the Salesforce API.</li><li>Experience with declarative Salesforce components and configuration.</li><li>Bachelor’s Degree in Computer Science,&nbsp;Engineering&nbsp;or comparable experience.</li><li>Salesforce&nbsp;developer&nbsp;certification required.</li><li>Other system APIs a plus.</li><li>Java/Javascript.2</li><li>Experience&nbsp;with&nbsp;Salesforce Lightning experience.</li><li>Knowledge of Salesforce Appexchange solutions.</li><li>Deep understanding of Salesforce Data modelling, management, security and SOQL.</li><li>Experience with Workbench,&nbsp;Developer Console,&nbsp;Salesforce Dataloader, Github, etc.</li><li>Working knowledge of&nbsp;Microsoft office suite, Web Services&nbsp;and testing tools.</li><li>Understanding of&nbsp;the full SDLC (Software Development Life Cycle).</li><li>Business function&nbsp;skills,&nbsp;i.e. capable of interpreting business requirements, etc.</li><li>Experience&nbsp;developing and documenting&nbsp;system design specifications.</li><li>Strong&nbsp;soft skillset:&nbsp;analytical, troubleshooting, communication, effective listening and collaboration.</li><li>Ability to understand and follow Salesforce&nbsp;implementation&nbsp;and&nbsp;release&nbsp;best practices.</li><li>Experience with Salesforce Sandboxes and change set migrations.</li><li>Comfortable&nbsp;practicing&nbsp;Agile Methodology.</li><li>Experience with data and system migrations&nbsp;a plus.</li><li>Experience using Atlassian JIRA a plus.</li><li>Full Stack development experience a plus.</li><li>Additional&nbsp;Salesforce&nbsp;certifications a plus,&nbsp;i.e.&nbsp;Administration,&nbsp;Service&nbsp;Cloud, Community,&nbsp;Data Architecture,&nbsp;etc.</li></ul><p><strong>At this time we will unfortunately not be able to sponsor visas for this role.</strong></p><p><em>NTT Application Security is an E-Verify employer and is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.</em></p><p></p>",
    "apply": "https://jobs.jobvite.com/careers/whitehat-security/job/ooBbjfwd",
    "company": "/companies/whitehat-security",
    "cName": "WhiteHat Security",
    "location": "USA",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Software Java Developer",
    "description": "<p></p><p>As the global leader in electronic testing, Pearson VUE (www.pearsonvue.com) validates the skills and knowledge of millions of individuals every year. Our customers’ high-stakes certification, licensure, admissions and other credentialing exams help people advance in technology, government and professional careers, as well as attain educational growth. Pearson VUE offers proctored exams through the world's largest network of test centers in addition to testing in online and un-proctored environments.</p><p>Pearson VUE is a business of Pearson, the world's leading learning company with global-reach and market-leading businesses. Pearson is listed on both the London and New York stock exchanges (UK: PSON; NYSE: PSO). For more information, visit www.pearson.com.</p><p>We are the world's learning company with more than 24,000 employees operating in 70 countries. We combine world-class educational content and assessment, powered by services and technology, to enable more effective teaching and personalized learning at scale. We believe that wherever learning flourishes so do people.</p><p><strong>Summary</strong></p><p>As a Software Java Developer, you will be responsible for analysis, design, implementation, and automated testing in a high-performing, experienced team. You will use industry best practices while producing high-quality full stack solutions in an agile, results driven environment across a diverse set of areas including: finance, infrastructure, test center utilization, e-commerce, registration and scheduling. You will also be responsible for maintaining and supporting mission-critical applications as necessary. In this role you will be expected to continually grow, mentor software developers, and challenge all of us to raise the bar even higher with your contributions to people, process and technology. This is a highly collaborative team that knows the importance of fun, self-care and flexibility while working on a variety of complex and challenging projects with a passion for excellence, innovation and pride in producing excellent user experiences.</p><p><strong>The Software Developer will</strong>&nbsp;:</p><ul><li>Implement &amp; Perform. Implement designs following Pearson coding standards and industry best practices; maintain and support mission-critical applications as necessary.</li><li>Analyze &amp; Design. Ensure business and requirements artifacts are created that effectively model the customer's requirements. Use tooling and best practices to create design models from requirements.</li><li>Review. Participate in and lead requirement, design and code reviews.</li><li>Test &amp; Deployment. Work closely with other teams and stakeholders (e.g., QE, CM, end users) to release high quality software. Create testable requirements and write/execute unit tests.</li><li>Quality/process improvement. Participate in group improvement activities and initiatives to improve process and product quality in pursuit of excellence.</li><li>Reporting. Complete project documentation as required, including logging status, risk, progress, and effort on assigned work.</li><li>People development. Mentor and train new team members.</li></ul><p><strong>Qualifications</strong></p><p><strong>Required Education &amp; Experience:</strong></p><ul><li>Bachelor's degree in Computer Science, MIS, or equivalent technology discipline</li><li>6+ years minimum professional Java development required</li><li>3+ years programmatic interaction with relational database systems</li><li>Current technology stack: Java, JPA, Hibernate, Web Services (REST/SOAP), Angular</li><li>Experience in OOAD, agile processes, design patterns, SQL and UML</li></ul><p><strong>Desired Knowledge, Skills &amp; Abilities:</strong></p><ul><li>Experience working in agile environment highly preferred</li><li>Experience in understanding software architecture</li><li>Experience in creating design documents, performing code reviews and test driven development</li><li>Desire to expand knowledge in many development languages, applications, and tools</li><li>Proven ability to quickly learn new processes and tools, business domains and technical applications</li><li>Ability to think technically and analytically</li><li>Ability to understand philosophy of architecture</li><li>Must assimilate information, distill knowledge, apply experience and provide solution alternatives and recommendations</li><li>Must have strong time management skills - including ability to work well under pressure, plan, set priorities, adapt to change, and meet established timelines</li><li>Must develop effective relationships with internal and external contacts and work well within a team</li><li>Must be a self-starter and detail-oriented</li><li>Must have a “positive” and energetic demeanor</li><li>Effective written and verbal communication skills</li><li>Creative problem-solving skills</li></ul><p><strong>Experience with some or all of the following tools (Required):</strong></p><ul><li>Java SE AND EE (6 years) Pearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. All employment is decided based on qualifications, merit, and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status, or any other group protected by law.</li></ul><p>The anticipated starting salary range for Colorado-based individuals expressing interest in this position is $95,000 - $125,000. This position is bonus eligible. Benefits available to eligible employees can be seen at:&nbsp;<a href=\"https://pearsonbenefitsus.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 122, 156);\">https://pearsonbenefitsus.com/</a>&nbsp;#LI-POST</p><p>Learning is the most powerful force for change in the world. More than 20,000 Pearson employees deliver our products and services in nearly 200 countries, all working towards a common purpose – to help everyone achieve their potential through learning. We do that by providing high quality, digital content and learning experiences, as well as assessments and qualifications that help people build their skills and grow with the world around them. We are the world’s leading learning company. Learn more at pearsonplc.com.</p><p>Pearson believes that wherever learning flourishes, so do people. We are committed to being an anti-racist company in everything we do. We value the power of an inclusive culture and a strong sense of belonging. We promote a culture where differences are embraced, opportunities are accessible, consideration and respect are the norm, and all individuals are supported in reaching their full potential. Through our talent, we believe that diversity, equity, and inclusion make us a more innovative and vibrant place to work. People are at the center, and we are committed to a sustainable environment and workplace where talent can learn, grow, and thrive.</p><p>To learn more about Pearson’s commitment to a diverse and inclusive workforce, please click here: &nbsp;<a href=\"http://www.pearson.com/careers/diversity-and-inclusion.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 122, 156);\">http://www.pearson.com/careers/diversity-and-inclusion.html</a>&nbsp;</p><p><span>Pearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. All employment is decided based on qualifications, merit, and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status, or any other group protected by law.</span><strong>Job:</strong>&nbsp;TECHNOLOGY</p><p><strong>Organization:</strong>&nbsp;Assessment &amp; Qualifications</p><p><strong>Schedule:</strong>&nbsp;FULL_TIME</p><p><strong>Req ID:</strong>&nbsp;4278</p><p></p>",
    "apply": "https://pearson.jobs/bloomington-mn/software-java-developer-remote/20478FE989C64CD1A7428A1B26D9B134/job/",
    "company": "/companies/pearson",
    "cName": "Pearson",
    "location": "+/- 3 hours of PT",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Java Script Developer",
    "description": "<p></p><p><strong>JOB DESCRIPTION</strong></p><p>Primary Skills:&nbsp;Java Script, Rest API, JSON, D3.JS, Express.JS</p><p>Duration:&nbsp;3 to 6 months CTH&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>Contract Type:&nbsp;W2 / C2C</p><p><strong>To follow up with any questions, please&nbsp;contact Aman&nbsp;at 408-907-3219</strong></p><p><strong>“Looking for a new job that will give YOU a sense of accomplishment\"&nbsp;</strong></p><p><strong>Job Responbsibilities:</strong></p><ul><li>Java Script. Solid understanding of Java Script basics. The person should be good in maintaining java script applications and is good in debugging also&nbsp;</li><li>Must have understanding of Rest API and help design them in future</li><li>Must know how to get JSON data from multiple API &amp; create APIs as well and transform the data in to multiple transformation to create visualizations.</li><li>Basic SQL experience is required (group bi / select&nbsp;/ joins</li></ul><p><strong>Job Requirements:</strong></p><ul><li>3 to 4 years Java Script development experience&nbsp;/ Or BS/MS with 2 years of experience</li><li>Visualization exp</li><li>Highcharts with D3.JS experience (very much preferred)</li><li>On the API side if someone have used Express.JS</li><li>Humble, willing to work with all kind of personalities</li></ul><p><strong>ABOUT AKRAYA</strong>&nbsp;</p><p>ABOUT&nbsp;<strong>AKRAYA&nbsp;</strong>Akraya is an award-winning IT staffing firm and the staffing partner of choice for many leading companies across the US. Akraya was recently voted as a 2021 Best Staffing Firm to Temp for by Staffing Industry Analysts and voted by our employees and consultants as a 2022 Glassdoor Best Places to Work.&nbsp;</p><p><strong>NOTE:&nbsp;</strong>Our recruiters will&nbsp;contact you on WhatsApp&nbsp;regarding your job application.&nbsp;Should you choose not to receive additional messages, you can opt-out using the&nbsp;WhatsApp&nbsp;opt-out feature.</p><p></p>",
    "apply": "https://jobs.akraya.com/index.smpl",
    "company": "/companies/akraya",
    "cName": "Akraya",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": ".Net Developer",
    "description": "<p></p><p><span>We are seeking a Senior Full Stack (.Net) Developer with demonstrated experience designing and implementing enterprise scale web solutions. The ideal candidate will bring both strategic vision and solid execution skills to create responsive web applications for mobile and the desktop.</span></p><p><strong>Responsibilities:</strong></p><ul><li><span>Design and develop scalable web applications&nbsp;and APIs</span></li><li><span>Experience in .NET (.NET Framework,&nbsp;NET</span>, C#)</li><li><span>Develop responsive web application UIs using HTML5, CSS, and JavaScript, Angular</span></li><li><span>Work with UX Designers, Mobile Architects other Developers to implement full stack web and mobile solutions</span></li><li><span>Work as part of an agile team on leading edge technologies</span></li></ul><p><strong>Skills and Experience:</strong></p><ul><li><span>5+ years of experience developing applications software</span></li><li><span>Experience deploying APIs to AWS via ECR (Docker) and Fargate</span></li><li><span>Experience developing .Net Core APIs&nbsp;</span></li><li><span>Experience with AWS (AWS GovCloud a plus)</span></li><li><span>Demonstrated expertise with HTML5, CSS3 and Responsive Web Design</span></li><li><span>Highly skilled JavaScript developer using Angular or similar frameworks</span></li><li><span>Demonstrated knowledge of jQuery and/or jQuery Mobile</span></li><li><span>Experience using .NET to build scalable web services a plus</span></li><li><span>Experience with Oracle, MySQL, or PostgreSQL and use of Hibernate, ORMs and/or jdbc</span></li><li><span>Experience with NoSQL databases such as MongoDB or DynamoDB a plus</span></li><li><span>Understanding of document description languages such as&nbsp;JSON, XML and YAML</span></li><li><span>Clear understanding of software development best practices</span></li><li><span>Demonstrated experience working with teams using agile methodologies</span></li><li><span>Working knowledge of SCM with strong emphasis on Git and proper Git Flow</span></li><li><span>Understand functional as well as non-functional requirements</span></li><li><span>Develop end to end application components including business services, data access, external integration</span></li><li><span>Prepare unit test cases</span></li><li><span>Troubleshoot issues and fix defects</span></li><li><span>Needs to have extensive experience developing applications using AWS, .NET</span></li></ul><p><strong>About Mobiquity</strong></p><p><span>Mobiquity is a digital consultancy that partners with the world's leading brands to design and deliver compelling digital products and services for their customers. Our approach balances human needs with usefully applied technology, unbound creativity with research and analytics, and agile development with strict engineering and security standards. Mobiquity’s end-to-end services consider every dimension of a digital business from marketing to IT, providing strategy, experience design, product engineering, cloud services, and analytics. Mobiquity is an AWS Partner Network (APN) Premier Consulting Partner and has worked with AWS since 2011 to deliver 100% cloud-based innovation to its clients. To learn more, visit&nbsp;</span><a href=\"https://mobiquity.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: black;\">https://mobiquity.com</a><span>.&nbsp;&nbsp;</span></p><p><strong>Mobiquity is a Proud Equal Opportunity Employer</strong></p><p><span>Mobiquity is committed to the principle of equal employment opportunity (EEO) for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Mobiquity are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental, or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Mobiquity will not tolerate discrimination or harassment based on any of these characteristics. If you need assistance or an accommodation due to a disability, you may contact us.</span></p><p></p>",
    "apply": "https://jobs.jobvite.com/careers/mobiquity/job/oIsjjfww",
    "company": "/companies/mobiquity-inc",
    "cName": "Mobiquity Inc.",
    "location": "USA",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "UX/UI Designer",
    "description": "<p></p><p><strong>Description</strong></p><p><strong>Company Description&nbsp;</strong></p><p><span>JumpCrew is a customer acquisition platform that integrates sales and digital marketing to help clients grow brand awareness, leads, and revenue. JumpCrew is the perfect place for self-driven, dynamic people who want to learn and help businesses grow. If you take an entrepreneurial approach to problem-solving, work well in a high-growth, fast-paced environment, and are brave enough to not wear a seat belt in a rocket ship so you can lean closer to the stars; then JumpCrew could be the place for you!</span></p><p><strong>Job Description&nbsp;</strong></p><p><span>JumpCrew</span><span>&nbsp;is hiring an experienced UX/UI Designer to help create a new omnichannel marketing solution. AdPost.io empowers thousands of users to reach new customers for their businesses. This role will focus on a platform for businesses to manage and track their campaigns and a consumer-facing site for engaging their customers.&nbsp;</span></p><p><strong>UX/UI Designer Job Responsibilities</strong></p><ul><li><span>Create wireframes, prototypes, and final designs for multiple aspects of the AdPost.io platform</span></li><li><span>Assess, test, and optimize the performance of new and existing features</span></li><li><span>Create design guideline documentation</span></li><li><span>Actively participate in user research and usability testing</span></li><li><span>Work alongside engineers and product managers throughout all stages of the production cycle</span></li></ul><p><strong>Requirements</strong></p><ul><li><span>3+ years of professional UX/UI design experience for an agency or Saas platform</span></li><li><span>Experience designing and shipping responsive mobile-first products&nbsp;</span></li><li><span>Experience designing data visualizations</span></li><li><span>Understanding of modern design principles</span></li><li><span>Experience in a highly Agile/scrum environment is a plus</span></li><li><span>Experience working with Material UI a plus</span></li><li><span>Experience working in Figma or Adobe XD required</span></li></ul><p><strong>Additional Information&nbsp;</strong></p><ul><li><span>Location: Remote (Greater Nashville area preferred but not required)</span></li><li><span>Salary: $60,000 - $80,000</span></li><li><span>Unlimited PTO</span></li><li><span>9 company holidays&nbsp;</span></li><li><span>Healthcare benefits&nbsp;</span></li><li><span>401k&nbsp;</span></li><li><span>Learning and career growth opportunities&nbsp;</span></li><li><span>Leadership Summits</span></li><li><span>Regular company outings - lunch and happy hours!</span></li></ul><p><strong><span class=\"ql-cursor\">﻿</span>About Us&nbsp;</strong></p><p><span>JumpCrew integrates marketing with sales to accelerate our client’s business growth. We also leverage this expertise to acquire and digitally transforming publishers. JumpCrew’s solutions combine technology with a human touch. We work with a growing roster of clients in publishing, healthcare, media, and technology to help them build awareness, increase leads, and convert sales.</span></p><p><span>The company is headquartered in Nashville, TN. JumpCrew has been recognized as the 2021 Winner for Nashville’s Best and Brightest Companies to Work For, the #1 best small company to work for in Nashville (2017), one of the best places to work in Nashville (2018 &amp; 2019) according to the Tennessean and is one of Crunchbase’s 50 hot startups. For more information, visit&nbsp;</span><a href=\"https://jumpcrew.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(34, 37, 41);\">https://jumpcrew.com/</a><span>.</span></p><p><span>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</span></p><p></p>",
    "apply": "https://jobs.jobvite.com/careers/jumpcrew/job/odQjjfwp",
    "company": "/companies/jumpcrew",
    "cName": "JumpCrew",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Lead Product Designer",
    "description": "<p></p><p>Medium’s mission is to help people deepen their understanding of the world and discover ideas that matter. We are building a place where ideas are judged on the value they provide to readers, not the fleeting attention they can attract for advertisers. We are creating the best place for reading and writing on the internet—a place where today’s smartest writers, thinkers, experts, and storytellers can share big, interesting ideas.</p><p>We are looking for a Lead Product Designer with exceptional design vision and craftsmanship, who can execute in a fluid environment. You are just as excited to zoom out to reimagine a product as you are zooming in to the details of a flow. You will partner closely with cross-functional peers to translate high-level strategy into beautiful, compelling user experiences. You will model a thoughtful, collaborative design practice for the team.</p><p><strong>What you'll do</strong></p><ul><li class=\"ql-indent-1\">Lead design projects across the entire product lifecycle.</li><li class=\"ql-indent-1\">Rapidly design and prototype multiple concepts from near-term solutions to long-term aspirations, and build consensus towards a path forward.</li><li class=\"ql-indent-1\">Partner closely with Engineering and Product to ship elegant and practical solutions.</li><li class=\"ql-indent-1\">Evaluate the success of existing features and propose new ones that expand the capabilities of the product.</li><li class=\"ql-indent-1\">Evolve best practices for the design team and embody them day-to-day.</li></ul><p><strong>Who you are</strong></p><ul><li class=\"ql-indent-1\">You demonstrate a capacity and enthusiasm for the spectrum of design — from product ideation and systems thinking to kerning and grids.</li><li class=\"ql-indent-1\">You are comfortable with ambiguity, bringing clarity and structure to complex UX challenges and balancing long-term vision with iterative solutions.</li><li class=\"ql-indent-1\">You engage teammates with curiosity and openness, whether you’re collaborating with engineers or executives.</li><li class=\"ql-indent-1\">You present your vision and design rationale in a compelling manner to the wider team.</li><li class=\"ql-indent-1\">You love prototyping ideas to bring them to life, whether it’s through Framer, Principle, Flinto, or code.</li><li class=\"ql-indent-1\">You write clearly and succinctly to communicate your ideas.</li></ul><p>At Medium, we foster an inclusive, supportive, fun, and challenging team environment. We understand the value of diverse backgrounds and respect the healthy expression of diverse opinions. We embrace experimentation and the examination of all kinds of ideas through reasoning and testing. Come join us as we continue to change the world of digital media. Medium is an equal opportunity employer.</p><p>Interested? We'd love to hear from you.</p><p></p>",
    "apply": "https://jobs.lever.co/medium/23f58152-1539-48ff-ad47-bee92d9b25fa",
    "company": "/companies/medium",
    "cName": "Medium",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Staff Product Designer, Supply",
    "description": "<p></p><p>Lime is the world's largest shared electric vehicle company. We are on a mission to build a future of transportation that is shared, affordable and carbon-free. Named a Time 100 Most Influential Company in 2021, Lime has powered more than 250 million electric bike and scooter rides in more than 200 cities across five continents, saving an estimated 60+ million car trips. Learn more at&nbsp;<a href=\"http://li.me/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">li.me</a>!&nbsp;</p><p>We are seeking an experienced Staff Product Designer to lead design initiatives for our operator-facing products and establish user centered processes that improve our workforce efficiency. Your work will be used all over the world in the 150+ markets we operate in.</p><p>In addition to solid interaction and visual design skills, candidates should have experience thinking in terms of end-to-end user journey, applying strategic thinking and business goals to designs, and focusing on user feedback. We also look for candidates who know how to work as a team since you’ll be working with product managers, product designers, and engineers.</p><p><strong>What You'll Do</strong></p><ul><li class=\"ql-indent-1\">Lead the product definition process together with Product Management, Engineering, and Business teams.</li><li class=\"ql-indent-1\">Develop user experience design concepts, wireframes, mockups, prototypes, specifications.</li><li class=\"ql-indent-1\">Understand the competitive market, and leverage your knowledge to suggest new features and flows.</li><li class=\"ql-indent-1\">Ensure that final design proposals meet the objectives of the user experience and fit with the overall brand.</li><li class=\"ql-indent-1\">Partner with product managers and engineers to own the user experience of new features from conception until launch.</li><li class=\"ql-indent-1\">Collaborate with Lime’s hardware team to ensure the overall experience, spanning from software to hardware to service, are cohesive and support the rider’s journey.</li><li class=\"ql-indent-1\">Drive the team to build experiences that delight users spanning software, hardware and the real world.</li></ul><p><strong>About You</strong></p><ul><li class=\"ql-indent-1\">8+ years of experience in crafting, building and shipping quality consumer-facing products across a diverse group of platforms and form factors.</li><li class=\"ql-indent-1\">An ability to own and drive the strategy and execution of entire end-to-end product solutions.</li><li class=\"ql-indent-1\">A process that grounds work in user research and considers the context of the user’s experience.</li><li class=\"ql-indent-1\">You are meticulous and detail-oriented with an ability to execute at a high level of aesthetic craft.</li><li class=\"ql-indent-1\">Experience working in a very dynamic environment.</li><li class=\"ql-indent-1\">Familiar with Figma and iterating quickly as the ideas evolve.</li><li class=\"ql-indent-1\">Experience participating in both foundational and evaluative research.</li></ul><p><strong>What We Offer</strong></p><ul><li class=\"ql-indent-1\">Opportunity to revolutionize transportation in cities around the world with the leader in urban mobility solutions</li><li class=\"ql-indent-1\">Scale with a rapidly growing organization, with significant opportunity for growth</li><li class=\"ql-indent-1\">Play a role in the transformation of urban mobility and sustainability</li><li class=\"ql-indent-1\">Work with a team of successful, fun and motivated people</li><li class=\"ql-indent-1\">Competitive salary and benefits</li></ul><p>In accordance with Colorado State Law, if the candidate selected for this job resides in Colorado, the anticipated minimum salary will be $129,000.00, plus bonus and equity (when eligible) as well as benefits. Exact salary will ultimately depend on the candidate’s qualifications. In addition to base salary, this role will be eligible for a variable bonus based on a combination of management discretion and employee performance.</p><p>Lime is an Equal Opportunity Employer, but that’s only the start. We strive to build a workforce composed of individuals with different backgrounds, abilities, identities, and mindsets—not just to do great work, but to become a better company and grow as individuals.</p><p></p>",
    "apply": "https://jobs.lever.co/lime/4dffc448-4b82-4149-8bdc-3d42d4074501",
    "company": "/companies/lime",
    "cName": "Lime",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Brand UI/UX Designer",
    "description": "<p></p><p><strong>Job Description:</strong></p><p><strong>Brand UI/UX Designer</strong></p><p><strong>Location: Remote Available, for U.S. locations only</strong></p><p>We are currently hiring a passionate, user-centered designer to join our incredible in-house team to create brand-appropriate designs in a fast-paced environment. Projects will include engaging and impactful designs for our website, marketing materials, and media applications. You'll touch various parts of the entire user's journey as they interact with our website and our overall company brand.</p><p><strong>Main Responsibilities:</strong></p><p><strong>UI/UX</strong></p><ul><li>Creating user-centered designs by understanding business requirements and user feedback.</li><li>Understand and create information architecture for site structure and site maps.</li><li>Creating user flows, wireframes, prototypes, and mockups.</li><li>Translate requirements into visual style guides, design systems, and design patterns.</li><li>Create effective and professional web pages.</li><li>Design UI elements such as input controls, navigational, and informational components.</li><li>Create original graphic designs (e.g. images, sketches, and tables).</li><li>Identify and troubleshoot UX problems (e.g. responsiveness).</li><li>Collaborate effectively with writers, developers, and management teams.</li><li>Incorporate customer feedback, usage metrics, and usability findings into design to enhance user experience.</li></ul><p><strong>Brand/Graphic Design</strong></p><ul><li>Review design briefs to understand requirements.</li><li>Conceptualize and develop design concepts, graphics, and layouts.</li><li>Design and produce collateral in accordance with brand guidelines.</li><li>Create and produce marketing materials such as ebooks, event graphics, brochures, etc.</li><li>Create promotional deliverables such as social and digital ads.</li><li>Present ideas, concepts, and design solutions to various stakeholders, and incorporate their feedback into the final design.</li></ul><p><strong>Key Requirements:</strong></p><ul><li>You have a degree/diploma in Design, Fine Arts, or a related field.</li><li>You have prior experience as a UI/UX Designer as well as a strong portfolio of related projects.</li><li>You are proficient in Adobe Creative Suite (specifically Illustrator, InDesign, and Photoshop).</li><li>You are proficient in web tools such as Sketch, Figma, XD, etc.</li><li>You have experience in creating original designs through prototyping.</li><li>Basic HTML5, CSS3, and JavaScript skills are a plus.</li><li>Motion or animation skill are a plus.</li><li>You pay strong attention to detail and have a keen eye for aesthetics.</li><li>You have strong analytical skills, and can synthesize solutions based on requirements from multiple stakeholders.</li><li>You have excellent communication skills and can clearly articulate your ideas, designs, and suggestions.</li><li>You are a strong team player who can collaborate effectively with different stakeholders.</li></ul><p>#LI-GC2</p><p>#LI-Remote</p><p>#DiceGC&nbsp;</p><p><strong>Job:</strong></p><p><span>Marketing</span></p><p><strong>Micro Focus is proud to be an&nbsp;Equal Opportunity Employer.&nbsp;Prospective employees will receive consideration without discrimination because of race, colour, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, genetic information, citizenship or any other legally protected status</strong></p><p></p>",
    "apply": "https://jobs.microfocus.com/global/en/job/7024796/Brand-UI-UX-Designer",
    "company": "/companies/micro-focus",
    "cName": "Micro Focus",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Product Designer, Home Owner Accounts",
    "description": "<p></p><p><strong>Why Vacasa</strong></p><p>We started with just one home and an idea: to bring homeowners and renters together with smart technology and caring local teams. Today, we’re the largest full-service vacation rental company in North America thanks to the people who give us their best every day. You’ll fit right in here if you’re curious, entrepreneurial, and thrive in a rapid-growth environment.</p><p><strong>Product Design at Vacasa</strong></p><p>We are a diverse team of strategic, empathetic thinkers and interaction specialists who envision and craft experiences from research to implementation. Our customers are the center of our process at Vacasa. Product Designers lead UX/UI and help to define our digital experiences at Vacasa and help drive business strategy forward. Product Design at Vacasa is your opportunity to be part of a team that positively impacts our customers. By creating products and services that people love, we are changing the vacation rental industry one experience at a time.</p><p>As a growing product design org, we’re looking for a passionate Senior Product Designer to solve complex problems in our homeowner account space. You’ll build and maintain beautiful, delightful and functional solutions to help Vacasa’s Homeowners manage their accounts.&nbsp;As the Senior Product Designer, Homeowner Accounts, you’ll obsess over the homeowner experience, conducting user research, leading brainstorm sessions and collaborating closely with key product and engineering leads to execute user and business success.</p><p><strong>What we’re looking for</strong></p><ul><li>At least 3+ years working experience as an IC designer on multiple products preferably leading and building out product designs</li><li>An online portfolio of work demonstrating breadth and depth in UX and visual design that includes approach and processes.&nbsp;</li><li>Experience in a corporate setting as a UX designer, interaction designer, information architect, or similar&nbsp;</li><li>Experience creating services and applications with multiple user touch points on various platforms&nbsp;</li><li>Proficiency with design and prototyping tools such as Figma or similar UX design tools</li><li>Nice to have: excellent communication, interpersonal and analytical skills including the ability to present design concepts clearly and persuasively to colleagues, partners, stakeholders and eventually senior executive</li><li><strong>Ability to work from home and resides in one of the followings states: AK, AL, AZ, CA, DE, FL, GA, HI, ID, IL, LA, MA, MD, ME, MI, MT, NC, NH, NM, NV, NY, OR, PA, SC, TN, TX, UT, VA, VT, WA, WI, or WY</strong></li></ul><p><strong>How We Interview&nbsp;</strong></p><p>Bring your portfolio, case studies, and/or a walk-through of live/shipped work. We know you’re busy so there will be no homework or design tests. Our goal is to hire great applicants quickly by committing to a humane hiring process.</p><p><strong>What you’ll do</strong></p><ul><li>Communicate your ideas through journey maps, user flows, storyboards, wireframes, prototypes, mockups , pattern systems and design specs</li><li>Use business vision and direction to assist in developing use cases and high-level requirements</li><li>Lead the design of useful, accessible and delightful products and work with leadership in UX vision design planning and goal creation</li><li>Design the UX framework, interface, and interaction flow of services and experiences</li><li>Facilitate the design process, present and iterate design solutions&nbsp;</li><li>Continually iterate and evolve the way we design for and learn from our users</li></ul><p><strong>Compensation:</strong></p><ul><li>100,000-145,000 DOE</li></ul><p><strong>What you’ll get</strong></p><ul><li>Health/dental/vision insurance—employee &amp; family coverage options</li><li>Employer Sponsored &amp; Voluntary Supplemental Benefits</li><li>401K retirement savings plan with immediate 100% company match on the first 6% you contribute&nbsp;</li><li>Health &amp; Dependent Care Flexible Spending Accounts</li><li>Flexible vacation time</li><li>Paid sick days and holidays&nbsp;</li><li>Paid parental leave after one year of tenure&nbsp;</li><li>Employee Assistance Program</li><li>Career advancement opportunities</li><li>Employee discounts&nbsp;</li><li>All the equipment you’ll need to be successful</li><li>Great colleagues and culture</li><li>Please visit our&nbsp;<a href=\"https://www.vacasa.com/go/benefits-summary\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 120, 171);\">careers page</a>&nbsp;to review our full benefits offerings</li></ul><p><em>Vacasa is an equal opportunity employer committed to fostering a diverse and inclusive workplace. We do not discriminate against applicants based upon race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, age, disability, genetic information, or other classes protected by applicable law. Veterans are encouraged.&nbsp;</em></p><p><em>Vacasa is committed to maintaining a safe and productive work environment. Possession, use, or being under the influence of alcohol or illegal drugs in the workplace is prohibited.</em></p><p></p>",
    "apply": "https://www.vacasa.com/careers/positions/",
    "company": "/companies/vacasa",
    "cName": "Vacasa",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Content Editor",
    "description": "<p></p><p>Join one of Pennsylvania’s fastest growing companies today! WebstaurantStore, a division of Clark Associates, is looking for entry-level candidates who possess strong writing and research skills to join our growing company as Content Editor. This role focuses on developing and editing engaging written and visual content for our website and is a key part of growing our business and serving the purchasing needs of foodservice professionals worldwide.</p><p><strong>As a Content Editor, you will:</strong></p><ul><li>Write and edit in-depth product descriptions with the perfect blend of creative and technical writing skills</li><li>Enter shipping information and relevant product data into our database</li><li>Research and compile informative product buying guides to influence purchasing decisions</li><li>Regularly correspond with external vendors and internal departments to complete projects</li><li>Edit product descriptions, buying guides, and supportive text throughout our e-commerce website</li><li>Maintain quality control by reviewing content updates, marketing materials, and other site text and employee work</li><li>Manage an ongoing task list of buying guides, special projects, and several hundred product descriptions per week</li><li>Participate in team meetings and product trainings</li><li>Communicate with the Procurement, Site Maintenance, Photo, Video, Design, and SEO departments to complete projects on deadline</li><li>Attend conferences related to the food industry and develop a knowledge of the food service industry</li></ul><p><strong>We are looking for driven, motivated candidates who:</strong></p><ul><li>Have solid written and verbal communication skills</li><li>Are self-motivated to complete work assignments</li><li>Possess strong attention to detail</li><li>Are able to multi-task</li><li>Are receptive to feedback on their work</li><li>Take initiative to solve problems independently</li><li>Are willing to learn new tasks and new software</li><li>Can adopt our writing style</li><li>Have superior research skills</li><li>Are open to evolving with the role</li><li>Are willing to suggest improvements related to site features and ongoing projects</li><li>Are familiar with the Microsoft Office Suite, including Excel</li></ul><p>We offer competitive compensation and a comprehensive benefits package including paid time off, medical/dental insurance, wellness programs, gym membership reimbursement, and a 401k with company match. Employees also enjoy regular food service industry training from top manufacturers and product experts.</p><p>Our Pennsylvania headquarters feature an on-site fitness center, regular training sessions, game room, and the chance to cook and eat delicious meals in our test kitchen, outfitted with some of our newest and best professional restaurant equipment.</p><p>This position is also available as a remote position. If you're searching for a full-time, permanent work-at-home career, we’ve got an opportunity for you to join our fast-growing team! Currently, we are employing legal residents of the following states: (AL, AZ, AR, DE, FL, GA, KS, KY, MD, MI, MS, NV, NC, OH, OK, PA, SC, TN, TX, VA, WV, WI or WY). H-1B Visa Sponsorship Not Available, W2 only.</p><p>As a WebstaurantStore remote employee, you'll enjoy the same training and support to be successful in your position as employees at our physical corporate locations. We stay connected through video meetings, training sessions, and collaborative forums, and provide opportunities for you to connect with other employees from across the country both professionally and personally.</p><p><strong>To qualify, candidates must have:</strong></p><ul><li>Access to a reliable and secure high-speed internet connection. Cable or fiber internet connections (at least 25mbps download/10mbps upload) are preferred, as satellite connections often cannot support the technologies used by WebstaurantStore to perform day-to-day tasks.</li><li>Access to a home router and modem.</li><li>A dedicated home office space that is noise and distraction-free. The space should have strong wireless connection or a wired Ethernet connection (wired connection is preferred, if possible).</li><li>A valid, physical address (apartment, suite, etc.); PO Boxes are not supported; as a physical address is required for you to receive your computer equipment.</li><li>The desire and ability to work and communicate with other team members via chat, webcam, etc.</li></ul><p><strong>Work from home benefits include:</strong></p><p>• The essential computer equipment, such as hardware and software, needed to perform your job.</p><p>If you are ready for a challenge, and have the ambition to succeed in a fast paced, growing industry, we’d love to discuss the Content Editor position with you! Submit your resume and apply online today.</p><p></p>",
    "apply": "https://www.clarkassociatesinc.biz/careerdetail",
    "company": "/companies/webstaurantstore",
    "cName": "WebstaurantStore",
    "location": "USA",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Mktg Content Specialist",
    "description": "<p></p><p>As a content marketer you are responsible for providing well researched content for use in white papers, case studies, blogs, thought-leadership articles, product sheets, and multifaceted campaigns for the Civic and ERP product lines. You understand how to position and promote content within the public sector market to reach the widest audience and convert prospects to subscribers. Materials can be technical in nature and require strong feature/benefit language. This role also supports other marketing program initiatives, both traditional and digital.</p><p><strong>Responsibilities&nbsp;</strong></p><ul><li>Generate compelling copy for print, web, video, and social by obtaining product or service information by interviewing, or requesting such information, from necessary parties, including internal and external subject matter experts and clients.</li><li>Write white papers, product fact sheets, brochures, case studies, newsletter articles, advertising, social media, blogs, and other material as requested by the Vertical Marketing Director.</li><li>Maintain and manage project schedules, approvals, and other project-related needs utilizing the Marketing Department’s online project management software.</li><li>Proofread and edit a variety of copy and ensure brand voice is maintained.</li><li>Plan and launch new social campaigns, analyze results, and implement best practices.</li><li>Ability to adapt tone/message to speak to the target audience.</li><li>Utilize a metric driven approach to determine which programs are most effective and leverage these learnings to adjust future marketing activity.</li><li>Work with marketing team members to incorporate content into campaigns.</li><li>Conduct research for content topics based on industry trends and best practices.</li></ul><p><strong>The Marketing Content Specialist must be able to:</strong></p><ul><li>Be responsive to the marketing needs of the vertical and the sales organization and create new materials as determined or requested.</li><li>Understand key corporate, business, and product objectives and convey messages that support them in all sales and marketing collateral.</li><li>Understand customer needs and be able to incorporate a client perspective into communications.</li><li>Effectively work with subject matter experts across various remote and local departments.</li><li>Establish priorities and meet deadlines.</li><li>Handle multiple tasks while paying close attention to details.</li><li>Stay abreast of industry and marketing best practices, trends, ideas, tools, and technology.</li><li>Research, organize, and express information in a well-written format.</li></ul><p><strong>Qualifications</strong></p><ul><li>Minimum of 5 years marketing experience</li><li>Bachelor’s degree in a related field or equivalent experience</li><li>Strong writing skills and related experience are required, including the ability to create impactful marketing messages demonstrated through writing samples</li><li>Experience in content generation and marketing in the digital space</li><li>Experience in web services, social media, and digital marketing</li><li>Understanding of basic SEO strategies, content categorization and structure, content development, distribution, and measurement</li><li>Knowledge of AP style</li><li>Experience effectively managing a variety of marketing projects and timelines</li><li>Technology/software industry experience strongly preferred; public sector experience preferred</li><li>Microsoft Office and Adobe InCopy proficiency preferred</li><li>An understanding of graphic applications, image/media files, web media/interactive marketing, etc.</li><li>A positive attitude with a desire to go above and beyond expectations is key to the success of this role</li></ul><p><strong>Location</strong></p><p>Yarmouth, Maine | Lawrenceville, Georgia | Plano, Texas | Remote</p><h4>State Specific Salary Range Disclosure Requirements for Colorado, Connecticut, and Nevada</h4><p>Salary will generally fall between $46,185 - $60,770 before adjustment for geographic differences. Recruiter can confirm if position is incentive eligible.</p><p></p>",
    "apply": "https://www.tylertech.com/careers/job-listings/marketing-content-specialist-22-12509-01",
    "company": "/companies/tyler-technologies",
    "cName": "Tyler Technologies",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Digital Content Specialist",
    "description": "<p></p><p>Siege Media is a growing and remote-first content marketing agency! We are nationally recognized on Inc.’s Best Workplaces list and Inc. 5000 list, highlighting the 5000 fastest-growing private companies. Interested in joining the Siege team? We currently have a spot open for a talented Digital Content Specialist<strong> </strong>to help us continue to deliver great content for our world-class clients.</p><p>Perks for United States residents include 100% health, vision and dental benefits, 50% 401k match up to 6% of your salary, donation matching, career development training, unlimited PTO, work-from-home equipment, and free pens. Everyone loves free pens.</p><p>Learn more about working at Siege by watching our<a href=\"https://www.siegemedia.com/careers\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(43, 51, 58);\"> </a><a href=\"https://www.siegemedia.com/careers\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(17, 85, 204);\">careers video</a>, experiencing our culture on<a href=\"http://www.instagram.com/siege_media\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(43, 51, 58);\"> </a><a href=\"http://www.instagram.com/siege_media\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(17, 85, 204);\">Instagram</a>, and checking out our work on<a href=\"https://dribbble.com/siegemedia\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(43, 51, 58);\"> </a><a href=\"https://dribbble.com/siegemedia\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(17, 85, 204);\">Dribbble</a>!</p><p>Siege Media values diversity. We encourage people of color, lesbian, gay, bisexual, transgender, non-binary, parents and those with disabilities to apply. Through our “health, then work” philosophy we are committed to helping all people succeed at Siege. If you require reasonable accommodation to complete our application or interview process, please let us know.</p><p><strong>Responsibilities</strong></p><ul><li><span>Conduct keyword research to identify content opportunities for clients</span></li><li><span>Write comprehensive articles on a variety of topics with minimal supervision.</span></li><li><span>Demonstrate the ability to adapt tone and complexity of a piece to speak to the correct audience, as well as align with relevant style guides.</span></li><li><span>Demonstrate the ability to implement feedback from editors, clients, and teammates.</span></li><li><span>Demonstrate understanding of the project lifecycle and ability to collaborate across departments.&nbsp;</span></li><li><span>Hit client link and organic traffic goals month over month by creating content that ranks and/or passive link acquisition.&nbsp;</span></li><li><span>Assist with project management tasks including content scheduling and reporting.&nbsp;</span></li></ul><p><strong>Required Skills</strong></p><ul><li><span>1–2 years as a writer at a digital publication.</span></li><li><span>Experience writing for the web, with a focus on digital content including long- and short-form, infographics, and interactives.</span></li><li><span>Goal-orientated with the ability to set priorities, meet deadlines, and work independently.</span></li><li><span>Strong interpersonal skills and the ability to form productive working relationships in a remote environment.</span></li><li><span>Strong project management skills, with ability to handle multiple projects while still working effectively.</span></li><li><span>Close attention to detail and a heavy focus on creating quality content.</span></li><li><span>Proven ability to generate creative ideas that attract attention on the web.</span></li><li><span>Copywriting or blogging experience.</span></li></ul><p><strong>Suggested Skills</strong></p><ul><li><span>2–4 years experience working in an agency or similar marketing environment</span></li><li><span>B.S. or similar degree in English, journalism, or similar field.</span></li><li><span>Intermediary SEO knowledge with a working knowledge of SEO tools and how they can be used to improve client websites.</span></li><li><span>Experience using Microsoft Office and/or Google Workspace</span></li><li><span>Understanding of HTML/CSS and comfortable uploading content to WordPress.</span></li><li><span>Experience collaborating and giving guidance on design and UX best practices.</span></li><li><span>Experience creating thoughtful client reports.&nbsp;</span></li><li><span>Experience working with clients and/or in an agency environment.</span></li></ul><p><span>The salary range for this position is $52,000.00–$64,000.00 DOE.&nbsp;</span></p><p><span>This position is 100% remote and based in the US.</span></p><p><strong>Please plan to upload the following information during the application process:</strong></p><ol><li><span>Your resume</span></li><li><span>A short introduction/cover letter</span></li><li><span>Links to your portfolio/an attached portfolio</span></li><li><span>Two relevant blog writing samples (500 words minimum)</span></li></ol><p></p>",
    "apply": "https://siegemedia.applytojob.com/apply/0UdA47sm2t/Digital-Content-Specialist",
    "company": "/companies/siege-media",
    "cName": "Siege Media",
    "location": "Remote",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Copywriter",
    "description": "<p></p><p>The Dyrt is the largest camping community in the world. Every second, a new person visits The Dyrt to search, book and review camping options. We've grown to be one of the most trusted resources for campers of all backgrounds and experiences. And we're on a mission to build an accessible community that encourages, supports, and celebrates all people interested in camping.</p><p>If you love the outdoors and want to be part of a fast-growing consumer app, you’re in the right place.</p><p><strong>The Role</strong></p><p>The Dyrt is hiring a Full Stack Copywriter (contract) to support the brand across paid, organic, and lifecycle marketing. You will also be responsible for a few freelance copywriters to keep our brand voice consistent across all channels.</p><p>Do you love building a brand’s verbal identity to connect with the people that believe what we believe? Do you have a passion for being a champion of the community we’re serving? Are you excited to work collaboratively with a group of creatives and marketers?</p><p>If you answered yes, we’d love to hear from you.</p><p><strong>You will be responsible for:</strong></p><ul><li>Write compelling content for web, app, social, advertising, email, and marketing materials</li><li>Produce well-written content that is SEO friendly and optimized for conversion</li><li>Collaborate with designers and brand creative team</li><li>Work with analysts to iterate on messaging development</li><li>Participating in brainstorms to evolve our brand identity and develop personas</li><li>Define key messages and brand voice</li></ul><p><strong>Your skills include:</strong></p><ul><li>Strong editorial, proofreading, and writing skills</li><li>Experience with SEO copywriting best practices</li><li>Experience with social media and content marketing</li><li>Excellent interpersonal, verbal, and written communication skills</li><li>Ability to manage multiple projects and meet deadlines under pressure</li><li>Ability to understand the needs associated with a project and the target audience</li><li>Ability to move seamlessly from creative headline development to in-app messaging</li></ul><p><strong>Your qualifications:</strong></p><ul><li>A bachelor’s degree in marketing, communications, journalism, English, or a related field</li><li>Experience building and evolving a brand’s voice</li><li>Passion for writing with an excellent portfolio of work</li></ul><p><strong>Working Here</strong></p><p>The Dyrt is built by campers, for campers—whether you’re new to camping or have been camping your whole life.</p><p>We encourage everyone to spend more time outside, including employees. We offer competitive market-rate salaries, a generous vacation plan, and we even pay employee bonuses for using The Dyrt in the wild.</p><p>This is a full-time, contract position that is fully remote. Employees are expected to have high-speed internet and a professional working environment sufficient for clear video conferencing during regular working hours. Many of our employees work virtually from Portland, OR but we’re flexible on location and encourage all to explore. Our founders even&nbsp;<a href=\"https://www.fox21news.com/news/camping-couple-develops-popular-app-to-help-plan-trips/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(68, 68, 68);\">work from their van</a>.</p><p>The Dyrt is an equal opportunity workplace. We are especially proud to have a female founder and a higher percentage of female employees than the national average for tech companies. We believe that the outdoors are for everyone, and are committed to building an inclusive platform and community that encourages, supports, and celebrates all people interested in camping.</p><p>Interested candidates should submit a cover letter and resume.</p><p>About The Dyrt</p><p>The Dyrt was started in Portland, OR, is venture-backed, and has 40-50 employees working virtually around the U.S.</p><p></p>",
    "apply": "https://the-dyrt.breezy.hr/p/971192e67c1d-copywriter-contract",
    "company": "/companies/the-dyrt",
    "cName": "The Dyrt",
    "location": "USA",
    "type": "Contract",
    "category": "copywriting"
  },
  {
    "title": "Digital Copywriter - Contract",
    "description": "<p></p><p><strong>Your Journey at Crowe Starts Here:</strong></p><p>At Crowe, you have the opportunity to deliver innovative solutions to today’s complex business issues. Crowe’s accounting, consulting, and technology personnel are widely recognized for their in-depth expertise and understanding of sophisticated process frameworks and enabling technologies, along with their commitment to delivering measurable results that help clients build business value. Our focus on emerging technology solutions along with our commitment to internal career growth and exceptional client value has resulted in a firm that is routinely recognized as a “Best Place to Work.” We are 75 years strong and still growing. Come grow with us!&nbsp;</p><p><strong>Job Description:</strong></p><p>Crowe is seeking a digital copywriter to primarily deliver copy for a high volume of marketing webpages (net new and in the form of refreshes to existing service and/or industry pages). This writer may also need to produce copy for short&nbsp;– and long-form digital content including emails, social posts, and articles. They will articulate in conversational, yet concise words, the need for discernable solutions to complex business problems – across myriad industries and buyers within those industries. All while being mindful of compliance standards in our messaging.</p><ul><li>If you’re an agile, versatile writer who thrives in an entrepreneurial, collaborative environment, Crowe is looking for you.</li><li>Who you are:</li><li>A digital-first writer who can balance the ingredients of voice, tone, branding, UI/UX, and SEO to make memorable, human-centered content that also drives business growth.</li><li>A storyteller who can interview subject matter experts and dig deep to uncover compelling, authentic, and personable insights that translate to strong headlines and copy that flows well.</li><li>An idea generator that can identify what it takes to meet business, market, and client needs for the short- and long-term.</li><li>You think through the buyer journey and are an advocate for a customer-centric and highly creative writing approach.&nbsp;</li><li>You understand how to balance regulatory and compliance requirements that go with the territory of writing for highly regulated practices such as tax, accounting, and audit.&nbsp;</li><li>You can think through copy for a high volume of webpages – including the page hierarchy, user experience, CTAs, user intent&nbsp;and interlinking.</li><li>You understand how your role as a digital writer plays into a larger marketing organization and day-to-day marketing operations.</li><li>You succeed in a collaborative work environment but can also proactively and independently get answers or make strategic decisions.&nbsp;</li><li>Primary duties:</li><li>Produce high-volume clear, compelling copy on deadline that follows voice, tone, and provided narrative guidance – and in some cases be able to move forward with limited direction.</li><li>Account for the technical side of copy including SEO requirements, character counts, copy templates, and wireframes.</li><li>Quickly and seamlessly manage multiple copy iterations and review rounds.</li><li>As needed, contribute to, and help maintain, digital copywriting standards such as copy templates and best practices for webpages, social media, emails, and more.</li></ul><p><strong>Required skills and characteristics:</strong></p><ul><li>High-performing, high-energy self-starter, with proven ability to work both independently as well as a member of teams in an extremely fast-paced, deadline-driven, and remote work environment.</li><li>Exceptional and effective writing, editing, and message development skills that emphasize clear construction, grammar, and relevance.&nbsp;</li><li>Ability to write in clear, compelling language specific to various channels, even when the subject matter is innately complex.</li><li>Experience with short-form (ad copy, infographics, interactive experiences) and long-form (content marketing, thought leadership).</li><li>Ability to provide multiple ideas and inspire creative excellence in colleagues.</li><li>Experience working on integrated marketing campaigns across multiple channels.</li><li>Experience working as part of a vast enterprise organization with large cross-functional business units, industry teams, and internal groups.</li><li>Exemplary oral and written communication skills.</li><li>Excellent interpersonal skills, as well as the ability to influence key individuals and teams internally.</li><li>Confidence and assertiveness; ability to build respect and credibility with colleagues and clients.</li><li>Ability to keep ego in check and adjust to shifting needs and views from multiple stakeholders, including internal team members.</li><li>Minimum qualifications:</li><li>Bachelor’s degree in journalism, communications, English, or marketing.&nbsp;</li><li>A minimum of 5 years of experience in writing general digital marketing copy, preferably in a corporate setting, with at least 3 of those years including high-volume copywriting for site revamps, migrations, or content refreshes.</li><li>Awareness of industry trends and techniques to keep Crowe at forefront of digital innovation.</li><li>Experience writing creatively while also complying with legal and regulatory standards and using a style guide, preferably Associated Press.&nbsp;</li><li>Proficiency in UI/UX and SEO best practices for copywriting.</li><li>High proficiency in collaborative tools such as SharePoint, Google Docs&nbsp;, Zoom, Slack, Microsoft Teams, InVision, FlowMapp, and project management platforms like Workfront.</li><li>Agency and in-house client-side experience, preferably.</li><li>Complete comfort with an offsite, virtual environment.&nbsp;</li><li>Monday-Friday work schedule with the ability to meet deadlines during regular business hours.</li></ul><p><strong>Our Benefits:</strong></p><p>At Crowe, we know that great people&nbsp;are what makes a great firm. We value our people and offer employees a comprehensive benefits package. Learn more about what working at Crowe can mean for you!</p><p><strong>How You Can Grow:</strong></p><p>We will nurture your talent in an inclusive culture that values diversity. You will have the chance to meet on a consistent basis with your Career Coach that will guide you in your career goals and aspirations. Learn more about where talent can prosper!</p><p><strong>More about Crowe:</strong></p><p>Crowe (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.</p><p>Crowe LLP provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.&nbsp;</p><p></p>",
    "apply": "https://jobs.crowe.com/job/15469841/digital-copywriter-contract-chicago-il/",
    "company": "/companies/crowe",
    "cName": "Crowe",
    "location": "USA",
    "type": "full-time",
    "category": "copywriting"
  },
  {
    "title": "Princ Business Consultant-MedTech",
    "description": "<p></p><p>Veeva [NYSE: VEEV] is the leader in cloud-based software for the global life sciences industry. Committed to innovation, product excellence, and customer success, our customers range from the world’s largest pharmaceutical companies to emerging biotechs. Veeva’s software helps our customers bring medicines and therapies to patients faster.</p><p>We are the first public company to become a&nbsp;<a href=\"https://www.veeva.com/pbc/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(219, 96, 21);\"><strong>Public Benefit Corporation</strong></a>. As a PBC, we are committed to making the industries we serve more productive, and we are committed to creating high-quality employment opportunities.</p><p>Veeva is a&nbsp;<a href=\"https://www.veeva.com/work-anywhere/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(219, 96, 21);\"><strong>Work Anywhere</strong></a>&nbsp;company which means that you can choose to work in the environment that works best for you – on any given day. Whether you choose to work remotely from home or work in an office – it’s up to you.</p><p><strong>The Role</strong></p><p>We are seeking talented consulting leaders to join the Veeva MedTech Business Consulting group, a priority focus area for Veeva as we continue to help customers in the Life Sciences industry bring their products to market faster and smarter.</p><p>As a Principal Consultant, you will help grow the MedTech Business Consulting practice globally, focusing on building our brand, cultivating relationships, and identifying and selling projects to support our customers’ success. As an advisor, you will manage complex, team-based consulting projects for Veeva customers in MedTech – managing the day-to-day client relationship and being responsible for all aspects of delivery</p><p><strong>What You’ll Do</strong></p><ul><li>Lead and advise on MedTech projects as the operational face of a Veeva Business Consulting team</li><li>Act as the solution architect to design end-to-end solutions and deliverable set required to meet our customers’ objectives</li><li>Lead business development opportunities across MedTech – including identifying and generating opportunities and authoring differentiated proposals to solve our customers’ core challenges</li><li>Leverage your industry network to build new relationships and grow the team</li><li>Act as the trusted client contact for operational and strategic questions</li><li>Lead multiple project engagement teams – empowering the team to plan and manage all aspects of delivery, from scope to quality assurance</li></ul><p><strong>Requirements</strong></p><ul><li>Experience leading complex, multi-stream, projects from initial scoping to project close, for global MedTech customers</li><li>Working knowledge across the entire MedTech product life cycle from pre-clinical development to post-market commercialization. This should include deep expertise in 2-3 of the following: MedTech Clinical Trials, MedTech Regulatory Affairs, MedTech Quality, MedTech Engagement model design and execution, MedTech Communications &amp; Content strategy, including Claims Management, Key Account Management, Market Access, New product planning, and Launch Readiness</li><li>Experience cultivating long term relationships and identifying, architecting, and selling projects &gt; USD $250K</li><li>At least 10+ years of experience in a consultative role at reputable consulting firms or internal facing position</li></ul><p>#LI-RemoteUS</p><p>#BI-Remote</p><p>BCMedTechVeeva’s headquarters is located in the San Francisco Bay Area with offices in more than 15 countries around the world.</p><p>Veeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances. If you need assistance or accommodation due to a disability or special need when applying for a role or in our recruitment process, please contact us at talent_accommodations@veeva.com.</p><p></p>",
    "apply": "https://careers.veeva.com/job/15478494/principal-business-consultant-medtech-remote-minneapolis-mn/",
    "company": "/companies/veeva-systems",
    "cName": "Veeva Systems",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Business Dev Associate - EVERFI",
    "description": "<p></p><p>The Business Development Associate supports one or more members of the Enterprise Revenue Team to maximize new logo acquisition and upsell to current customers through sales planning, prospecting, account mapping, initial sales calls, proposal and sales materials development, and follow up with targeted accounts to drive the sale. In this capacity, the Associate directly facilitates the acquisition of new strategic customers and the optimization of sales for large strategic enterprise accounts that contribute to EVERFI's Revenue goals.</p><p><strong>Responsibilities</strong></p><ul><li>Support Enterprise Account Executives throughout the sales process to achieve quota targets. This includes facilitating the identification of top prospects and customers with upsell potential</li><li>Conduct in-depth account and contact research to inform short term and long term account strategies and planning</li><li>Prospect and qualify strong opportunities in the ESG team’s territory by cold calling and thoughtful email outreach</li><li>Schedule and participate in customer meetings and presentations with potential &amp; current customers, as needed, and in support of the Enterprise Account Executive</li><li>Synthesize, document, and provide market feedback to internal teams to help tailor and refine EVERFI products, sales messaging and marketing materials for all stages of the sales process</li><li>Assist in identifying and lead in producing compelling sales collateral customized to account and stakeholder needs throughout the sales process and coordinate with internal stakeholders to inform sales assets to accelerate sales cycle</li><li>Demonstrate working knowledge of EVERFI's products and represent the EVERFI brand alongside the Enterprise Account Executive via client calls, presentations and at events</li><li>Maintain notes in Salesforce accordingly</li><li>Other job related duties as assigned</li></ul><p><strong>Skills, Experience &amp; Qualifications</strong></p><ul><li>Bachelor’s degree preferred; or an equivalent combination of education and experience</li><li>A minimum of 1 year of Account Management, Agency, Sales, or Business Development experience with a demonstrated track record of hitting and exceeding targets</li><li>Ability to meet individual goals while directly supporting achievement of team revenue goals</li><li>Excellent professional communication skills, both oral and written; ability to adjust message to various audiences</li><li>Self-motivated, and solutions-driven</li><li>Creative and detailed oriented</li><li>Ability to manage multiple tasks simultaneously</li><li>Strong collaboration, relationship and probing skills</li><li>Aspire to grow professionally through coaching and development</li><li>Proficient with Google Suite, including Slides and Sheets</li><li>Ability to work in a fast-paced and changing environment; work well under pressure</li><li>Working knowledge of Salesforce preferred</li><li>Ability to travel occasionally, as needed</li></ul><p>Stay up to date on everything Blackbaud, follow us on <a href=\"http://bit.ly/FollowUsLI\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(8, 117, 225);\">Linkedin</a>, <a href=\"http://bit.ly/2xn65ez\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(8, 117, 225);\">Twitter</a>, <a href=\"https://www.instagram.com/blackbaud/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(8, 117, 225);\">Instagram</a>, <a href=\"http://bit.ly/2yNWNJH\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(8, 117, 225);\">Facebook</a> and <a href=\"https://bit.ly/BLKBYouTube\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(8, 117, 225);\">YouTube ​</a></p><p>Blackbaud is a remote-first company which embraces a flexible remote work culture.&nbsp; Blackbaud supports hiring and career development for all roles from the location you are in today!</p><p>Blackbaud is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, physical or mental disability, age, or veteran status or any other basis protected by federal, state, or local law.</p><p><em style=\"color: rgb(255, 122, 69); background-color: transparent;\">To all recruitment agencies:</em><em style=\"background-color: transparent;\"> We do not accept unsolicited agency resumes and are not responsible for any fees related to unsolicited resumes.</em></p><p></p>",
    "apply": "https://blackbaud.wd1.myworkdayjobs.com/en-US/ExternalCareers/job/Remote---Anywhere---USA/Business-Development-Associate---EVERFI_R0009105",
    "company": "/companies/blackbaud",
    "cName": "Blackbaud",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Business Change Director",
    "description": "<p></p><p><strong>Be a Part of an Extraordinary Team!</strong></p><p><strong>We are looking for leaders at all levels of the organization who are passionate about making an impact on our members and the communities we serve. You will thrive in a complex and collaborative environment where you take action and ownership to solve problems and lead change. Do you want to be part of a larger purpose and an evolving, high-performance culture that empowers you to make an impact?</strong></p><p>The Business Change Director&nbsp;will play a key role in supporting the growth, evolution and maintenance of Anthem’s Network Solutions including custom network arrangements. This role will be responsible for working with cross-functional stakeholders focused on developing value based provider strategies and monitoring execution of these plans to enhance network portfolio.</p><p><span>Successful candidate will be a self-starter who bring a mix of intellectual curiosity, a commitment to excellence, attention to detail, an interest in spanning strategy and execution, and business consulting skills.</span></p><p><strong>Business Change Director</strong></p><p>Location: Remote opportunity-EST and CST time zones preferred</p><p><strong>Build the possibilities.&nbsp;Make an extraordinary impact</strong>.</p><p>As a&nbsp;<strong>Business Change Director</strong>, you will be responsible for working with management to identify and implement strategic network solutions, programs and plans, working cross- functionally to optimize and maintain the existing network that support achievement of value-based business unit and enterprise goals.</p><p><strong>How you will make an impact:</strong>&nbsp;</p><ul><li>Specializes in network effectiveness to include data analysis and ensures activities are aligned with corporate strategy.</li><li>Identifies potential issues, project change, and scope data.</li><li>Leads efforts to identify best practices.</li><li>Identifies impacted parties, business partners, and resources required.</li><li>Develops and designs processes and systems that support network and value-based care business needs.</li><li>Designs methods for integrating functions and processes.</li><li>Conducts network cost/benefit analyses.</li><li>Builds support for business change, network reassessment throughout Provider Solutions business unit.</li><li>Provides process, project, and change management methodology coaching/consulting support to both local and enterprise wide initiatives.</li><li>Leads the network solutions prioritization and scheduling activities for the business unit.</li><li>Provides expertise in process planning and portfolio management activities.</li><li>Supports the execution of the operating plan.</li></ul><p><strong>Qualifications</strong></p><p><strong>Minimum Requirements:</strong></p><p>Requires a BA/BS in a related field and minimum of 10 years managing mid to large-scale change/project initiatives; or any combination of education and experience which would provide an equivalent background.</p><p><strong>Preferred Skills, Capabilities and Qualifications:</strong>&nbsp;</p><ul><li>Knowledge of planning models and methodology, project management and change management experience (strategic and execution) strongly preferred</li><li><span>Previous network development and/or value-based payment arrangement experience is strongly preferred</span></li><li>Masters degree preferred</li><li>Up to 20% travel may be required</li></ul><p>&nbsp;We offer a range of market-competitive total rewards that include merit increases, paid holidays, Paid Time Off, and incentive bonus programs (unless covered by a collective bargaining agreement), medical, dental, vision, short and long term disability benefits, 401(k) +match, stock purchase plan, life insurance, wellness programs and financial education resources, to name a few.</p><p>The health of our associates and communities is a top priority for Anthem. We require all new candidates to become vaccinated against COVID-19. If you are not vaccinated, your offer will be rescinded unless you provide – and Anthem approves – a valid religious or medical explanation as to why you are not able to get vaccinated that Anthem is able to reasonably accommodate. Anthem will also follow all relevant federal, state and local laws.</p><p><strong><em>Anthem, Inc. has been named as a Fortune Great Place To Work in 2021, is ranked as one of the 2021 World’s Most Admired Companies among health insurers by Fortune magazine, and a Top 20 Fortune 500 Companies on Diversity and Inclusion. To learn more about our company and apply, please visit us at careers.antheminc.com. Anthem is an Equal Employment Opportunity employer and all qualified applicants will receive consideration for employment without regard to age, citizenship status, color, creed, disability, ethnicity, genetic information, gender (including gender identity and gender expression), marital status, national origin, race, religion, sex, sexual orientation, veteran status or any other status or condition protected by applicable federal, state, or local laws. Applicants who require accommodation to participate in the job application process may contact&nbsp;ability@icareerhelp.com&nbsp;for assistance.</em></strong></p><p></p>",
    "apply": "https://anthemcareers.ttcportals.com/jobs/9271572-business-change-director",
    "company": "/companies/anthem-inc",
    "cName": "Anthem, Inc.",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "IT Service Delivery Manager",
    "description": "<p></p><p><strong>Job Summary:&nbsp;</strong></p><p><span>The IT service delivery manager for Nuvento provides expertise in the design and development of information technology (IT) systems, within all levels of complexity. The IT Service Delivery Manager (SDM) will report to Chief Technology Officer (CTO) and will be responsible for driving the planning and delivery of IT projects.</span></p><p><strong>As the IT Service Delivery Manager, you will be responsible for:</strong></p><ul><li><span>Leading a team resources to enable technology resources to deliver projects in time and within budget for the domain and geography for which they have responsibility&nbsp;</span></li><li><span>Maintaining end-to-end accountability for customer satisfaction and overall delivery excellence&nbsp;</span></li><li><span>Working with their teams to determine necessary activities to successfully deliver projects throughout the given service line or function&nbsp;</span></li><li><span>Monitoring and executing IT policies, security, and standards&nbsp;</span></li><li><span>Ensuring that the right type and number of resources that are required to fulfill the planned projects are available and in place&nbsp;&nbsp;</span></li><li><span>Delivering customer satisfaction and overall excellence by identifying opportunities (or issues) and assisting with speedy resolution&nbsp;</span></li><li><span>Understanding the pipeline of demand and work with the team to ensure timely project completion&nbsp;</span></li><li><span>Financial management and reporting and optimizing processes&nbsp;</span></li><li><span>Juggling multiple and conflicting priorities in a timely and sensitive way&nbsp;</span></li><li><span>Managing and leading complex stakeholders towards optimal solutions while helping them understand resource constraints and prioritization&nbsp;</span></li><li><span>Holding the teams to the highest standards, project discipline and accountability&nbsp;&nbsp;</span></li><li><span>Continuously improving the technical delivery model and strategy, implementing and managing delivery with the associated teams.&nbsp;&nbsp;</span></li></ul><p><strong>Performance and Quality Management&nbsp;</strong></p><ul><li><span>Recommend methods of improvement and seeing that actions are implemented on time for service delivery upgrades&nbsp;</span></li><li><span>Providing accurate and&nbsp;regular reports&nbsp;to the management on the performance of the service delivery&nbsp;</span></li><li><span>Leading personnel management, including staff recruitment, performance assessment, training, and mentoring&nbsp;</span></li><li><span>Building strong relationships with teams and stakeholders to enable effective dialogue exchange between departments&nbsp;</span></li></ul><p><strong>Supervision Responsibilities&nbsp;</strong></p><ul><li><span>Conduct regular 1:1 briefings with the direct reports on an on-going and regular basis&nbsp;</span></li><li><span>Know the status of projects in his/her span of control and any key issues that may impact scope or budget&nbsp;</span></li><li><span>Synthesize and communicate project and business issues on an on-going basis, manage the group’s awareness of major business and IT issues, and help to prevent escalations, where possible&nbsp;</span></li></ul><p><strong>Knowledge and Skills Requirements:&nbsp;</strong></p><ul><li><span>Good business acumen and ability to negotiate with business partners&nbsp;</span></li><li><span>Strong customer orientation and able to manage customer expectations&nbsp;</span></li><li><span>Good executive presence&nbsp;</span></li><li><span>Ability to develop strategic plans and translate them to actionable roadmaps&nbsp;</span></li><li><span>Good financial and people leadership skills&nbsp;</span></li><li><span>Initiates, builds, and maintains productive customer relationships&nbsp;</span></li><li><span>Flexibility to adjust to multiple demands, shifting priorities, ambiguity, and rapid change&nbsp;</span></li><li><span>Ability to manage risk, and encourage strategic risk management-based delivery in others to manage expectations and communicate effectively&nbsp;</span></li><li><span>Strong collaboration skills to build teams across business boundaries&nbsp;</span></li><li><span>Leadership skills to successfully lead diverse and virtual teams. Agile working experience necessary.&nbsp;&nbsp;</span></li><li><span>Drives operational improvements and efficiencies through the creation and implementation of rigorous processes and controls, acts as a gatekeeper for quality&nbsp;</span></li><li><span>Building trust with senior stakeholders in times of pressure.&nbsp;&nbsp;</span></li><li><span>Experience managing multiple complex projects at a global level and regional&nbsp;</span></li></ul><p><strong>Education:&nbsp;</strong></p><p><span>&nbsp;A degree in Computer Science and/or a business-related degree; or equivalent work experience&nbsp;</span></p><p><strong>Experience:</strong></p><ul><li><span>3+ years’ experience working in a fast-paced, high-demand work environment scaling from 300+ resources.&nbsp;</span></li><li><span>Considerable experience in a customer service role and business management role&nbsp;</span></li><li><span>Work experience in a professional services industry, preferred&nbsp;</span></li><li><span>Experience managing external vendors, commercial negotiations&nbsp;</span></li><li><span>Excellent relationship building and interpersonal skills, including cross-cultural competence&nbsp;</span></li><li><span>Proven delivery excellence ideally using Agile&nbsp;</span></li><li><span>Strong leadership qualities and a passion for building high performing teams&nbsp;</span></li></ul><p></p>",
    "apply": "https://nuvento.com/careers/kochi/#IT%20Service%20Delivery%20Manager",
    "company": "/companies/nuvento",
    "cName": "Nuvento",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Learning Business Consultant",
    "description": "<p></p><p><strong>Section 1: Position Summary</strong></p><p>The Learning Business Consultant is responsible for collaborating with business units/functions/divisions and leadership to determine professional development needs and technical/functional needs in support of organizational goals. Based on needs analyses, this position will work with leaders, subject matter experts and/or external vendors to drive the development and implementation learning solutions that measurably improve performance.</p><p><strong>Section 2:&nbsp;Job Functions, Essential Duties and Responsibilities</strong></p><ul><li>Consult with department leaders, HR Business partners, and key stakeholders to identify development opportunities at the role, team, function, and/or organizational level.</li><li>Assess priorities within the aligned workstream(s) and work with business leaders to negotiate dates, deadlines, and deliverables.</li><li>Thoroughly review data and metrics and employ analytical skills to uncover systemic performance issues related to process, procedure, knowledge management, resources, tools, capacity, motivation, and training.</li><li>Collaborate with business leaders to provide effective, holistic solutions to drive sustainable performance outcomes.</li><li>Perform training needs analysis, derive objectives, determine measurement strategies, and create training development plans.</li><li>Collaborate with Instructional Designers and learning and development professionals to drive the design and development of new and redesigned training initiatives that support the modern learner.</li><li>Attend project meetings and ensure L&amp;OD responsibilities are delivered on time and of high quality.</li><li>Research, initiate, and maintain vendor relationships.</li><li>Responsible for protecting, securing, and proper handling of all confidential data held by Ascensus to ensure against unauthorized access, improper transmission, and/or unapproved disclosure of information that could result in harm to Ascensus or our clients.</li><li>Our I-Client service philosophy and our Core Values of People Matter, Quality First and Integrity Always® should be visible in your actions on a day to day basis showing your support of our organizational culture.</li><li>Assist with other tasks and projects as assigned</li></ul><p><strong>Supervision</strong></p><ul><li>N/A</li></ul><p><strong>Section 3:&nbsp;Experience, Skills, Knowledge Requirements</strong></p><ul><li>Bachelor’s degree or equivalent work experience.</li><li>Minimum of 5 years of dedicated Learning &amp; Development experience.</li><li>Demonstrate high degree of initiative and accountability.</li><li>Ability to identify business and department needs, analyze systemic performance issues, and propose effective solutions.</li><li>Exhibits confidence and diplomacy to engage effective collaboration with business stakeholders at all professional levels.</li><li>Adapts quickly to changing circumstances, processes, and priorities.</li><li>Retirement plan experience a plus.</li></ul><p><strong><em>We are proud to be an Equal Opportunity Employer</em></strong></p><p><span>At Ascensus, we aspire to make a difference for others.&nbsp;We are a technology-enabled services company that helps people save for retirement, education, and healthcare through our network of institutional, financial advisor, and state partners. Our culture is guided by sound principles, is committed to high standards, operates with transparency, and welcomes diversity—housed within our Core Values: People Matter. Quality First. Integrity Always.</span><span>®</span></p><p><span>As a&nbsp;leading independent recordkeeping services partner, retirement plan third-party administrator, and government savings facilitator, we aim to hire associates who find pride in going to work every day knowing that they help more than 12 million people save for what matters.</span></p><p></p>",
    "apply": "https://careers.ascensus.com/showjob/15507952/learning-business-consultant-us-nationwide/",
    "company": "/companies/ascensus",
    "cName": "Ascensus",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Product Owner",
    "description": "<p></p><p>Join an industry leading company today!&nbsp;WebstaurantStore, a division of Clark Associates, is looking for candidates who possess strong critical thinking and problem-solving skills&nbsp;to join our growing company as Product Owners.&nbsp;This role acts as a stakeholder for the Content Department in programming and product data integrity initiatives and is a key part of growing our business and serving the purchasing needs of foodservice professionals worldwide.</p><p><strong>As a Product Owner, you will:</strong></p><ul><li>Serve as a product owner and stakeholder representing the Content Team in cross-departmental projects that require development work</li><li>Be an expert in our proprietary Content Management System (CMS) to provide support to the Content Team and suggest improvements for efficiency</li><li>Work closely with members of the Content Team to help troubleshoot bugs and update product data</li><li>Communicate with various programming teams, business analysts, and other department product owners/stakeholders</li><li>Manage backlogs, features, and tickets that impact the Content Team</li><li>Provide solutions on how to implement new company initiatives and related product data into the existing CMS</li><li>Help audit and monitor product data to ensure accurate information is presented to customers</li><li>Communicate changes to website features and CMS tools to all impacted departments</li><li>Keep department documents up to date on new and evolving features within the CMS</li><li>Participate in team meetings and product trainings</li><li>Attend conferences related to the food industry and develop a knowledge of the food service industry</li></ul><p><strong>We are looking for driven, motivated candidates who:</strong></p><ul><li>Have experience working in a Content Management System</li><li>Have exceptional written and verbal communication skills</li><li>Are self-motivated to complete work assignments</li><li>Possess strong attention to detail</li><li>Are able to multi-task</li><li>Are receptive to feedback on their work</li><li>Take initiative to solve problems independently</li><li>Are able and willing to learn new tasks and new software</li><li>Have superior critical thinking, problem-solving, and troubleshooting skills</li><li>Are open to evolving with the role</li><li>Are willing to suggest improvements related to site features and ongoing projects</li><li>Are familiar with the Microsoft Office Suite</li></ul><p>This position is also available as a remote position. If you're searching for a full-time, permanent work-at-home career, we’ve got an opportunity for you to join our fast-growing team! Currently, we are employing legal residents of the following states: (AL, AZ, AR, DE, FL, GA, KS, KY, MD, MI, MS, NV, NC, OH, OK, PA, SC, TN, TX, VA, WV, WI or WY). H-1B Visa Sponsorship Not Available, W2 only.&nbsp;<strong>Cover letter required for consideration.</strong></p><p>As a WebstaurantStore remote employee, you'll enjoy the same training and support to be successful in your position as employees at our physical corporate locations. We stay connected through video meetings, training sessions, and collaborative forums, and provide opportunities for you to connect with other employees from across the country both professionally and personally.</p><p><strong>To qualify, candidates must have:</strong></p><ul><li>Access to a reliable and secure high-speed internet connection. Cable or fiber internet connections (at least 25mbps download/10mbps upload) are preferred, as satellite connections often cannot support the technologies used by WebstaurantStore to perform day-to-day tasks.</li><li>Access to a home router and modem.</li><li>A dedicated home office space that is noise and distraction-free. The space should have strong wireless connection or a wired Ethernet connection (wired connection is preferred, if possible).</li><li>A valid, physical address (apartment, suite, etc.); PO Boxes are not supported as a physical address is required for you to receive your computer equipment.</li><li>The desire and ability to work and communicate with other team members via chat, webcam, etc.</li></ul><p><strong>Work from home benefits include:</strong></p><p>• The essential computer equipment, such as hardware and software, needed to perform your job.</p><p>If you’re ready for a challenge and have the ambition to succeed in a fast paced, growing industry, we’d love to discuss the Content Systems Analyst position with you! Submit your resume and apply online today.</p><p></p>",
    "apply": "https://www.clarkassociatesinc.biz/careerdetail",
    "company": "/companies/webstaurantstore",
    "cName": "WebstaurantStore",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Senior Technical Product Manager, Homes",
    "description": "<p></p><p><strong>About the job&nbsp;</strong></p><p>As a Technical Product Manager on the Homes team, you’ll have the opportunity to work on a greenfield product within Hopper’s $4B+ travel ecosystem. Our goal is to guarantee that customers will get the best selection of vacation rentals when booking through Hopper, while also ensuring a best-in-class user experience.&nbsp;</p><p>As a Technical Product Manager for Homes, you will be spearheading the building of a greenfield best-in-class API to connect with our vacation rental partners. You will need to dive deep into the data and develop an understanding of the competitive travel landscape as the basis for new features. On any given day — whether you’re surveying our supply and connectivity partners to better understand their needs, partnering with engineering to scope a feature down to the MVP, or combing through data for new insights — your contribution will be critical to Hopper Homes current and future success.</p><p><strong>Responsibilities</strong></p><ul><li>Lead, create, and launch the Hopper Homes API that we will use to connect with our vacation rental providers</li><li>Own a product lane within Homes — this role is specific for Supply &amp; Connectivity, from inception through implementation&nbsp;</li><li>Gather requirements, define KPIs, partner with engineers to create a best-in-class API, and establish delivery timelines and prioritization with engineering</li><li>Determine path to launch MVPs, outline hypotheses to validate the business case, get user data and feedback faster, limiting cost and downside risk before making larger time and resource investments</li><li>Own the product outcomes and track the impact to North Star Objectives for the Supply &amp; Connectivity team and Homes team at large</li><li>Understand and explain complex technical issues, discern impact, and communicate them to maximize clarity and drive resolution</li><li>Develop and nurture effective relationships with both internal and external partners</li><li>Use good judgment to make appropriate trade-offs when scoping and specifying solutions, ensuring that anything we build adds value to the business and continues to delight our users</li></ul><p><strong>Minimum Qualifications</strong></p><ul><li>5+ years of experience in a Product Management role, with strong experience working in a very technical product environment</li><li>Experience building large scale APIs from the ground up from inception to implementation</li><li>Technical depth to effectively lead conversations with engineers and data scientists</li><li>A track record of building innovative solutions to real-world user problems, aligned with the business needs of a rapidly scaling organization</li><li>Obsessive focus on the details in planning, evaluating, and building products from start to finish while leading and driving cadence with a high-performance team</li><li>A bias for action and launching “scrappy” solutions quickly to get feedback from real users as early as possible</li><li>Highly proficient analytics skills and SQL knowledge to self-serve data questions and draw accurate conclusions to adjust strategy accordingly</li><li>Exceptional ability to grasp, manage, and articulate complex systems and data structures — must have experience building products that rely on technically complex APIs</li><li>Excellent communication skills to construct compelling business cases both in-person and in-writing</li><li>Passion for Hopper’s mission to build the most customer centric travel marketplace on Earth</li><li>No ego. Strong focus on doing what is right for the customer and the company</li></ul><p><strong>Benefits</strong></p><ul><li>Well-funded and proven startup with large ambitions, competitive salary and stock options</li><li>Unlimited PTO</li><li>WeWork All Access Pass OR Work-from-home stipend</li><li>Entrepreneurial culture where pushing limits and taking risks is everyday business</li><li>Open communication with management and company leadership</li><li>Small, dynamic teams = massive impact</li><li>100% employer paid medical, dental, vision, disability and life insurance plans</li><li>Access to a 401k (US) or Retirement Savings Plan (Canada)</li></ul><p>Despite the pandemic’s impact on the travel industry, Hopper has emerged stronger than ever. As the travel industry continues to rebound, Hopper has demonstrated significant outperformance with its category-leading mobile-only marketplace, delivering value to customers and supply partners with the company’s proprietary suite of fintech offerings.&nbsp;</p><p><strong>Here are just a few stats that demonstrate the company’s recent growth:</strong></p><p>-&nbsp;Hopper’s valuation is now over&nbsp;$<a href=\"https://techcrunch.com/2022/02/03/hopper/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(255, 255, 255);\">5B</a>&nbsp;The company’s valuation has more than<strong>&nbsp;</strong>tripled&nbsp;since early 2020.&nbsp;</p><p>- The company grew its revenue by more than 300% YoY in 2021. Hopper’s monthly revenues are now 375% higher than its pre-pandemic high point and Hopper Cloud, Hopper’s new B2B initiative, is already 15% of its revenues and growing.</p><p>- According to Apptopia, Hopper was the #1 most downloaded OTA in the US in 2021. The app has over 70 million downloads.&nbsp;</p><p>- Hopper’s recovery is faster than the market and its share of the air travel market in North America is now 300% higher than prior to the pandemic, according to MIDT.</p><p>- The company sells over $2B in travel and travel related financial services annually&nbsp;</p><p>- Hopper’s fintech offerings, such as Price Freeze and Rebooking Guarantee, now represent over 70% of its air revenue.</p><p>- Given the success of its travel fintech, Hopper recently launched a B2B initiative called Hopper Cloud, where any travel provider can unlock a totally unique revenue stream by seamlessly integrating and offering Hopper’s travel content and fintech products. Hopper Cloud partners include Capital One, Kayak, Marriott, Amadeus,&nbsp;<a href=\"http://trip.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(255, 255, 255);\">Trip.com</a>, and MakeMyTrip.</p><p>- The industry opportunity for Hopper Cloud is enormous as projections estimate that if all travel distribution channels offered travel fintech, it could increase the total consumer spend for the sector by $200 billion annually.</p><p>All this recent growth is just the beginning. There are still so many new opportunities we’re excited to tackle in the next year!</p><p></p>",
    "apply": "https://www.hopper.com/careers/2f2725ad-27ee-4bda-9299-ba89a55b4fb3",
    "company": "/companies/hopper",
    "cName": "Hopper",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Sr Product Manager ,Experience",
    "description": "<p></p><p>-Fully Remote Role-</p><p>Are you interested in building highly performant hyper-scale data platform? Do you want to revolutionize the way customers run workloads on-premises, private and public clouds? Do you want to have direct and immediate impact on hundreds of users who use Couchbase data platform across all those platforms?</p><p>We are looking for&nbsp;Senior Product Manager&nbsp;to join the&nbsp;Couchbase Cloud/Capella&nbsp;team. Looking for someone with a strong technical background in distributed systems to join our Product Management team. The successful candidate needs to have prior experience in product management and a very good understanding of the cloud-native ecosystem.&nbsp;</p><p><strong>Responsibilities &amp; Requirements</strong></p><ul><li class=\"ql-indent-1\">As Product Manager for our Product Experience team, you will understand the software engineers who build applications using NoSQL databases and Couchbase.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</li><li class=\"ql-indent-1\">Adopt the mindset of a software engineer about the end-to-end-user experience of development using Capella. Be a strong voice for software engineering communities</li><li class=\"ql-indent-1\">Gather feedback from developers and new users on the experience design product requirements to optimally build experiences tailored for those personasExperience running experiments and A/B tests to inform product decisions</li><li class=\"ql-indent-1\">Drive the personalization, testing, and user experience optimization strategy with a growth-oriented approach across the adoption funnel.&nbsp;</li><li class=\"ql-indent-1\">Develop and validate hypotheses,&nbsp;socialize insights, forecast impact, and build a product roadmap.&nbsp;Write detailed product specifications as epics and user stories that allow for efficient development and prioritization</li><li class=\"ql-indent-1\">Be the customer advocate every step along the way, help the entire product team to see what makes the difference between just another feature and a customer delight</li><li class=\"ql-indent-1\">Drive collaboration across Engineering, Marketing, Education, Developer Advocacy, and other teams Collaborate with our Internal Developer Relations, Technical Writers, and Customer Engagement teams, and work with Product Areas to bring experimentation advances and best practices to market</li><li class=\"ql-indent-1\">Demonstrated ability to deliver measurable growth business outcomes by improving quantifiable business metricsIdentify products, features, programs, and partnership opportunities&nbsp;</li><li class=\"ql-indent-1\">Validate and improve the user experience with adjacent products and integrations with cloud services&nbsp;</li><li class=\"ql-indent-1\">Programming experience preferred even as a hobbyist&nbsp;Experience working in the software technology industry across one or more areas - product management, software engineering, or UX</li><li class=\"ql-indent-1\">Strong technical writing and presentation skills&nbsp;</li><li class=\"ql-indent-1\">Demonstrated success in leading a product that targets developers</li><li class=\"ql-indent-1\">Self-starter who enjoys challenges across a broad range of disciplines</li><li class=\"ql-indent-1\">Familiarity with open source and cloud technologiesKnowledge in the domains of distributed systems, databases, operating systems, or other highly concurrent software is a big plus</li><li class=\"ql-indent-1\">5+ years of product management experience and 2+ years focused on UX, Developer experience or Growth</li></ul><p></p>",
    "apply": "https://jobs.lever.co/couchbase/501ba1ee-8613-47bb-bb75-0c23d6c4973d",
    "company": "/companies/couchbase",
    "cName": "Couchbase",
    "location": "US + Canada",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Product Manager - Digital",
    "description": "<p></p><p><strong>Job Description: </strong></p><p>At Ferguson, together we build better©. We strive to empower our associates to deliver beyond the high expectations of our customers every day. Ferguson is $23B value-added distributor in North America providing expertise, solutions, and products from infrastructure, plumbing and appliances to HVAC, fire, fabrication and more. We make our customers’ complex projects simple, successful, and sustainable.</p><p>We have an exciting opportunity for a remote Digital Product Manager to join the Digital eCommerce team within the Ferguson/Build.com Digital eCommerce organization. As a Digital Product Manager, you will focus on an area of the Ferguson digital experience helping to shape the product strategy, vision, and roadmap. Your role is positioned at the crossroads of technology and business across a particular area. You will be a digital partner, relentlessly building and advocating for the customer while simultaneously listening and negotiating with business stakeholders across the company. You will help craft a rich product portfolio, design a truly agile roadmap for execution of the Ferguson’s vision. &nbsp;</p><p>**This position is approved to sit 100% remote.**</p><p><strong><u>DUTIES AND RESPONSIBILITIES:&nbsp;</u></strong></p><ul><li>Define your product's vision and strategy.&nbsp;</li><li>Communicate clearly to business leaders on the changes, how they are affected, and how these changes are aligned with the company's overall goals. &nbsp;</li><li>Determine customers' needs and desires by specifying the research needed to obtain market information.&nbsp;</li><li>Assesses market competition by comparing the company's product to competitors' products. Communicate with third party vendors on strategy and solutions&nbsp;</li><li>Provides information for management by preparing short-term and long-term product impact/usage forecasts, special reports and analysis, answering questions and requests.&nbsp;</li><li>Use data to identify and prioritize opportunities to improve operational efficiency across the business.&nbsp;</li><li>Collaborate closely with the business, sales, marketing/content and merchandising teams to define, document and prioritize requirements, ensuring business and customer needs are met and exceeded.&nbsp;</li><li>Communicate roadmap priorities and strategic alignment to leadership and management&nbsp;</li><li>Manage and communicate a detailed roadmap for your product.&nbsp;</li><li>Work closely with Project Management to make sure product is on time and scoped properly.&nbsp;</li><li>Work closely with design and engineering leads in an agile development process. &nbsp;</li><li>Monitor daily, weekly, monthly health through analytics and user feedback sessions.&nbsp;</li><li>Improve the quality and efficiency of prioritization and execution of tasks.&nbsp;</li><li>Use qualitative and quantitative research to define OKR’s, measure and define KPI’s, and prioritize your roadmap&nbsp;</li><li>Lead, conduct, and participate in AB Testing &amp; User Testing solutions to define and measure outcomes&nbsp;</li><li>Create and maintain a work environment that promotes client service, teamwork, performance feedback, individual recognition, and mutual respect. &nbsp;</li><li>Mentor other Product Managers in Product Management best practices, organizational methods, and strategy alignment&nbsp;</li><li>Perform all other job related duties as requested&nbsp;</li></ul><p><strong><u>QUALIFICATIONS AND REQUIREMENTS:</u></strong></p><ul><li>3+ years Product Management experience, eCommerce experience preferred&nbsp;</li><li>Expert knowledge and experience with a Web Analytics platform – Google Analytics preferred&nbsp;</li><li>Expert understanding of Jira and Roadmapping tools&nbsp;</li><li>Customer centered approach to complex business/user problems &nbsp;</li><li>Strong performance mindset to drive outcomes and results &nbsp;&nbsp;</li><li>Self-motivated with the ability to inspire and motivate a cross-functional team&nbsp;</li><li>Wealth of experience gaining alignment and prioritization amongst internal stakeholders, external stakeholders, development teams, analysts and others&nbsp;</li><li>Expert in agile product development methodologies&nbsp;</li><li>Expert understanding of our customers, company, industry and technology stack. Relevant domain experience is a plus&nbsp;</li><li>Adaptable and proactively able to move with change while maintaining a positive attitude&nbsp;</li><li>Outcome-focused roadmap execution&nbsp;</li><li>Strong communication and leadership experience &nbsp;</li></ul><p><strong>Perks&nbsp;</strong></p><p>Ferguson is dedicated to providing meaningful benefits programs and products to our associates and their families—geared toward benefits, wellness, financial protection, and retirement savings. Ferguson offers a competitive benefits package that includes medical, dental, vision, retirement savings with company match, paid leave (vacation, sick, personal, and holiday), employee assistance programs, associate discounts, community involvement opportunities, and much more!&nbsp;</p><p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</p><p></p>",
    "apply": "https://ferguson.wd1.myworkdayjobs.com/en-US/Ferguson_Experienced/job/Remote/Product-Manager---Digital--REMOTE-_R-84614",
    "company": "/companies/ferguson",
    "cName": "Ferguson",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Lead, IT Product Owner",
    "description": "<p></p><p><span>Under Armour has one mission: to make you better. We have a commitment to innovation that lies at the heart of everything we do, not just for our athletes but also for our teammates. As a global organization, our teams around the world push boundaries and think beyond what is expected. Together our teammates are unified by our values and are grounded in our vision to inspire you with performance solutions you never knew you needed but can’t imagine living without.</span></p><p><strong>Position Summary</strong></p><p><span>The Lead, Marketing Creative &amp; Operations (Mktg Creative &amp; Ops) will lead implementation and support Marketing, Creative, and Marketing Ops technology products for UA.&nbsp;By partnering with the Marketing business users, the Lead, Mktg Creative &amp; Ops will set the priority for features and front-end experiences in systems like the Adobe Experience Manager, Dynamic Media/Scene 7, Workfront, Adobe Creative Suite, etc.&nbsp;The Lead, Mktg Creative &amp; Ops will manage current solutions, expand to new solutions and create an unrelenting focus on the content and customer experience journey.</span></p><p><span>The Lead, Mktg Creative &amp; Ops will also support products and/or functionality that are integrated into the creative and marketing digital platforms and ecosystems. The right candidate will partner with other product managers/owners, agile/waterfall partners (technical leads, scrum masters, business analysts, developers and UX designers) within teams to create or mature digital solutions and ensure these solutions exceed the growing expectations of our customers. This position will also provide a clear solution description and outline of product features for easy comprehension and consumption by the development team and business partners.</span></p><p><strong>Essential Duties &amp; Responsibilities</strong></p><p><strong>Design, Develop and Implement Solutions </strong></p><ul><li><span>Partner with domain architects to translate strategic target architecture to executable design to drive execution of projects.&nbsp;</span></li><li><span>Support active projects throughout the lifecycle, providing oversight and guidance on development activities to ensure consistency with original design as well as overall quality of deliverables</span></li><li><span>Investigates operational requirements and seeks effective business solutions through the design and implementation of technology solutions and/or business process improvements</span></li><li><span>Proactively identify opportunities to improve existing functionality.&nbsp;Lead design process, and then either drive delivery process directly oversee internal or external teams to drive completion of project</span></li></ul><p><strong>Research </strong></p><ul><li><span>Establish and maintain Business Process Expertise for respective processes and functional area</span></li><li><span>Uses available resources to gain an up-to-date knowledge of relevant IT field</span></li><li><span>Builds network of industry colleagues to stay current on trends</span></li><li><span>Identifies new and emerging technologies and products, assesses their relevance and potential value to the organization, contributes to briefings of staff and management</span></li></ul><p><strong>Analytics </strong></p><ul><li><span>Report on velocity, value and status of DAM Assets</span></li><li><span>Report on asset usage, asset engagement</span></li><li><span>Hold feedback sessions and use deep analytics to reprioritize work efforts</span></li><li><span>Justify the KPI’s and gain business alignment for customer facing platform work</span></li></ul><p><strong>Business Case Development &amp; Project Scoping </strong></p><ul><li><span>Support development of project business cases by evaluating business requirements and using deep knowledge of business processes and solutions capabilities in area determine high level solution and level of effort estimates</span></li><li><span>Support prioritization process for smaller, non-project prioritization process by reviewing requests and interpreting requirements to drive high level solutioning and level of effort collection</span></li><li><span>Provide advanced production support in situations requiring escalation</span></li></ul><p><strong>Qualifications (Knowledge, Skills &amp; Abilities)</strong></p><ul><li><span>2-4 years’ experience hands on working with Adobe Experience Manager (Cloud Preferred)&nbsp;</span></li><li><span>Strong knowledge of all phases of digital development from concept to information architecture to design, development, and QA</span></li><li><span>Proven track record of managing cross platform digital projects with large groups of distributed stakeholders and project team members</span></li><li><span>Strong knowledge of all phases of digital development from concept to information architecture to design, development, and QA&nbsp;&nbsp;&nbsp;</span></li><li><span>Experience with DAM, PIM and workflow platforms, metadata modeling and workflow automation</span></li><li><span>Working understanding of content creation, business process, and system process within global team is preferred</span></li><li><span>Experience working on content creation and localization tools</span></li><li><span>Ability to work in a fast-paced, dynamic environment and committed to meeting deadlines</span></li><li><span>Must be a self-starter, proactive, and possess the ability to work with minimal supervision&nbsp;</span></li><li><span>Knowledge of ITIL Service Operations concepts</span></li><li><span>Strong customer focus</span></li><li><span>Excellent problem-solving skills – able to identify, analyze and propose solutions to various consumer, technical and business issues</span></li></ul><p><strong>Education And / Or Experience</strong></p><ul><li><span>Bachelor’s Degree in Information Technology, Information Systems, or a relevant business area such as Digital Marketing preferred</span></li><li><span>5+ years of IT experience</span></li><li><span>2+ years of direct support and design experience with Adobe Experience Manager or other marketing technologies</span></li></ul><p><strong>Other Requirements</strong></p><ul><li><span>Location: Remote</span></li><li><span>Return To Work Designation: Remote</span></li><li><span>Travel:&nbsp;&lt; 5% of the year&nbsp;</span></li><li><span>Licenses/Certifications: Adobe Certified Associate &amp; Professional Certifications are a plus</span></li></ul><p><strong>Relocation</strong></p><ul><li><span>No Relocation Provided</span></li></ul><p><strong><em>At Under Armour, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law.&nbsp;Under Armour believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.&nbsp;</em></strong></p><p><strong>Learn more about Under Armour’s COVID-19 response and Teammate vaccination policies</strong><span>&nbsp;</span><a href=\"https://about.underarmour.com/news/2021/08/under-armour-delays-return-campus-early-2022\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(73, 73, 73);\"><strong>here.</strong></a></p><p></p>",
    "apply": "https://careers.underarmour.com/job/Remote-Lead%2C-IT-Product-Owner-OR-97458/870194200/",
    "company": "/companies/under-armour",
    "cName": "Under Armour",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Customer Success Manager I",
    "description": "<p></p><p><strong>Job Details</strong></p><p><strong>Description</strong></p><p>The Customer Success Manager, CSM, will be responsible for managing and cultivating customer relationships for their assigned account base. CSM will assist with increasing the overall adoption and utilization of subscribed Vendormate solutions and services. Will add value and ensure customer retention as customers’ primary contact for developing their credentialing program. Will have a passion for customer service and performance excellence.</p><p><strong>Principal Duties and Responsibilities:</strong></p><ul><li>Cultivates and maintains customer relationships within assigned account base.&nbsp;</li><li>Identify, create, and oversee compliance campaigns to drive compliance rates.</li><li>Proactively analyze vendor data to determine action items to drive compliance and adoption.&nbsp;</li><li>Utilize SFDC for efficient customer communications and documenting account progress.</li><li>Utilize internal platforms to document customer specifics and project work.&nbsp;</li><li>Manage compliance of customers’ company level credentialing requirements.</li><li>Develop deep understanding of credentialing among all VCOs and effectively communicate best practices with customers.&nbsp;&nbsp;</li><li>Monitor new customer go lives and carry momentum. Act as liaison for process communications to analyst team to increase efficiencies with cases and with credentialing managed services customer processes.</li><li>Actively manage customer’s roster: roster verification and roster clean-ups.</li><li>Host webinars and trainings for credentialing managed services customers and teams.</li><li>Attend customer conferences to develop relationships, enhance processes, and provide added value.</li><li>Work closely with renewals specialist to own initial conversation and oversee process.</li><li>Other projects as assigned.&nbsp;</li></ul><p><strong>Required Skills:</strong></p><ul><li>Strong leadership, problem-solving and customer service skills.</li><li>Strong written, verbal, and presentation skills.&nbsp;</li><li>Analytical and detail-oriented with strong project management skills.</li><li>Able to work effectively with cross-functional teams and personnel at varying levels within GHX and customer organizations.</li><li>Ability to prioritize and manage multiple deadlines.</li><li>Ability to travel domestically up to 25% of the time.</li></ul><p><strong>Minimal Qualifications:</strong></p><ul><li>Prior experience with Salesforce or another CRM preferred.</li><li>Prior experience with sales and lead generation preferred.</li><li>Basic understanding of Microsoft Office suite, particularly PowerPoint, Word, Excel, and Outlook.</li><li>Bachelor’s degree in Business or a related discipline, or a combination of education and related experience is preferred.</li><li>Experience in healthcare vendor credentialing preferred.</li></ul><p>Estimated salary range: $54,800-65,000&nbsp;</p><p>The base salary range represents the anticipated low and high end of the GHX’s salary range for this position. Actual salaries will vary and will be based on various factors, such as candidate’s qualifications, skills, competencies and proficiency for the role. The base salary is one component of GHX’s total compensation package for employees. Other rewards and benefits include: health, vision, and dental insurance, accident and life insurance, 401k matching, paid-time off, and education reimbursement, to name a few. To view more details of our benefits, visit us here: https://www.ghx.com/about/careers/</p><p><strong>GHX: It's the way you do business in healthcare</strong></p><p>Global Healthcare Exchange (GHX) enables better patient care and billions in savings for the healthcare community by maximizing automation, efficiency and accuracy of business processes.</p><p>GHX is a healthcare business and data automation company, empowering healthcare organizations to enable better patient care and maximize industry savings using our world class cloud-based supply chain technology exchange platform, solutions, analytics and services. We bring together healthcare providers and manufacturers and distributors in North America and Europe - who rely on smart, secure healthcare-focused technology and comprehensive data to automate their business processes and make more informed decisions.</p><p>It is our passion and vision for a more operationally efficient healthcare supply chain, helping organizations reduce - not shift - the cost of doing business, paving the way to delivering patient care more effectively. Together we take more than a billion dollars out of the cost of delivering healthcare every year. GHX is privately owned, operates in the United States, Canada and Europe, and employs more than 800 people worldwide. Our corporate headquarters is in Louisville, Colorado, just outside of Denver, with additional offices in Europe, Chicago, Illinois, and Omaha, Nebraska.</p><p><em>Global Healthcare Exchange, LLC and its North American subsidiaries (collectively, “GHX”) provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, national origin, sex, sexual orientation, gender identity, religion, age, genetic information, disability, veteran status or any other status protected by applicable law. All qualified applicants will receive consideration for employment without regard to any status protected by applicable law. This EEO policy applies to all terms, conditions, and privileges of employment, including hiring, training and development, promotion, transfer, compensation, benefits, educational assistance, termination, layoffs, social and recreational programs, and retirement.&nbsp;</em></p><p><em>GHX believes that employees should be provided with a working environment which enables each employee to be productive and to work to the best of his or her ability.&nbsp;We do not condone or tolerate an atmosphere of intimidation or harassment based on race, color, national origin, sex, sexual orientation, gender identity, religion, age, genetic information, disability, veteran status or any other status protected by applicable law. GHX expects and requires the&nbsp;cooperation of all employees in maintaining a discrimination and harassment-free atmosphere. Improper interference with the ability of GHX’s employees to perform their expected job duties is&nbsp;absolutely not&nbsp;tolerated.&nbsp;</em></p><p></p>",
    "apply": "https://recruiting.ultipro.com/GLO1005/JobBoard/3f12fca3-8279-522e-91f8-6bb88fd3387c/OpportunityDetail",
    "company": "/companies/ghx",
    "cName": "GHX",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Advocacy Program Mgr",
    "description": "<p></p><p><strong>Overview</strong></p><p><span>The Customer Advocacy Program Manager 2 is responsible for managing and supporting the company's customers in their activities related to the customer success programs. This will include implementing and supporting key programs and customer engagement tools that will continue to improve the company's level of service, organizational efficiency and increase customer engagement.</span></p><p><strong>What you will be doing</strong></p><ul><li>Identify and recruit ideal customer candidates for participation in programs, partnering with other internal departments.</li><li>Manage the full program life-cycle for each customer, from application submission through completion of requested activity.</li><li>Develop program templates, agenda framework and other collateral to support both customers and internal stakeholders.</li><li>Analyze, measure and track success metrics to determine effectiveness of each program.</li><li>Update CRM and other applications with pertinent customer data as collected through program activities (registration, advocacy activities, completed engagement activities, executive touchpoints).</li><li>Inform internal stakeholders on customer activity in the programs.</li><li>Ensure the voice of the customer is heard and needs are being considered throughout the process.</li><li>Regularly receive feedback from key program stakeholders and communicate and follow up to appropriate parties to ensure continuous improvement of the process and deliverables.</li><li>Provide regular process improvement change suggestions.</li><li>Administer related customer engagement tools and manage relationship with technology vendor.</li><li>Execute customer loyalty events that align with the supported Customer Success programs.</li><li>Comply with all corporate and departmental privacy and data security policies and practices, including but not limited to, Hyland’s Information Systems Security Policy</li></ul><p><strong>What will make you successful</strong></p><ul><li>Bachelor’s degree or equivalent experience</li><li>Experience providing customer service/support</li><li>Experience managing a key customer program or multiple programs at one time.&nbsp;</li><li>Microsoft Windows and Office proficient</li><li>Good oral and written communications skills that demonstrate a professional demeanor and the ability to interact with others, such as customers and executives, with discretion and tact</li><li>Good organizational, multi-tasking, and time management skills</li><li>Good collaboration skills, applied successfully within team as well as with other areas</li><li>Good facilitation and project management skill</li><li>Good data gathering, interviewing, and analytical/problem solving skills</li><li>Good critical thinking and problem solving skills</li><li>Self-motivated with the ability to manage projects to completion with oversight</li><li>Able to thrive in a fast paced, deadline driven environment</li><li>Working knowledge of how the company operates across different business units and its partners</li><li>Up to 20% travel time required</li><li><strong>Based on Colorado law, the following details are for Colorado individuals only: Colorado base salary range: $52,000 - $65,000 and eligible for bonus and benefits.</strong></li></ul><p><strong>What you can expect next</strong></p><ul><li>Hyland Recruiters thoroughly review every application and will contact you within 1 to 2 weeks regarding next steps. Be sure to add Hyland to your contacts list and check your spam folder so you never miss a message from us!</li><li>Any follow up questions? Email your Recruiter directly at&nbsp;<a href=\"mailto:Careers@Hyland.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">Careers@Hyland.com</a>.</li></ul><p><strong>Benefits</strong></p><p>401(k) Retirement Savings. Flexible Schedule. Paid Time Off. Medical, Dental, Vision. Volunteer Paid Time Off. Wellness Reimbursement. Paid Parental Leave. Sabbatical Program. Hyland House Program.</p><p>Find out more by going to&nbsp;<a href=\"https://www.hyland.com/en/careers/life-at-hyland\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">https://www.hyland.com/en/careers/life-at-hyland</a>.</p><p><strong>Welcome to&nbsp;</strong><a href=\"https://www.instagram.com/hylandgram\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\"><strong>#HylandLife</strong></a></p><p>Since 1991, it has been Hyland’s mission to help our employees, customers and partners exceed their potential with our industry-leading&nbsp;<a href=\"https://www.hyland.com/en/platform\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">content services platform</a>. Our employees exude a contagious energy and are passionate about what they do – whether it’s helping customers succeed, raising up their fellow Hylanders, or engaging in the communities where they live and work.</p><p>The #HylandLife hashtag encompasses our employee-centric culture. Our employees live our culture day in and day out by bringing their best self to work. Hyland supports them to do just that through career development resources, wellbeing programs and innovation practices. We thrive on diverse viewpoints and new ideas and believe that a positive, inclusive workplace is imperative to sustainable success.</p><p>As we’ve grown to a company of nearly 4,000 strong, we have the opportunity to&nbsp;<a href=\"https://www.hyland.com/en/company/corporate-responsibility\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 88, 110);\">make a significant impact on our communities</a>. We strongly support employee initiatives and align our giving campaigns and programs to organizations that are important to them.</p><p></p>",
    "apply": "https://careers-hyland.icims.com/jobs/9379/customer-advocacy-program-manager/job",
    "company": "/companies/hyland",
    "cName": "Hyland",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Success Manager",
    "description": "<p></p><p><strong>About Ease:</strong></p><p>Ease is the #1 rated benefits administration and HR software for businesses with 2–250 employees, powered by insurance brokers. 70,000+ employers trust Ease’s innovative SaaS service model to set up and manage benefits, onboard hires, stay compliant and offer their employees one destination for all their human resources information. Headquartered in San Francisco with offices in New York, Las Vegas, and Omaha, Ease was recently ranked number 57 in Forbes 2020 list of the top 500 startup employers in America.</p><p><a href=\"https://hr.ease.com/employervideo.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">Ease video</a></p><p>As a Customer Success Manager you will champion customer outcomes through ongoing collection and analysis of data and feedback and turn this into onboarding and retention strategies. You will also help provide feedback for our product roadmap on your book of business. You will be involved in project management, account management, educating the customers, demonstrating value to the customers, strategizing towards customer growth, renewal support of the customers, and more.&nbsp;</p><p><strong>Responsibilities:</strong></p><ul><li class=\"ql-indent-1\">Drive retention and growth among our customers by understanding their business needs and helping them succeed.</li><li class=\"ql-indent-1\">Maintain a cadence of communicating with customers about their adoption trends, sentiment, and mining opportunities for deeper engagement.</li><li class=\"ql-indent-1\">Carry a quarterly revenue quota to expand carrier connection footprints</li><li class=\"ql-indent-1\">Responsible for account level expansion initiatives&nbsp;</li><li class=\"ql-indent-1\">Identify opportunities for key customers to act as Ease advocates (e.g. testimonials, case studies).</li><li class=\"ql-indent-1\">Collect, analyze, and share customer outcomes with data analytics around analyze customer health metrics, NPS, other feedback.</li><li class=\"ql-indent-1\">Identify and represent the voice of the customer through feedback and internal collaboration on product development, marketing, and sales processes.</li><li class=\"ql-indent-1\">Collaborate on and support renewals and expansion opportunities.</li><li class=\"ql-indent-1\">Serve as the primary contact for the onboarding of new customers, the training of platform end users, and driving customers to additional product adoption.</li><li class=\"ql-indent-1\">Provide insights to customers to ensure that they get the most out of the platform with the aim of helping grow our customer base.</li><li class=\"ql-indent-1\">Being the main point of contact between the company and your portfolio of named accounts.</li></ul><p><strong>Experience:</strong></p><ul><li class=\"ql-indent-1\">2-5+ years in a Customer Success, Relationship Management, Account Management, or similar role.</li><li class=\"ql-indent-1\">Experience working with SaaS customers.</li><li class=\"ql-indent-1\">Experience with SaaS products and customer success processes, preferred.</li><li class=\"ql-indent-1\">Exceptional communication skills, highly organized, collaborative and detail oriented.</li><li class=\"ql-indent-1\">Experience building and maintaining relationships, while working to mitigate churn and drive engagement and renewals.</li><li class=\"ql-indent-1\">Empathetic, positive attitude with a desire to help our customers reach their goals.</li><li class=\"ql-indent-1\">Experience working with a Customer Success platform.</li><li class=\"ql-indent-1\">Experience with insurtech platforms or benefits administration is a plus&nbsp;</li></ul><p><strong>Skills and Qualifications:</strong></p><ul><li class=\"ql-indent-1\">Educated to degree level preferred but not essential</li><li class=\"ql-indent-1\">Experience working with, and managing, stakeholders and customers</li><li class=\"ql-indent-1\">A high level of accuracy and attention to detail is required</li><li class=\"ql-indent-1\">Excellent communication and interpersonal skills</li><li class=\"ql-indent-1\">Flexible approach, able to operate effectively with uncertainty and change</li><li class=\"ql-indent-1\">Driven, self-motivated, enthusiastic and with a “can do” attitude</li></ul><p>Must have proof of legal authority to work in the U.S.</p><p>Ease is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, or any other status protected by law.&nbsp;</p><p></p>",
    "apply": "https://jobs.lever.co/ease/b569725b-517f-451e-8bbd-de644b049f88",
    "company": "/companies/ease",
    "cName": "Ease",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Success Associate",
    "description": "<p></p><p><em>Over 100,000 businesses and millions of people use 1Password to protect their most important information, and we believe those people – and the companies they work for – shouldn’t have to choose between security and productivity. We see security as a human challenge, rather than a technological one. It’s hard work, but our mission has always been to ease the tension between security and convenience and help people navigate the digital world without fear or friction. Human-centric security is part of our DNA, but human-centricity is also the backbone of our culture. We encourage big ideas and new ways of working that help us to make the online world a safer place for everyone.</em></p><p>Our Customer Success team works proactively and prescriptively to help customers get the most value from their investment in security and privacy by establishing long term relationships and acting as trusted advisors to our customers.</p><p>The Customer Success Associate guides Teams and Business customers through established best practices by demonstrating an understanding of their structure and needs while guiding them throughout their 1Password lifecycle working closely with Onboarding and Account management. This individual acts as the customer champion and advocate, helping increase awareness of customer needs and priorities. We are currently looking for 2 Customer Success Associates, one to join our SMB team - working with some of our smaller customers, and one to work with our Mid-Market team.</p><p>This is a Remote opportunity within Canada, the US, and the UK.</p><p><strong>What we’re looking for:</strong></p><ul><li class=\"ql-indent-1\">Strong communication skills over email, the phone, or even a video call. Presenting and speaking to new people each day excites you. Your style is concise yet empathetic – with a balance of teaching and listening/learning yourself as well as knowing when to pivot in a conversation.</li><li class=\"ql-indent-1\">Experience with and passion for helping people or businesses use software to be more productive and efficient. You’re passionate about discovering what a team needs in their workplace, and you ask strong open-ended questions that help you learn more about them. You enjoy translating technical terms for customers who find technology confusing or intimidating.</li><li class=\"ql-indent-1\">CSA’s proactively guide customers through their 1Password lifecycle through email, webinars, and customized sessions; making prescriptive recommendations and helping customers achieve their desired outcomes and ensure high adoption rates across their book of business.&nbsp;</li><li class=\"ql-indent-1\">Follows defined outreach and follow-up communication processes managing data and activity of customers in tandem with the Onboarding and Account management teams; and synthesizing and logging findings from customer discussions such as feature requests, customer details, and general feedback/metrics accurately.</li><li class=\"ql-indent-1\">Hands off cross-sell/upsell opportunities to Account managers and engages enthusiastic customers in advocacy initiatives such as 1Password Unlocked, case studies and product discussions.&nbsp;</li><li class=\"ql-indent-1\">Contributes to the success of the Customer Success team in an ongoing capacity through team goals and metrics (including operational, NPS, revenue, and performance metrics).</li><li class=\"ql-indent-1\">Optional: You have personal experience with 1Password or another password manager. While not required, it’ll help you quickly have confidence in this role.</li></ul><p><strong>What you can expect in month 1:</strong></p><ul><li class=\"ql-indent-1\">Get to know the product, our culture, the Customer Success processes, and the people you'll be working with.</li><li class=\"ql-indent-1\">Learn Salesforce, what and how we track, and the benefits of keeping customer information within it updated.</li><li class=\"ql-indent-1\">By the end of the first month, you’ll be able to guide a small sized customer through an intro discussion in our Customer Success process.</li></ul><p><strong>What you can expect by month 3:</strong></p><ul><li class=\"ql-indent-1\">Can guide a small, or mid-market customer through multiple levels of the defined Customer Success process, using your product expertise to educate, provide feedback, and discover opportunities to upsell or expand, while driving value for the customer.</li><li class=\"ql-indent-1\">Proactively report on customers’ needs and valuable feedback so the marketing and product teams can accurately reflect messaging and prioritize the right projects to improve the product.</li><li class=\"ql-indent-1\">Build and maintain a healthy account book of customers for whom you are the Success Manager.</li></ul><p><strong>What you can expect by month 6:</strong></p><ul><li class=\"ql-indent-1\">Have developed your best personal approach and rhythm, analyzed the Customer Success processes to maximize your customer engagement, and begun collaborating with cross-functional peers in internal teams.</li><li class=\"ql-indent-1\">Have a steady book of customers with whom you’ve learned needs, built rapport, and put Success plans in place influencing the broader Customer Success metrics and processes.</li></ul><p><strong>What we offer:</strong></p><p>We believe in working hard, and resting hard. We’re always looking for new ways to support our team members, but here’s a glance at what we currently offer:</p><p>Health and wellbeing</p><p>&gt;&nbsp;👶&nbsp;Maternity and parental leave top up programs</p><p>&gt;&nbsp;👟&nbsp;Wellness spending account</p><p>&gt;&nbsp;🏝&nbsp;Generous PTO policy&nbsp;</p><p>&gt; 💖 Company-wide wellness days off scheduled throughout the year&nbsp;</p><p>&gt;&nbsp;🧠&nbsp;Complimentary Headspace membership</p><p>&gt;&nbsp;🩺&nbsp;Comprehensive health coverage</p><p>&nbsp;Growth and future&nbsp;</p><p>&gt;&nbsp;📈&nbsp;Employee stock option program for all full time employees&nbsp;</p><p>&gt;&nbsp;💸&nbsp;Retirement matching program</p><p>&gt;&nbsp;💡&nbsp;Training budget, 1Password University access, and learning sessions&nbsp;</p><p>&gt; 🔑 Free 1Password account (and friends and family discount!)&nbsp;</p><p>&gt;&nbsp;🏦&nbsp;A You Need A Budget membership</p><p>Flexibility and community</p><p>&gt;&nbsp;🤝&nbsp;Paid volunteer days&nbsp;</p><p>&gt;&nbsp;🌎&nbsp;Employee-led DEI&amp;B programs and ERGs</p><p>&gt;&nbsp;🏠&nbsp;Fully remote environment</p><p>&gt;&nbsp;🏆&nbsp;Peer-to-peer recognition through Bonusly</p><p><strong>You belong here.</strong></p><p><em>1Password is proud to be an equal opportunity employer. We are committed to fostering an inclusive, diverse and equitable workplace that is built on trust, support and respect. We welcome all individuals and do not discriminate on the the basis of gender identity and expression, race, ethnicity, disability, sexual orientation, colour, religion, creed, gender, national origin, age, marital status, pregnancy, sex, citizenship, education, languages spoken or veteran status. Be yourself, find your people and share the things you love.</em></p><p><em>Accommodation is available upon request at any point during our recruitment process. If you require an accommodation, please speak to your talent acquisition partner or email us at nextbit@agilebits.com and we’ll work to meet your needs.</em></p><p></p>",
    "apply": "https://jobs.lever.co/1password/2844fb0a-68b9-4832-bd07-ae95bef10820",
    "company": "/companies/1password",
    "cName": "1Password",
    "location": "US + Canada",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Customer Success Manager I",
    "description": "<p></p><p><strong>Overview</strong></p><p>At Khoros, our passion is to help the world’s best brands create customers for life. We build products we’re proud of, and we’re passionate about customer success. As part of the Vista Equity family, you’ll receive best-in-class development opportunities and the ability to work with customers like Samsung, HP, Sony, and Visa.</p><p>We are looking for exceptional Customer Success Advocates and Managers to play a key role in ensuring the continued success of our rapidly growing customer base. In this role, you will be the key point of contact for our customers, developing and sustaining strategic relationships with a portfolio of top-tier enterprise customers, and responsible for driving success and adoption throughout all aspects of the customer’s journey.&nbsp;You’ll partner with our sales team around account strategies to drive towards the growth and retention of our customers.</p><p>Our Customer Success team is founded on the core tenet that customers who are successful will sustain and expand their business with us over time.&nbsp;The key to achieving this success is effective adoption of our products across a customer’s organization, technical success, and aptitude, high impact results that align to a customer’s business objectives, a strong support system, and continuous strategic and relationship alignment.</p><p>From messaging, chat, social media, reviews, and SMS, to owned and channel-based digital communities, we help brands harness the power of human connection across every digital interaction to stay all-ways connected - creating deep relationships and fostering brand loyalty and advocacy.</p><p>The best Fortune 1000 companies in the world trust Khoros to help them build closer, more personalized, and trusted relationships with their customers. Some of our clients: HP, Samsung, and LiveNation (to name a few). We are a Vista Equity Partners portfolio company, growing fast and adding new products to our platform organically and inorganically.</p><p><strong>Responsibilities</strong></p><p>Effective adoption:</p><ul><li>Understand the customers’ journey and maturity model for each solution and in the role of social media management</li><li>Build shared Success Plans and provide valuable insights, thoughtful recommendations and product expertise to our customers on a regular basis</li><li>Empower our customers to be internal ambassadors for our products and services and drive growth across the organization</li></ul><p>Business value realization:</p><ul><li>Understand and articulate the customer's executive priorities and defined initiatives where our products and services can have an impact</li><li>Quantify and describe the business value created by the customer's use of our products, at present and at full potential</li><li>Work with customers to identify specific metrics of success; track and communicate progress on an ongoing basis and during key moments in time (i.e. Business Reviews and strategic conversations)</li><li>Exercise strategic and creative problem solving to provide best practices, innovative solutions and drive end-user adoption</li><li>Build customer advocacy by providing our customers with a platform for showcasing their success (i.e. Webinar participation, Event speaking opportunities, case study participation, etc.)&nbsp;</li><li>Drive customer relationships that build advocacy in the form of indirect revenue growth (i.e., sales references, industry analyst references, software reviews, NPS, etc.)</li></ul><p>Operational excellence:</p><ul><li>Work as a facilitator, strategist, and guide to our products and services for an assigned portfolio of enterprise customers</li><li>Serve as the main point of contact, leading regular status calls, ongoing communications, and strategic discussions tailored to an executive audience</li><li>Lead internal and external account planning; motivated by seeing customers grow</li><li>Present new opportunities, services opportunities, and high-level roadmap vision to customers</li><li>Leverage technology and internal tools to identify potential risks and address escalations and issues as needed</li><li>Partner with internal teams to share customer feedback and ensure delivery of all commitments and projects</li></ul><p>If you feel like you don’t meet all of the requirements for this role, we encourage you to apply anyways. We know the confidence gap and imposter syndrome gets in the way sometimes, and don’t want it to get in the way of finding awesome candidates!</p><p><strong>Qualifications</strong></p><p><strong>Requirements:</strong></p><ul><li>3+ years account management experience in a customer-facing role; strategy development and SaaS experience preferred</li><li>Passion and aptitude for technology and business transformation</li><li>Excellent presentation, written and verbal skills</li><li>Strong organizational, time-management, and prioritization skills</li><li>Keen analytical skills and ability to gauge and anticipate trends using data</li><li>Thrives in a fast-paced startup environment</li><li>Positive attitude and strong work ethic</li><li>Aptitude for developing and nurturing positive relationships</li><li>Up to 25% travel, once travel opens.</li></ul><p><strong>Preferences:</strong></p><ul><li>Demonstrable knowledge of social media platforms, community, or digital contact centers in a business context</li><li>Creative self-starter; originates and drives constant improvement</li><li>BA/BS degree preferred</li></ul><p><strong>The role is budgeted between $60k - $70K base salary range with a 20% Bonus.&nbsp;</strong><span>Any offered salary is determined based on internal equity, internal salary ranges, market data/ranges, applicant’s skills and prior relevant experience, certain degrees and certifications. Your actual pay will be based on your skills and experience — talk with your TA to learn more.</span></p><p></p>",
    "apply": "https://careers-khoros.icims.com/jobs/2572/job",
    "company": "/companies/khoros",
    "cName": "Khoros",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "VP Legal, Product Counsel",
    "description": "<p></p><p><strong>Company Description</strong></p><p>Medable's mission is to get effective therapies to patients faster. We provide an end-to-end, cloud-based platform with a flexible suite of tools that allows patients, healthcare providers, clinical research organizations and pharmaceutical sponsors to work together as a team in clinical trials. Our solutions enable more efficient clinical research, more effective healthcare delivery, and more accurate precision and predictive medicine. Our target audiences are patients, providers, principal investigators, and innovators who work in healthcare and life sciences.</p><p>Our vision is to accelerate the path to human discovery and medical cures. We are passionate about driving innovation and empowering consumers. We are proactive, collaborative, self-motivated learners, committed, bold and tenacious. We are dedicated to making this world a healthier place.</p><p><strong>Job Description</strong></p><ul><li>Product Counsel that requires Regulatory expertise</li><li>Quickly grasps key drivers of the business and industry and becomes immersed in the most important business issues facing the company</li><li>Provides legal advice on the design and configuration of existing and emerging products, features, devices, and solutions, particularly where technology and innovation outpace regulation</li><li>Advises R&amp;D, quality, delivery, sales, marketing, and other key business stakeholders across the organization&nbsp;</li><li>Works cross-functionally to identify, analyze, and mitigate risks (while maximizing commercial opportunities) on complex issues with multiple dependencies and stakeholders</li><li>Partners with internal clients to create proactive strategies designed to avoid or minimize exposure</li><li>Effectively communicates risks and consequences, balancing potentially conflicting goals, to collaborate with the business on viable alternatives</li><li>Stays current with legal developments, best practices, and benchmarks in the noted areas of law; assists internal clients in implementing policies and procedures in response&nbsp;</li><li>Hires, retains, and mentors extraordinary attorneys to build an extraordinary team</li><li>Other duties as assigned</li></ul><p><strong>Qualifications</strong></p><ul><li>15+ years of working experience in product counseling and technology transactions or a combination of education and experience, both in-house and major law firm experience preferred</li><li>Solid working knowledge of corporate law, regulations, and best practices</li><li>Demonstrated successful leadership and collaboration with colleagues; ability to develop business solutions with effective presentation of risks and anticipated outcomes</li><li>Currently admitted in good standing to practice law in at least one state in the United States or international equivalent</li><li>Experience in working successfully in a highly results-oriented and performance-driven environment with a focus on excellence</li><li>Demonstrates a strategic, innovative, creative, and inquisitive frame of mind and a service and leadership mentality, with strong business acumen and judgment</li><li>Passionate about product, ethics, and winning</li><li>Takes initiative and ownership, and operates with a sense of urgency, decisiveness, and responsiveness</li><li>Makes nuanced recommendations and data-driven business decisions</li><li>Strong and effective verbal and written communication, with skill and empathy, to a variety of audiences</li><li>Marshalls the appropriate level and mix of resources as required by circumstances</li><li>Demonstrates an exceptional focus on details, analysis, and results.&nbsp;Delivers the technical, planning, and project management skills to ensure the highest quality execution</li><li>Holds themselves to the highest standards of accountability</li></ul><p>#LI-MQ1</p><p>#LI-REMOTE</p><p><strong>Additional Information</strong></p><ul><li>Juris Doctor (or international equivalent) from a top law school.</li><li>Travel as required</li></ul><p>U.S. employees and contractors, and International workers with travel to the U.S. must have a willingness and ability to provide proof of completed COVID-19&nbsp;vaccination&nbsp;prior to start date. All religious, medical, or other legally recognized exemptions regarding&nbsp;vaccination&nbsp;status will be considered.</p><p>Medable, Inc&nbsp;provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p><p>U.S. employees and contractors, and International workers with travel to the U.S. must have a willingness and ability to provide proof of completed COVID-19 vaccination prior to start date. All strongly held beliefs, religious, medical, and&nbsp;other legally recognized exemptions regarding vaccination status will be considered.</p><p></p>",
    "apply": "https://jobs.smartrecruiters.com/Medable/743999817576687-vp-legal-product-counsel-remote",
    "company": "/companies/medable",
    "cName": "Medable",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Legal Counsel, Commercial-Solutions",
    "description": "<p></p><h5><strong>Job Summary</strong></h5><p><strong>The Legal Counsel will be responsible for providing legal advice and support to the Zimmer Biomet Capital Solutions team, with primary responsibility for contract drafting and negotiation.</strong></p><h5><strong>Principal Duties and Responsibilities</strong></h5><ul><li>Draft, review and negotiate the terms of various commercial agreements, but not limited to, purchase and sale agreements, capital placements, services agreements, lease agreements, software licenses and rebates.&nbsp;</li><li>Review, update and file template and executed agreements on an ongoing basis.</li><li>Partner with colleagues to ensure agreements are consistent with stakeholder objectives, applicable legal requirements, and internal corporate policies.</li><li>Advise on business law issues, including contract interpretation and requirements.</li><li>Coordinate with Legal and Capital Solutions team members regarding processes governing the intake, review, and approval of contracts and other legal requests.</li><li>Provide pragmatic day-to-day and strategic advice to minimize legal risks while facilitating and advancing business goals and initiatives.</li><li>Instruct, manage and review all work product of external counsel in an efficient and cost-effective manner.</li><li>Carry out other duties, projects, or activities as specified by the Associate General Counsel.</li><li>Role will be fully remote</li></ul><h5><strong>Expected Areas of Competence</strong></h5><ul><li>Well organized, detail-oriented, and accountable with a high degree of professionalism, diplomacy, discretion and judgment.</li><li>Highly motivated, self-starter and quick learner with demonstrated ability to deliver quality results within time constraints.</li><li>Ability to work in a high-volume, fast-paced, and customer-facing environment.</li><li>Understanding of the demands of the monthly/quarterly/annual sales cycles.</li><li>Roll-up your sleeves, can-do attitude to tackle projects large and small with a low-ego, service-oriented approach to collaborating across the organization.</li><li>Existing understanding of, or ability to quickly learn, laws impacting medical device manufacturers, public policy and healthcare industry developments, as well as the legal implications of business decisions. Areas of desired experience include commercial contracts, software licensing, general healthcare law (including Anti-Kickback Statute, Stark, HIPAA and related privacy laws), telehealth, government regulations, licensing, and/or compliance.</li><li>Existing understanding of, or ability to quickly learn the company’s business and products, including capital sales and software solutions.</li><li>Demonstrated ability to address commercial, international and business transactional matters, within the life sciences, medical device or related industries.</li><li>Commitment to developing professional relationships with clients in which corporate goals and priorities are maintained and practical solutions are offered without compromising legal integrity.</li><li>Demonstrated ability to work both independently and cooperatively with colleagues to leverage skills and knowledge within the legal division. Confident yet coachable and receptive to constructive feedback. Understands when to escalate issues to management for awareness or decision.</li><li>Exceptional verbal and written communication and presentation skills which highlight an ability to concisely and effectively reach a diverse audience at multiple levels within the Company and through various platforms (i.e., teleconferences, face-to-face meetings, presentations, reports and correspondence).</li><li>Appropriate competency in Microsoft Office suite, e-signature software, Adobe Acrobat, and other standard workplace hardware and software applications.</li><li>Must be able to handle multiple projects simultaneously under tight timelines.</li><li>Must be able to accommodate Eastern Time Zone business hours</li></ul><h5><strong>Education/Experience Requirements</strong></h5><ul><li>Juris Doctorate (JD) or LLM from an American Bar Association accredited law school</li><li>A minimum of 3 years of experience providing legal advice on a broad range of business issues, including 1+ years at law firm. Prior in-house experience preferred.</li><li>Experience in medical device regulations and compliance issues strongly preferred</li></ul><h5><strong>Travel Requirements</strong></h5><p>Approximately 10-20%</p><h5><strong>Additional Information</strong></h5><p>EOE/M/F/Vet/Disability</p><p>At Zimmer Biomet, we believe in The Power of Us, which means that we are stronger together. We are committed to creating an environment where every team member feels included, respected, empowered, and celebrated.</p><p></p>",
    "apply": "https://global3.recruitmentplatform.com/syndicated/lay/jsoutputinitrapido.cfm",
    "company": "/companies/zimmer-biomet",
    "cName": "Zimmer Biomet",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Sr. Counsel, Employment Law",
    "description": "<p></p><p>Under Armour has one mission: to make you better. We have a commitment to innovation that lies at the heart of everything we do, not just for our athletes but also for our teammates. As a global organization, our teams around the world push boundaries and think beyond what is expected. Together our teammates are unified by our values and are grounded in our vision to inspire you with performance solutions you never knew you needed but can’t imagine living without.</p><p><strong>Position Summary</strong></p><p>The&nbsp;<strong>Sr. Counsel, Employment Law&nbsp;</strong>provides day-to-day legal advice and counseling on a wide range of domestic and international labor and employment matters. Partners closely across the Human Resources organization on a variety of legal, training, and compliance issues. Coordinates with outside counsel as needed.&nbsp;Fosters strong relationships with the business by developing an understanding of Under Armour’s strategies and objectives and responding proactively to best serve the Company’s strategic Mission, Vision, Values, and Purpose.&nbsp;</p><p><strong>Essential Duties &amp; Responsibilities</strong></p><ul><li>Independently and with little direct oversight, provides counsel to and works closely with Human Resources on a broad range of employment matters, including recruiting, hiring, leave and accommodation, benefits, compensation, employee relations, restrictive covenants, discipline, terminations, compliance matters (including wage and hour), and strategies for managing risk around employment matters</li><li>Investigates and manages charges of discrimination and other complaints filed against the Company with regulatory agencies</li><li>Prepares position statements and other responses to be filed with agencies, prepare witnesses, and participate in on-site investigations</li><li>Independently respond to and resolve pre-suit demands</li><li>Foster compliance with a wide range of employment laws and regulations, including but not limited to, DOL, OFCCP, and OSHA, Title VII, the ADA, ADEA, FMLA, FLSA, FCRAA, and other federal/state/local employment laws and regulations</li><li>Coordinate with Human Resources to recommend, implement, and continuously improve employment-related policies and procedures</li><li>Draft and negotiate settlements, terminations, and other employment-related agreements</li><li>Support the continuous improvement of process and standard form agreements/contract templates, to maximize efficiencies, while providing adequate safeguards</li><li>Supervise and work closely with outside counsel to identify and minimize business risks and to achieve strategic objectives that are timely and cost-effective</li></ul><p><strong>Qualifications (Knowledge, Skills &amp; Abilities)</strong></p><ul><li>Excellent communication skills with the ability to provide clear guidance that influences internal stakeholders</li><li>Collaborative professional and strategic thinker who sees the big picture</li><li>Ability to confidently interact with executives, business leaders, and Human Resources professionals across the enterprise</li><li>Pragmatic problem-solver</li><li>Ability to prioritize, organize and work efficiently and independently in a high-volume, results-oriented environment</li><li>Ability to manage multiple projects simultaneously</li><li>Strong verbal and written communication skills</li></ul><p><strong>Education And / Or Experience</strong></p><ul><li>J.D. Required</li><li>7+ years of labor and employment legal experience,&nbsp;<u>both at a law firm and in-house required</u></li><li>Knowledge of U.S. federal and state employment law required</li><li>Specific experience with California and international labor and employment issues is a plus</li><li>Must be admitted to practice law and a member in good stating of a state bar</li></ul><p><strong>Other Requirements</strong></p><ul><li><strong>Location:&nbsp;</strong>This position is&nbsp;<u>fully remote</u>, strong preference for this individual to reside within commuting distance from our global headquarters in Baltimore, MD</li></ul><p><strong>Relocation</strong></p><ul><li>No relocation provided</li></ul><p><strong><em>At Under Armour, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law.&nbsp;Under Armour believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.&nbsp;</em></strong></p><p><strong>Learn more about Under Armour’s COVID-19 response and Teammate vaccination policies</strong>&nbsp;<a href=\"https://about.underarmour.com/news/2021/08/under-armour-delays-return-campus-early-2022\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(73, 73, 73);\"><strong>here.</strong></a></p><p></p>",
    "apply": "https://careers.underarmour.com/job/Baltimore-Senior-Counsel-Employment-MD-21230/822608600/",
    "company": "/companies/under-armour",
    "cName": "Under Armour",
    "location": "Remote",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Director Legal, Employment",
    "description": "<p></p><p><strong>Company Description</strong></p><p>Medable's mission is to get effective therapies to patients faster. We provide an end-to-end, cloud-based platform with a flexible suite of tools that allows patients, healthcare providers, clinical research organizations and pharmaceutical sponsors to work together as a team in clinical trials. Our solutions enable more efficient clinical research, more effective healthcare delivery, and more accurate precision and predictive medicine. Our target audiences are patients, providers, principal investigators, and innovators who work in healthcare and life sciences.</p><p>Our vision is to accelerate the path to human discovery and medical cures. We are passionate about driving innovation and empowering consumers. We are proactive, collaborative, self-motivated learners, committed, bold and tenacious. We are dedicated to making this world a healthier place.</p><p><strong>Job Description</strong></p><ul><li>Quickly grasp key drivers of the business and industry and become immersed in the most important business issues facing the company</li><li>Provide practical and strategic legal counsel and risk management advice to management and People Team colleagues on a wide variety of employment matters in a manner that is consistent with the Company’s values and goals</li><li>Advice on all aspects of employment law, including hiring, workplace privacy, M&amp;A people matters, progressive discipline and separations, diversity, equity and inclusion initiatives, restrictive covenants, leaves and accommodations, reductions in force, independent contractors, global mobility programs, immigration, and wage and hour matters</li><li>Advice on compensation and benefits matters, including compliance issues arising out of the design, implementation, and governance of health and welfare and retirement plans</li><li>Draft and review employment-related policies, procedures, offers, and agreements</li><li>Investigate and respond to employee claims, represent Medable in proceedings before federal and state agencies, and manage employment-related arbitration and litigation around the world</li><li>Manage and oversee outside counsel in the provision of advice in jurisdictions outside of the United States, in collaboration with People and Legal Team members&nbsp;</li><li>Monitor and assess the impact of legal and regulatory developments and enforcement trends at a state, federal, and global level in conjunction with outside counsel and People Team members</li><li>Effectively communicate risks and consequences, balancing potentially conflicting goals, to collaborate with the business on viable alternatives</li><li>Other duties as assigned</li></ul><p><strong>Qualifications</strong></p><ul><li>8+ years of working experience in labor and employment counseling&nbsp;&nbsp;or a combination of education and experience; both in-house and major law firm experience preferred</li><li>Currently admitted in good standing to practice law in at least one state in the United States or international equivalent</li><li>Facility with applicable legislation such as FMLA, ADA, FLSA, OSHA, ADEA, state worker’s compensation, and employment discrimination laws as well as international employment law and labor issues and U.S. government contractor OFCCP/affirmative action compliance</li><li>Solid working knowledge of corporate law, regulations, and best practices</li><li>Demonstrated successful leadership and collaboration with colleagues; ability to develop business solutions with effective presentation of risks and anticipated outcomes</li><li>Experience in working successfully in a highly results-oriented and performance-driven environment with a focus on excellence</li><li>Demonstrates a strategic, innovative, creative, and inquisitive frame of mind and a service and leadership mentality, with strong business acumen and judgment.</li><li>Passionate about employees, product, ethics, and winning.</li><li>Takes initiative and ownership, and operates with a sense of urgency, decisiveness, and responsiveness.</li><li>Makes nuanced recommendations and data-driven business decisions.&nbsp;</li><li>Strong and effective verbal and written communication, with skill and empathy, to a variety of audiences.</li><li>Marshalls the appropriate level and mix of resources as required by circumstances.</li><li>Demonstrates an exceptional focus on details, analysis, and results.&nbsp;Delivers the technical, planning, and project management skills to ensure the highest quality execution.</li><li>Holds themselves to the highest standards of accountability</li></ul><p><strong>Education:&nbsp;</strong></p><ul><li>Juris Doctor (or international equivalent) from a top law school.</li></ul><p>#LI-REMOTE</p><p>#LI-MQ1</p><p><strong>Additional Information</strong></p><p>Medable, Inc&nbsp;provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p><p>U.S. employees and contractors, and International workers with travel to the U.S. must have a willingness and ability to provide proof of completed COVID-19 vaccination prior to start date. All strongly held beliefs, religious, medical, and&nbsp;other legally recognized exemptions regarding vaccination status will be considered.</p><p></p>",
    "apply": "https://jobs.smartrecruiters.com/Medable/743999817688582-director-legal-employment-remote",
    "company": "/companies/medable",
    "cName": "Medable",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Contract Negotiator",
    "description": "<p></p><p><strong>Contract Negotiator</strong></p><p>Responsible for working as liaison between Providers and organization. Identify, select, and monitor providers and draft and negotiate final contracts. Ensures optimal language is inserted into each agreement that will protect One Call, its patients and customers May create processes and procedures to ensure overall quality of provider services. Facilitate development of relationships with providers, maintain relationships for long-term contracts, and mediate performance and scorecard disputes.</p><p><strong>GENERAL DUTIES &amp; RESPONSIBILITIES:</strong></p><ul><li>Draw up short term and long term Contracting Strategy for the development and improvement of One Call’s provider network</li><li>Works independently and as part of a team on contract negotiations, renegotiations, contract preparation, provider relations and recruitment</li><li>Reduce cost of goods sold through contract negotiations and renegotiations of existing vendor contracts</li><li>Ensure quality components of service delivery and patient/carrier satisfaction with services provided</li><li>Initially establishes relationships with providers and prepares handoff to account management team</li><li>Participate in process for continuous credentialing and quality monitoring of assigned accounts</li><li>Monitors state fee schedules by working closely with One Call’s Government Affairs Department to ensure vendor compliance</li><li>Works with team to identify margin opportunities by performing analysis on out of network utilization and using data to identify network development opportunities</li><li>Performs ad-hoc negotiations with out of network vendors and strategically recruits new vendors based on feedback from Operations and Sales</li><li>Works closely with Internal Audit and Compliance (IAC) department to ensure vendor compliance with contracts as well as One Call’s billing and other protocols</li><li>Identifies potential vendors for recruitment into the One Call network</li><li>Identifies white space and targets vendors in those areas for inclusion in the One Call network</li><li>Negotiates all new and existing contracts</li><li>Performs contract and cost analysis</li><li>Manages contract process including distributing and receiving contracts</li><li>Acquires credentialing applications at initial contracting</li><li>Acquires liability and licensure on each provider at initial contracting</li></ul><p><strong>EDUCATIONAL REQUIREMENTS:</strong></p><ul><li>Bachelor’s degree or the equivalent combination of education, training, or work experience.</li></ul><p><strong>GENERAL KNOWLEDGE, SKILLS &amp; ABILITIES:</strong></p><ul><li><strong>&nbsp;</strong>Good understanding of One Call products and services</li><li>General knowledge of the workers' compensation industry</li><li>Requires expert negotiation and communication skills, both written and verbal</li><li>Knowledge of Provider Relations</li><li>Excellent verbal and written communication skills to technical and non-technical audiences of various s levels in the organization (e.g. executive, management, individual contributors)</li><li>Excellent problem solving, team and time management skills managing multiple deadlines for self and others</li><li>Proficiency in making projections of future expenses based on analysis of cost effectiveness of past expenditures</li><li>Proficiency to operate independently on work that is often confidential in nature</li></ul><p><strong>Contract Negotiator&nbsp;</strong></p><p>Has good understanding of contract negotiation principles as well as some legal acumen around common contract provisions. Generally is responsible for multiple Providers for contract drafting and negotiation of medium to moderately high complexity that require demonstrated knowledge. Educate and advise internal clients on issues relating to new contracts as well as analysis and interpretation of existing contracts for future use. Ensures contractual agreements are met. Develop alternatives, strategies and plans of action to facilitate the negotiation process. Works under moderately minimal supervision on moderately strategic, complex projects. Moderate latitude for independent judgment. Typically requires two to five (2-5) or more years of demonstrated related experience.</p><p></p>",
    "apply": "https://onecallcm.csod.com/ux/ats/careersite/7/home/requisition/10629",
    "company": "/companies/one-call-care",
    "cName": "One Call Care",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Marketing Specialist",
    "description": "<p></p><p><strong>The Role.&nbsp;</strong></p><p>Root is seeking a Marketing Specialist to support two Digital Acquisitions teams (Paid Search and Demand Generation) with planning and execution. In this role, you will support the team by planning, implementing, and optimizing digital marketing campaigns that help Root achieve aggressive growth goals. The ideal candidate is strategic, detailed-oriented, and excited to drive work that supports an aggressively growing Marketing organization.&nbsp;</p><p>Reports to: Growth Manager&nbsp;</p><p><strong>What you’ll be doing.&nbsp;</strong></p><ul><li>Plan, launch, and monitor all facets of digital marketing campaigns (strategy, bids, creatives, landing pages, audiences, targeting, etc.)</li><li>Analyze and report out on regular channel performance and ad-hoc initiatives</li><li>Surface new opportunities for testing and coordinate within the team to plan, execute, and monitor tests for continuous optimization</li><li>Partner with creative team to plan creative testing and required assets</li><li>Produce project plans / summaries and socialize work with relevant stakeholders</li><li>Perform regular account audits around keyword coverage, creative performance, etc.</li><li>Help to push the program towards growth and automation</li></ul><p><strong>What we’re looking for.&nbsp;</strong></p><ul><li>3-5 years of proven experience in a digital marketing role, including hands-on experience with Google Ads, Facebook Ads, Bing Ads, etc.</li><li>Comfortable with Google Drive software, especially Google Sheets and Slides</li><li>Intermediate excel skills preferred, SQL experience is a plus</li><li>Exceptional organizational skills and drive to ensure process consistency&nbsp;</li><li>Works independently with excellent time management and prioritization skills&nbsp;</li><li>Ability to work cross-functionally, with a collaborative mindset and positive attitude&nbsp;</li><li>Maintains a do-what-it-takes attitude and enjoys working in a fast-paced working environment</li></ul><p></p>",
    "apply": "https://www.joinroot.com/careers/4440061004",
    "company": "/companies/root-insurance",
    "cName": "Root Insurance",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Product Marketing Manager",
    "description": "<p></p><p><strong>ABOUT THE ROLE</strong></p><p>As a product marketer at LendingTree you will be part of a highly talented team who is passionate about helping customers save money through comparison shopping. We are seeking a motivated, hardworking individual who understands the power of outstanding product marketing to work on our credit services and debt relief business units.</p><p>The ideal candidate is an experienced product marketer and has a proven track record creating and executing product marketing strategies. You are a highly collaborative, customer-obsessed with an understanding of core product marketing responsibilities like go-to-market plans, product positioning, messaging, and value proposition creation. You're an engaging storyteller who thrives on converting data into impactful narratives, visualization, and recommendations. You will develop a deep understanding of LendingTree’s digital marketing funnels and work with marketing and product teams to optimize them to support growth.</p><p><strong>ROLE &amp; RESPONSIBILITIES</strong></p><ul><li>Shape the product narrative and customer acquisition strategies for emerging and established products.</li><li>Leverage outstanding market research skills to understand the market, customers, and competition with the ability to integrate this information into growth strategies.</li><li>Partner cross functionally to lead and implement end to end go-to-market strategy for responsible product lines.</li><li>Create multi-year, annual and semi-annual plans to drive revenue growth, profitability, adoption and repeat use of our core offerings.</li><li>Test, iterate and measure the impact of campaigns and adjust accordingly to optimize for results and critical metrics</li><li>Keep a pulse on the day-to-day operations of the business. Report out on marketing performance to key stakeholders and work with marketing to implement countermeasures as necessary throughout the year to achieve business financial targets.</li><li>Meet with key stakeholders to gain an in depth understanding of your responsible product lines to ensure we are driving both customer and partner satisfaction.</li></ul><p><strong>PREFERRED QUALIFICATIONS</strong></p><ul><li>Bachelor’s degree in marketing or another related field</li><li>Ability to influence decision making with key stakeholders to drive growth</li><li>1-3 years of experience in product marketing</li><li>Has a strong digital marketing background</li><li>Customer obsession</li><li>Stellar project management skills</li><li>Strong business acumen</li><li>Consistent execution and strong attention to detail</li><li>Excellent interpersonal skills. Strong communication skills, written and oral</li><li>A roll up your sleeves mentality with the desire to be hand-on and seek out challenges</li></ul><p>If you want to make a real impact every day in a dynamic and fun team environment, send us your resume now!</p><p><strong>COMPANY</strong></p><p>LendingTree is the nation’s largest online lending marketplace. That means we connect customers with multiple lenders so they find the best deals on loans, credit cards, savings accounts and insurance. Our goal is to help people save money, and we believe the best way to do that is by giving them a way to shop for loans and compare lenders so they make their best financial choices.</p><p>Our CEO Doug Lebda founded the company in 1996 after a frustrating house-hunting experience. In those days, we mostly helped people find good mortgage deals. Now, we help consumers find their best in personal loans, auto loans, business loans, student loans, credit cards, savings accounts, home equity loans and more.</p><p><strong>What else you should know:</strong></p><ul><li>We’re a publicly-traded company (TREE).</li><li>We’ve welcomed several other companies into the LendingTree family to augment our efforts at helping borrowers make their most sensible financial choices.</li><li>We’ve built the LendingTree app and LendingTree dashboard to give consumers tools to manage and monitor their financial health.</li></ul><p><strong>CULTURE</strong></p><p>We’re a fast-paced company with an entrepreneurial bend. We work hard and test our products often. We’re collaborative, ambitious, candid and high-energy. Our teammates are some of the brightest, most talented people you’ll ever work with. We care more about your smarts than we do about the kinds of clothes you wear (but please, do wear clothes to work!), and we’re pretty good about rewarding innovation, creativity and the knack for just getting stuff done (we even have an award for employees called the GSD, “Get Stuff Done”).</p><p>Come work with us!</p><p><em>LendingTree is the kind of company that not only promotes diversity and inclusion; we thrive because of these values. We do not discriminate based on race, color, religion (or creed), gender, gender expression, age, national origin, disability, marital status, sexual orientation or military status.</em></p><p></p>",
    "apply": "https://boards.greenhouse.io/lendingtree/jobs/4125396",
    "company": "/companies/lendingtree",
    "cName": "LendingTree",
    "location": "Remote",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "MARKETING OPERATIONS SPECIALIST",
    "description": "<p></p><p>Cella is looking to hire a Marketing Operations Specialist to help manage the funnel and attribution process used for this companies marketing automation platforms and CRMs. You will have the opportunity to work with a global software company, teaming up with business, technical and marketing teams to impact analytics, influence operations and manage workflow. Additional details are below.</p><p><strong>Marketing Operations Specialist Responsibilities:</strong></p><ul><li>Work closely with leaders to define strategy on funnel and attribution systems.</li><li>Help design and develop workflows across marketing automation platforms (Full Circle,</li><li>Marketo, Leandata, Openprise etc..) and CRM (Salesforce).</li><li>Optimize pipeline attribution process across tech stack to scale new requirements set</li><li>by leadership teams.</li><li>Conduct data analysis to track marketing funnel to gain helpful and actionable insights.</li><li>Assist in find bugs/issues as they arise in marketing workflow and regional teams.</li><li>Manage multi-touch marketing funnel and build roadmap by working with business, IT</li><li>and 3rd party vendors.</li></ul><p><strong>Marketing Operations Specialist Qualifications:&nbsp;</strong></p><ul><li>Bachelors degree in Marketing/business related field.</li><li>Proficiency with Salesforce and other marketing automation tools/CRMs.</li><li>Willingness to work in a fast-paced environment with strong collaboration and cross-</li><li>functional teams.</li><li>And interest and ideally a technically based background.&nbsp;</li></ul><p>Job ID: 324851SA</p><p>&nbsp;#LI-Cella</p><p>#LI-SA1</p><p>#Remote</p><p></p>",
    "apply": "https://cellainc.com/jobs/detail/marketing-operations-specialist/324851/",
    "company": "/companies/cella",
    "cName": "Cella",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Marketing Operations Manager",
    "description": "<p></p><p><strong>Why Work at Lenovo</strong></p><p>Here at Lenovo, we believe in smarter technology for all, so we spend our time building a society that’s brighter and more inclusive. And we go big. No, not big—huge.&nbsp;</p><p>We’re a US$60 billion revenue Fortune Global 500 company serving customers in 180 markets around the world. Focused on a bold vision to deliver smarter technology for all, we are developing world-changing technologies that power (through devices and infrastructure) and empower (through solutions, services and software) millions of customers every day and together create a more inclusive, trustworthy and sustainable digital society for everyone, everywhere.&nbsp;</p><p>The one thing that’s missing? Well… you...</p><p><strong>Description and Requirements</strong></p><p>We are looking for a talented marketeer and operational whiz for our new Solutions and Services Group (SSG), to be a part of Lenovo’s evolution into a world-leading technology solutions company.</p><p>The Manager of Marketing Operations plays a critical role in the marketing department of one of Lenovo’s three global business groups.&nbsp;This role is the ‘glue’ that keeps the marketing organization together.&nbsp;The role blends marketing communications development, budget management, executive presentations, and some responsibilities typically found in a ‘chief-of-staff’ position.&nbsp;</p><p><strong>Responsibilities Overview:</strong></p><ul><li>Leading the marketing performance measurement for the Services and Solutions group (SSG).</li><li>Driving the annual strategic planning process for SSG marketing</li><li>Own the budget tracking process, including engagement with finance and procurement as needed</li><li>Collaborating with Lenovo’s cross-functional marketing tools and process leaders</li><li>Manage the process of identifying, prioritizing, chartering, communicating, and managing key strategic projects.</li><li>Develop an effective e2e KPI system &amp; cascade and metrics to measure outcomes</li><li>Lead WW Business Management System that sets clear targets and measurements on business priorities - weekly, monthly, quarterly</li><li>Drive outside-in understanding: Deep understanding of the Services and Solutions market. See connections in the market and business data to anticipate trends and discover opportunities</li><li>Coordinate with SSG marketing leaders on executive engagements (i.e. marketing reviews)</li><li>Manage timelines of key activities to ensure successful completion of marketing programs</li><li>Organize day-to-day activities with the VP, SSG Marketing, including executive presentations, external presentations, key meeting prep</li><li>Support the marketing organization with ad-hoc projects and key strategic initiatives.</li></ul><p>The location is flexible and can be based in person in Lenovo’s Morrisville (Raleigh-Durham) headquarters or hybrid (US East Coast preferred). This will be working with teams across North America, Asia, Europe, and Latin America.&nbsp;</p><p><strong>Basic Requirements</strong></p><ul><li>5+ years of marketing experience in a large company</li><li>Degree level qualification in marketing, communications, business studies or equivalent</li></ul><p><strong>Preferred Requirements</strong></p><ul><li>Experience in the tech industry preferred</li><li>Fluent in written and spoken English</li><li>Excellent communicator</li><li>Strong writing, content development and editing skills with the ability to communicate simply and authentically</li><li>Ability to comprehend often complex new technologies and translate into a variety of communications materials</li><li>A problem solver and quick learner who is proactive, flexible and resilient and with the innate ability to multi-task</li><li>Self-starter with an entrepreneurial mindset, but can work dynamically in virtual and cross-cultural group settings</li><li>A background in project management and business operations</li><li>Ability to adapt, influence change and be creative</li><li>Attention to detail.</li></ul><p><em>We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any federal, state, or local protected class.</em></p><p><strong><em>Lenovo adopted a COVID-19 Vaccination Policy for US-based employees. As a condition of employment, employees must adhere to Lenovo’s US Vaccination Policy and be fully vaccinated against COVID-19, subject to any applicable accommodations. To be fully vaccinated means individuals must receive the full series of a vaccine either approved by the FDA or WHO and listed by the CDC (e.g. two dose of the Moderna, AstraZeneca or Pfizer-BioNTech vaccines; or&nbsp;one dose of the Johnson &amp; Johnson vaccine).&nbsp;This applies to all US-based employees, contractors and interns, regardless of work location. As a condition of employment, you must provide proof that you are fully vaccinated or follow Lenovo’s accommodation process.</em></strong></p><p></p>",
    "apply": "https://jobs.lenovo.com/en_US/careers/JobDetail/Manager-Marketing-Operations-Solutions-Services-Business-Unit/39053",
    "company": "/companies/lenovo",
    "cName": "Lenovo",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Dealer Marketing Consultant",
    "description": "<p></p><p><strong>Job Description</strong></p><p><strong>We’re leading our industry.</strong></p><p>Epsilon is an all-encompassing global marketing innovator. We wrote the book on database management, and now we’re writing the future of marketing. We know that true connections create better results, so we work together to develop personalized marketing solutions for consumers. Here, you’ll learn from the best in the business and grow in a team-oriented environment.</p><p><strong>Grow above and beyond.</strong></p><p>As a Dealer Sales Consultant, you’re responsible for maintaining your territory, which includes Cold Calling, Dealer Par Visits, and phone calls/emails. You’ll increase revenue and meet or exceed sales objectives. Responsibilities include overall revenue performance, product penetration, new business acquisition, account maintenance, and overall growth.</p><p>What you’ll do as a&nbsp;<strong>Dealer Sales Consultant:</strong></p><ul><li>Consistently meet or exceed sales goals by selling Epsilon product line to targeted clients—dealerships and dealer groups in assigned market area.</li><li>Provide exceptional problem resolution by implementing Epsilon solutions to dealerships’ needs.</li><li>Actively participate in customer concern resolution and cancellation turnaround attempts while maintaining consistent support and service to existing clients.</li><li>Demonstrate complete “project management” over each account in their geographical area of responsibility.</li><li>Schedule Dealer Visit Kick-Off meetings on Program Activations within 2 weeks of dealer activating for all Reoccurring Revenue Products.</li></ul><p><strong>What skills you will use:</strong></p><ul><li>Skilled in SalesForce.</li><li>Territory management competence.</li><li>Experience selling Core Products &amp; Direct Campaigns.</li><li>Provide your MSR/AM with a rough schedule of where you will be so they can pushback any upcoming PAR calls to another week.</li></ul><p><strong>Who are we a good fit for?&nbsp;</strong></p><p>We didn’t become an industry leader through corporate stagnation. We’re constantly changing, and we love working with people who share our adaptability and thirst for knowledge. With new ideas flying around, we thrive on a collaborative spirit. If you want to work for a company that encourages advancement, then come join us.</p><p><strong>Additional Information</strong></p><p><strong>When you’re one of us, you get to run with the best.</strong>&nbsp;For decades, we’ve been helping marketers from the world’s top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services. Epsilon’s best-in-class identity gives brands a clear, privacy-safe view of their customers, which they can use across our suite of digital media, messaging and loyalty solutions. We process 400+ billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. Thanks to the work of every employee, Epsilon has been consistently recognized as industry-leading by Forrester, Adweek and the MRC. Positioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. For more information, visit&nbsp;<a href=\"http://epsilon.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 112, 205);\"><u>epsilon.com</u></a></p><p><strong>Great People Deserve Great Benefits</strong></p><p>We know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career.</p><p>Epsilon is an Equal Opportunity Employer.&nbsp;Epsilon’s policy is not to discriminate against any applicant or employee based on actual or perceived race, age, sex or gender (including pregnancy), marital status, national origin, ancestry, citizenship status, mental or physical disability, religion, creed, color, sexual orientation, gender identity or expression (including transgender status), veteran status, genetic information, or any other characteristic protected by applicable federal, state or local law. Epsilon also prohibits harassment of applicants and employees based on any of these protected categories.</p><p>Epsilon will provide accommodations to applicants needing accommodations to complete the application process.</p><p>For San Francisco Bay and Los Angeles Areas: Epsilon will consider for employment qualified applicants with criminal histories in a manner consistent with the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance and San Francisco Police Code Sections 4901-4919, commonly referred to as the San Francisco Fair Chance Ordinance.&nbsp;</p><p>Applicants with criminal histories are welcome to apply.</p><p>#LI-LC1</p><p></p>",
    "apply": "https://jobs.smartrecruiters.com/PublicisGroupe/743999818237560",
    "company": "/companies/epsilon",
    "cName": "Epsilon",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  }
]