[
  {
    "title": "Senior Python Developer",
    "description": "<p></p><p><strong>About FireMon</strong></p><p>FireMon&nbsp;pioneered improving security outcomes by improving security operations in the cybersecurity industry. Technologies have changed, the threats have evolved, but our mission remains the same. Our culture is built upon four employee-driven values that focus on problem-solving, work/life balance,&nbsp;motivation, and innovation.&nbsp;These values are core to everything we do and&nbsp;fuel the&nbsp;impact our employees&nbsp;have on our customers,&nbsp;product, and overall&nbsp;organization. Each person&nbsp;is empowered to have&nbsp;a voice and is encouraged to collaborate, be creative, provide valuable insights, and play a role in the company's success.&nbsp;</p><p>Our engineers build software at scale to transform how organizations around the world streamline network security policy management. We are constantly evolving our products to meet and anticipate our customer’s needs. As a part of our team, you'll contribute high-quality code to FireMon products that are deployed to the most important institutions in the public and private sectors.</p><p>You will be working as a Python Engineer in a cross-functional team setting to understand our customers' problems and develop solutions for those use cases.</p><p>Throughout the product lifecycle, you will be involved from idea generation, design, and prototyping to execution and implementation. Our organization is made up of small teams to support agility and creativity. That said, we encourage movement among teams to share context, skills, and experience, so you'll learn about many different aspects of each product.</p><p>Our engineering environment utilizes a variety of languages, including Java, Python, and Angular. In addition, we embrace open-source technologies like ElasticSearch and Linux and industry-standard build tools, including Ansible, Jenkins, Docker, and Puppet.</p><p><strong>Responsibilities will include:</strong></p><ul><li class=\"ql-indent-1\">Designing, implementing, maintaining, and documenting the FireMon Operating System tools and utilities</li><li class=\"ql-indent-1\">Building command-line applications and web services specifically for using, configuring, and maintaining FMOS installations</li><li class=\"ql-indent-1\">Partnering closely with System Engineers to create an enterprise quality system that improves the experience for customers running FMOS</li></ul><p><strong>Required Skills and Experience</strong></p><ul><li class=\"ql-indent-1\">Bachelor's Degree in Computer Science, Information Technology, Engineering or another related field of study.</li><li class=\"ql-indent-1\">Strong object-oriented software development experience, specifically with the Python programming.</li><li class=\"ql-indent-1\">Extensive experience working with Linux or Unix-based operating systems.</li><li class=\"ql-indent-1\">Extremely strong core Python coding skills, including an understanding of optimization, performance ramifications of coding decisions, and object-oriented design.</li><li class=\"ql-indent-1\">Experience with and working knowledge of command-line interface applications and RESTful web services.</li><li class=\"ql-indent-1\">Outstanding problem-solving skills.&nbsp;Someone that can pick apart software, analyze it and become a subject matter expert on it.</li><li class=\"ql-indent-1\">Experience with configuration management utilities (e.g. Ansible, Puppet).</li><li class=\"ql-indent-1\">Source control management, particularly Git, and collaborative development workflows.</li></ul><p><strong>Preferred Skills and Experience</strong></p><ul><li class=\"ql-indent-1\">Understanding of operating system (especially Linux) installation and deployment automation</li><li class=\"ql-indent-1\">Knowledge of Networking concepts, nomenclature, familiarity with Firewalls, Routers, Load balancers.</li><li class=\"ql-indent-1\">Familiarity with Linux package management and distribution</li><li class=\"ql-indent-1\">Experience in LDAP, RADIUS and/or Active Directory a plus</li><li class=\"ql-indent-1\">Experience working with PostgreSQL, Elasticsearch, ActiveMQ, SQLite</li><li class=\"ql-indent-1\">Understanding of&nbsp;<a href=\"http://x.509/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(115, 117, 120);\">X.509</a>&nbsp;security certificates and public-key cryptography</li></ul><p><strong>What it Takes to be Part of the FireMon Team</strong></p><p>FireMon provides persistent network security for hybrid environments through a powerful fusion of real-time asset visibility, continuous compliance, and automation. Since creating the first-ever network security policy management solution, FireMon has delivered command and control over complex network security infrastructures for more than 1,700 customers.</p><p>Our customers have unique and complex security problems that are difficult to solve. This doesn’t intimidate us, it inspires us. It pushes us to be more creative and find solutions to ensure their success. If this sounds like a movement you'd be interested in joining, we invite you to apply today.</p><p>FireMon provides equal employment [opportunities to applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability.</p><p></p>",
    "apply": "https://jobs.lever.co/firemon/2692cfb3-c2af-4e32-9c89-c7c8a796a334",
    "company": "/companies/firemon",
    "cName": "FireMon",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Fullstack SW Developer",
    "description": "<p></p><p class=\"ql-align-justify\"><strong>Job Description:</strong></p><p class=\"ql-align-justify\">One of our Partners, a leading global engineering, consulting, and construction company, is currently going through an Enterprise-wide digital transformation and in need of a Fullstack Developer. This person will be a part of the team that is at the forefront of this entire transformation &amp; will be one layer removed from the CTO. This developer will play a part in various application development projects and initiatives required to undergo this transformation—as there will be lots of room for growth on this team! 100% remote EST hours. Apply today to connect with our team for more details!</p><p class=\"ql-align-justify\"><strong>Requirements:</strong></p><p class=\"ql-align-justify\">• 5+ years of software development experience working in an Agile environment</p><p class=\"ql-align-justify\">• Experience developing with Java, .NET, or C# on the backend</p><p class=\"ql-align-justify\">• Strong experience using Angular or React for front-end development</p><p class=\"ql-align-justify\">• Excellent communication and problem-solving skills</p><p class=\"ql-align-justify\"><strong>Nice to have:</strong></p><p class=\"ql-align-justify\">• Experience developing with node.js, or python</p><p class=\"ql-align-justify\">• PowerBI, Geospatial experience, Google Earth development</p><p class=\"ql-align-justify\">• Microsoft Certified Solution Developer (MCSD) or Certified Applications Developer (MCAD)</p><p class=\"ql-align-justify\"><strong>Responsibilities:</strong></p><p class=\"ql-align-justify\">• Follow SDLC to develop new code and enhance existing code.</p><p class=\"ql-align-justify\">• Participate in daily stand-up and follow Scrum/Agile methodologies</p><p class=\"ql-align-justify\">• Collaborate with business units and technical staff &amp; stakeholders to design appropriate solutions for an Enterprise-wide transformation.</p><p class=\"ql-align-justify\">• Evaluate options and provide recommendation on scope and scale of effort required to develop solutions.</p><p class=\"ql-align-justify\">• Suggest and cultivate ideas on the extension of the current systems to new products and services.</p><p class=\"ql-align-justify\">We use E-Verify to confirm U.S. Employment eligibility.</p><p></p>",
    "apply": "https://www.innovien.com/job/fullstack-sw-developer-telecommute-ga/",
    "company": "/companies/innovien-solutions",
    "cName": "Innovien Solutions",
    "location": "Remote",
    "type": "full-time",
    "category": "programming"
  },
  {
    "title": "Senior Designer",
    "description": "<p></p><p>Provi is innovating the 240-billion dollar alcohol industry—do you want to be part of something game-changing? We were a hungry team in 2016 when we started and we’re still a hungry team, living our values—Host,&nbsp;Serve,&nbsp;Deliver&nbsp;and&nbsp;Celebrate—every day. We make sure that as the company grows, our people grow too and we’d love to have you on board.</p><p>Frequently cited statistics show that women and underrepresented groups apply to jobs only if they meet 100% of the qualifications. But guess what? No one ever meets 100% of the qualifications. Trust your experience and apply!&nbsp;</p><p>Joining a team of editors, creative designers, and content producers, the Senior Designer will be responsible for supporting SevenFifty Daily &amp; Beverage Media Group publishing through the creation of print and digital assets in various formats in addition to desktop publishing.&nbsp;</p><p>If you’re ready to put your design and collaborative skills to work helping professionals in the beverage industry, this role is for you.</p><p>This is a fully remote position.&nbsp;You can be located anywhere in the U.S. and will report to our Creative Director.</p><p><strong>What you'll be doing</strong></p><ul><li class=\"ql-indent-1\">Design digital and print solutions for weekly, digital editorial posts, key sponsored content campaigns, and social media</li><li class=\"ql-indent-1\">Design monthly layout of features and columns for multiple print titles</li><li class=\"ql-indent-1\">Create other collateral and print publishing design in collaboration with the creative services team and across multiple</li><li class=\"ql-indent-1\">Business Units to visually convey a particular message, idea, or concept</li><li class=\"ql-indent-1\">Coordinate with editors, creative director, writers, and partnerships team to get and organize creative assets</li><li class=\"ql-indent-1\">Present design ideas and creative concepts to clients, creative directors, and editorial team</li><li class=\"ql-indent-1\">Manage a variety of tasks with rigid timelines while maintaining attention to detail, high standards of quality, and the design aesthetic of our publications</li></ul><p><strong>What we are looking for</strong></p><ul><li class=\"ql-indent-1\">7+ years of work experience in design/publishing field</li><li class=\"ql-indent-1\">Proficient in Adobe Creative Cloud software (XD, AI, INDD, PS, IC), presentation tools (Keynote/Google slides), Sketch, Figma, InVision or similar platforms</li><li class=\"ql-indent-1\">Experience with digital marketing technologies and platforms, particularly Wordpress (or other CMS) publishing, email marketing, and social media management</li><li class=\"ql-indent-1\">Campaign-minded thinking—understand how a single message or idea can be delivered across a range of media, audiences, and stakeholders</li><li class=\"ql-indent-1\">Knowledge of desktop publishing and editorial print publishing experience</li><li class=\"ql-indent-1\">Some experience or familiarity with HTML/CSS and/or other front-end coding languages and its basic principles</li></ul><p>Please submit a link to your portfolio when applying.</p><p><strong>What you can do at Provi:</strong></p><p>Make an impact:&nbsp;Work directly with the management team to help grow the business.</p><p>Find your groove and grow:&nbsp;Provi keeps growing and you should too. Expand your skill set, diversify your experience and develop along with us.</p><p>Enjoy competitive benefits:&nbsp;Health, Dental, Vision, 401K with match, Commuter Perks, Long/Short Term Disability, Employee Assistance Program, Unlimited PTO and ½ day Fridays in the Summer.</p><p>Flexibility at work:&nbsp;We are remote first but have a great office in downtown Chicago for employees to use.</p><p>Be a part of something big:&nbsp;Join a dynamic and innovative team that is working to change a major industry.</p><p>Provi is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p><p>#BI-Remote</p><p></p>",
    "apply": "https://jobs.lever.co/provi/8b8dac9d-7ab3-4e5f-98b0-173a03061a98",
    "company": "/companies/provi",
    "cName": "Provi",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "UI Designer",
    "description": "<p></p><p><strong>Level Ex</strong>&nbsp;is a fast-growing technology company that crafts games and applications for medical professionals. Our games are altering the world - we need your help to deliver them! Using the highest standards of game design and custom game mechanics, we employ groundbreaking graphics and physics technology to drive physician and medical technology adoptions and concepts to a worldwide audience. We have built out a virtual anatomy with custom-built GPU-based fluids, tissues, and soft-body systems.</p><p>We’re looking for a talented<strong>&nbsp;UI Designer</strong>&nbsp;to join our team. You’ll be a crucial part of designing and realizing game interfaces across a variety of our health impacting products.</p><p><strong>What You’ll Do</strong></p><ul><li>Work thoughtfully with UI leadership, fellow designers, and UX to create and implement unique game UI utilizing the Unity engine.</li><li>Create striking visual design comps for menus and HUDs.</li><li>Develop various 2D art assets for mobile, desktop, and web-based projects using one of our two design systems.</li><li>Conceptualize animated interactions, micro-animations, and transitions in tandem with our technical artists.</li><li>Workshop new ideas and give feedback to our highly collaborative team.</li><li>Assist in maintaining our UI Kits and Design System.</li><li>Occasionally update our live products with new content and features.</li></ul><p><strong>What You’ll Bring</strong></p><ul><li>Minimum of at least 3+ years of professional experience working in game development or mobile app environment.</li><li>Personable and able to collaborate effectively over Zoom and Slack.</li><li>Can quickly learn new tools and processes when necessary.</li><li>Comfortable with a fast-paced (no crunch) development environment.</li><li>Launched at least one game or mobile app as a UI Designer/UI Artist.</li><li>Experience with screen layout tools like Figma, Sketch, or Adobe XD.</li><li>Demonstrable experience with Adobe CC design tools.</li><li>Solid understanding of mobile UI design principles and processes.</li><li>Portfolio demonstrating excellent design foundation, typography, compositional, and layout skills.</li></ul><p><strong>Bonus Points For</strong></p><ul><li>Experience using our primary game engine, Unity or Unreal.</li><li>Experience prototyping in Figma, Sketch, Adobe XD, Invision, or Axure.</li><li>3D, Motion Graphic, or illustration skills.</li><li>Familiarity with C# scripting in Unity.</li></ul><p><strong>How We Make You Happy</strong></p><ul><li>Multiple health insurance plans with 100% company-paid premiums</li><li>401(k) with generous company-paid match</li><li>100% remote for all U.S. employees</li><li>Family-friendly benefits; Dental, vision, and optional pet insurance, 4 weeks of PTO, 2 weeks of company holidays, and more!</li><li>Monthly snack allowance sent to your home- or choose a snack pack instead</li><li>Remote-friendly events ie. board games tabletop simulator, Jackbox Games, DEI events, game jams, virtual happy hours</li></ul><p><strong>Interested?&nbsp;</strong>&nbsp;</p><p>For the fastest consideration please send us your resume along with an optional cover letter. Meet some of our incredible team here, and learn why you’ll enjoy our company and culture -<a href=\"https://www.youtube.com/watch?v=NWJU2F3L8pA\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">&nbsp;<strong>Video: Why Join Level Ex</strong></a><strong>.</strong></p><p>Diversity Statement</p><p><strong>Level Ex&nbsp;</strong>is the collective sum of all our individual experiences, backgrounds, and influences and we pride ourselves in growing and learning together. We are an&nbsp;<strong>Equal Opportunity Employer</strong>&nbsp;committed to building an inclusive and diverse environment where everyone’s individuality is respected, and everyone has an Identity. Our commitment to inclusion across race, gender, age, religion, identity, and experience drives us forward every day.</p><p><em>No Agency or Recruiter submissions will be accepted.</em></p><p><em>Legal authorization to work in the U.S. is required. We will not sponsor individuals for employment visas, now or in the future, for this job.</em></p><p><strong>Socials&nbsp;</strong></p><p></p>",
    "apply": "https://boards.greenhouse.io/levelex/jobs/5155314003",
    "company": "/companies/level-ex",
    "cName": "Level Ex",
    "location": "USA",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "UX/UI Designer",
    "description": "<p></p><p>We are searching for a UI/UX Designer to join our 35-person engineering team. In this role, you will help craft the experience and design of our web applications, with an eye towards efficiency and usability which means you’ll play an important part in growing and maturing our product. Our tight-knit team combines a Scrum process with a strong testing culture, continuous integration.&nbsp;</p><p>You’ll have a leg up if you’re passionate about healthcare and geek out on delivering an amazing and useful application.&nbsp;</p><p><strong>Essential Functions</strong></p><ul><li class=\"ql-indent-1\">Apply your creative nature and visionary ways to the design of novel and existing web applications.&nbsp;</li><li class=\"ql-indent-1\">Engage with users to perform usability research, working to identify workflow enhancements that will create more efficiency and improve performance.&nbsp;</li><li class=\"ql-indent-1\">Serve as an advocate for users within our existing product and software development life cycle.&nbsp;</li><li class=\"ql-indent-1\">Collaborate with the rest of Engineering to turn great ideas into awesome realities. You’ll lead the design team in taking initial concepts and requirements all the way through developer-ready designs.&nbsp;</li><li class=\"ql-indent-1\">Interpret and translate user insights into concepts, user flows, wireframes, visual design comps and prototypes.&nbsp;</li><li class=\"ql-indent-1\">Improve design, usability, and engagement through the analysis and integration of front-end metrics.&nbsp;</li></ul><p><strong>Required Skills/Abilities</strong></p><ul><li class=\"ql-indent-1\">2+ years of UI/UX web application development experience.&nbsp;</li><li class=\"ql-indent-1\">Mastered modern design tools as Figma, InVision, Adobe XD, Maze.&nbsp;</li><li class=\"ql-indent-1\">Know how to manage projects—you’ve even led several large projects while coordinating between product and development.&nbsp;</li><li class=\"ql-indent-1\">Consider yourself an HTML and CSS (along with preprocessors SASS/LESS/etc.) pro.&nbsp;</li><li class=\"ql-indent-1\">Are an excellent communicator and have superb written and spoken communication skills (in English).&nbsp;</li><li class=\"ql-indent-1\">Possess a strong understanding of usability principles.&nbsp;</li><li class=\"ql-indent-1\">Are familiar with software development concepts and processes (e.g., version control, ticketing systems, Agile methodology).&nbsp;</li></ul><p><strong>Additional Details</strong></p><ul><li class=\"ql-indent-1\">Supervisory Responsibilities: None</li><li class=\"ql-indent-1\">Work environment/Physical Demands: Continuous sitting and fine manipulation.</li><li class=\"ql-indent-1\">Travel Requirements: None</li><li class=\"ql-indent-1\">Work Authorization:&nbsp;Legally able to work in the United States without sponsorship</li></ul><p><strong>Who are we?</strong></p><p>At Q-Centrix, we hire people who love learning, value innovation and believe in our mission and values to improve outcomes in healthcare. We applaud qualified applicants who are accountable and committed to producing quality work. As an Equal Opportunity Employer, we support and value diversity, dignity and respect in our work environment, and are committed to creating an inclusive environment in which everyone can thrive.</p><p>We employ people based on the needs of the business and the job, and their individual professional qualifications. Here’s what does not impact our employment decisions: race, religious creed, religion, color, sex, sexual orientation, pregnancy, parental status, genetic information, gender, gender identity, gender expression, age, national origin, ancestry, citizenship, protected veteran or disability status, health, marital, civil union or domestic partnership status, or any status or characteristic protected by the laws or regulations in locations where we operate. If you are an individual with a qualified disability and you need an accommodation during the interview process, please reach out to your recruiter.</p><p>We celebrate and embrace these differences, and take pride in our commitment to being an equal opportunity team.</p><p></p>",
    "apply": "https://jobs.lever.co/q-centrix/501f1cf8-eb54-41a8-847e-d056a9201d30",
    "company": "/companies/q-centrix",
    "cName": "Q-Centrix",
    "location": "Remote",
    "type": "full-time",
    "category": "design"
  },
  {
    "title": "Senior Business Project Manager",
    "description": "<p></p><p><strong>Description &amp; Qualifications</strong></p><p><strong>Description</strong></p><p>The Learning &amp; Community Sr Project Manager will drive learning, user adoption, and community initiatives that result in “best in class” user experiences. To excel in this role, you will need to be collaborative and organized. As a skilled project manager you will need to be globally minded, capable of creating and managing a project plan from start to finish, highly collaborative, technically savvy, and a change advocate.</p><p><strong>Responsibilities:</strong></p><p>• Lead and drive the execution of critical projects from initiation through implementation</p><p>• Interpret requirements, identify and communicate project scope, align resources, and ensure program milestones and objectives are met</p><p>• Delegate tasks on the project to employees best positioned to complete them</p><p>• Facilitate meetings and successfully manage virtual project teams</p><p>• Develop and maintain project schedules, define and monitor budgets, and assign tasks to deliver on-time, results-driven projects</p><p>• Identify and manage risks, mitigation strategies, plan activities, dependencies, impacts, escalation channels, financial budget, and detailed project documentation</p><p>• Keep management informed of key issues and changes which may impact expected business results</p><p>• Ensure effective cross-functional communications</p><p>• Implement change management and enablement strategies for successful project roll-out and team adoption</p><p>• Measure and evaluate effectiveness, communicate results, and make recommendations for future improvements</p><p>• Coach other team members on project management best practices</p><p>• Advocate for UKG, Learning &amp; Community team, customers, partners and U Krewers in all interactions that promote proactive, open interactions and continuous feedback throughout the organization</p><p>• Some travel and after hour support may be required, less than 25%.</p><p>• Perform other duties and responsibilities as assigned</p><p><strong>Qualifications</strong></p><p>Qualifications:</p><p>Minimum Qualifications/Experience/Education:</p><p>• At least 5 years of relevant business experience, including project management, process improvement, program management and business operations, preferably in the Learning and Development space</p><p>• Strong familiarity with project management software tools, methodologies, and best practices</p><p>• Excellent organizational, verbal, written, and interpersonal skills that build relationships at all levels across the organization with a high capacity for influence, collaboration, and consensus</p><p>• Ability to analyze and present data to ignite action, identify and mitigate risks, track and evaluate operational effectiveness</p><p>• Ability to solve complex issues; using analytical thinking to identify innovative solutions</p><p>• Lifelong learner that seizes opportunities for continued personal and professional growth with a passion for helping others</p><p>• Proven ability to work in a cross-cultural, matrix reporting structure and can excel in a remote environment with customers and team dispersed globally.</p><p><strong>Preferred Qualifications/Skills:</strong></p><p>• Bachelor’s degree,</p><p>• PMP, Agile Certification</p><p>• Lean / Six Sigma certification preferred</p><p>• Project Management software/tools</p><p>• Experience with learning, technical training and/or community projects.</p><p><strong>Company Overview</strong></p><p>Here at UKG, Our Purpose Is People. UKG combines the strength and innovation of Ultimate Software and Kronos, uniting two award-winning, employee-centered cultures. Our employees are an extraordinary group of talented, energetic, and innovative people who care about more than just work. We strive to create a culture of belonging and an employee experience that empowers our people. UKG has more than 13,000 employees around the globe and is known for its inclusive workplace culture. Ready to be inspired? Learn more at&nbsp;<a href=\"https://www.ukg.com/careers\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 81, 81);\"><strong>www.ukg.com/careers</strong></a></p><p><strong>EEO Statement</strong></p><p><strong>Equal Opportunity Employer</strong></p><p>Ultimate Kronos Group is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.&nbsp;</p><p>View&nbsp;<a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 81, 81);\"><strong>The EEO is the Law poster</strong></a>&nbsp;and its&nbsp;<a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 81, 81);\"><strong>supplement</strong>.</a>&nbsp;</p><p>View the&nbsp;<a href=\"https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_%20English_formattedESQA508c.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 81, 81);\"><strong>Pay Transparency Nondiscrimination Provision</strong></a></p><p>UKG participates in E-Verify. View the E-Verify posters&nbsp;<a href=\"https://www.e-verify.gov/sites/default/files/everify/posters/EVerifyParticipationPoster.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 81, 81);\"><strong>here</strong></a>.</p><p><strong>Colorado Pay Law</strong></p><p>If you are a Colorado resident and this role is available in Colorado or remote, you may be eligible to receive additional information about the compensation and benefits for this role, which we will provide upon request.&nbsp;Please send an email to&nbsp;<a href=\"mailto:UKGcareers@ukg.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 81, 81);\"><strong>UKGcareers@ukg.com</strong></a><strong>&nbsp;</strong></p><p><strong>Disability Accommodation</strong></p><p>For individuals with disabilities that need additional assistance at any point in the application and interview process, please email&nbsp;<a href=\"mailto:UKGCareers@ukg.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 81, 81);\">UKGCareers@ukg.com</a>&nbsp;or please call&nbsp;<span>1 (978) 250 9800.</span></p><p></p>",
    "apply": "https://careers.ukg.com/careers/JobDetail/Senior-Business-Project-Manager/39451",
    "company": "/companies/ukg",
    "cName": "UKG",
    "location": "USA",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Tag Management Consultant",
    "description": "<p></p><p>InfoTrust was started with one mission - to build the best place to work and all other things would fall into place. This mission has proven to be very successful, as shown by our multiple best places to work awards, our amazing eNPS (94), our significant impact to our community through the InfoTrust&nbsp;<a href=\"https://infotrust.com/articles/infotrust-foundation-intro/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">Foundation</a>, and our happy clients with a<a href=\"https://infotrust.com/articles/turning-clients-into-fans-net-promoter-score-update/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">&nbsp;NPS of 74</a>&nbsp;and strong employee retention rates.&nbsp;</p><p>At InfoTrust, we are extremely proud of&nbsp;<a href=\"https://infotrust.com/who-we-are/culture-core-values/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">our core values</a>, particularly our insistence on continuously innovating and growing our expertise within the analytics space.&nbsp;One of those innovations was the creation of our Consumer Data Governance team (CDG) just a few years ago. Due to the CDG team’s expertise in the field today, we are now looking to expand the team with two openings for a Tag Management Analyst with Tealium experience.</p><p>The&nbsp;<strong>Tag Management Consultant</strong>&nbsp;is equal parts technical and equal parts consulting. As an advocate for a strong tag management strategy, you will work with clients to strategize, complement, and support their data governance process.&nbsp;</p><p>If you are unfamiliar with tag and data governance,&nbsp;<a href=\"https://infotrust.com/tag-governance/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">check out this site</a>.</p><p><strong>Responsibilities of the Tag Management Consultant:</strong></p><ul><li>Working with clients to support their marketing tagging needs to support their marketing initiatives</li><li>Providing guidance internally and externally regarding the best practices in digital analytics as it relates to tag management (tools such as Google Tag Manager, Adobe Launch, Tealium, and more)</li><li>Management of client’s ticketing systems such as JIRA and working with different departments to gather all the technical requirements of a tagging request</li><li>Implementation of tagging best practices and tag governance by working with the organization's Tag Governance team</li><li>Advocating the usage of InfoTrust's proprietary tool, Tag Inspector, in making sure that the state of tag implementation is working as expected</li><li>Working with the Product team to provide feedback about the product. Often collaborate within the internal Customer Data Governance, Product, and Delivery and Analytics teams</li><li>Creation of documentation about processes, inventory of tags, and status updates regarding the client engagement</li><li>Constantly provide open communication with the client, offering amazing support, thought leadership, and expertise in the cutting edge (and very important) space of data governance</li></ul><p><strong>The successful Tag Management Analyst will have the following background and skills:</strong></p><ul><li>2 years of experience with tag management systems. You can exemplify a strong grasp on how to implement, maintain, and use tag management systems to assist clients with their marketing strategies</li><li>You are familiar with, or willing to learn more about, privacy and data protection&nbsp;<a href=\"https://infotrust.com/articles/comparison-of-gdpr-and-ccpa/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(41, 117, 202);\">laws and regulations</a>. Additionally, you are familiar with how to apply data governance for the needs of large, multi-brand sites</li><li>You have experience working with clients and exemplifying great communication and rapport with clients to ensure satisfaction, understanding, and collaboration</li><li>When working with clients, you have exemplified project management and delivery skills&nbsp;</li><li>You are driven, looking for ways to constantly learn&nbsp;</li><li>You are resourceful and able to pivot quickly, as needed</li><li>You are known for helping clients be more efficient and apply best practices for governance process&nbsp;</li><li>You enjoy a collaborative environment where you're enabled to do your best work and make an impact</li></ul><p><strong>Nice to have:</strong></p><ul><li>Although it is not required, it would be nice if the Tag Management Consultant has experience with tag governance and building process and plans related to tag governance strategy</li><li>It would be nice to be relocated close to our offices in Cincinnati, OH or Chicago, IL, but we are open to a fully remote position within the United States or Toronto, Ontario</li></ul><p><strong>Location:&nbsp;</strong></p><p>Currently, returning to the office is optional for our Cincinnati and Chicago employees. We are open to someone working fully remote from within the US or Toronto, Ontario, Canada. Must be authorized to work in US or Canada for any employer.</p><p><strong>Additional benefits:&nbsp;</strong></p><p>Other than an awesome culture and team mates we also offer: 100% employer paid medical, dental and vision insurance (seriously), Unlimited PTO, flexible work schedule, a generous parental leave policy, 401K with company match, tuition reimbursement, gym reimbursement and much, much more.</p><p><strong>Diversity is one of our 6 core values at InfoTrust:</strong></p><p>InfoTrust is committed to a diverse workforce and we are an equal opportunity employer. We want strong, diverse teams built from different backgrounds, experiences and identities. We are building an inclusive, supportive place for you to do the best work of your career.</p><p></p>",
    "apply": "https://boards.greenhouse.io/infotrust/jobs/5159069003",
    "company": "/companies/infotrust",
    "cName": "InfoTrust",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Business Consultant",
    "description": "<p></p><p><strong>WE EXPECT YOU TO WIN:&nbsp;&nbsp;</strong></p><p>Everyone at Metova is given the tools and resources they need to succeed at their job.&nbsp;We offer a flexible and positive work environment so you have the autonomy to build amazing software for our customers and add to our team of industry leading visionaries.&nbsp;We are lean, which means we reflect on what we learn and use that new knowledge to quickly make better products.&nbsp;Your job is to keep learning, contribute your knowledge back to the rest of the team, and apply what you learn to make Metova and our clients even greater.</p><p><strong>YOUR OPPORTUNITY:&nbsp;&nbsp;&nbsp;&nbsp;</strong></p><p>Metova is hiring for a Business Consultant in collaboration with our partner, Mavenlink.&nbsp;The Business Consultant plays an integral part of our team ensuring that each customer is delighted with the Metova experience that they receive.</p><p><strong>WHAT YOU WILL DO:&nbsp;</strong>&nbsp;</p><p>As a Business Consultant, you will drive the strategy and design of the client solution to provide a Remarkable Client Experience.&nbsp;These responsibilities include:</p><ul><li>Providing tailored best practices and approaches to complex use cases, developing a configuration and business process strategy and managing the Mavenlink implementation process</li><li>Work with clients to help them achieve operational excellence in their services delivery by implementing Mavenlink’s cloud-based solution that allows services driven organizations to effectively manage their entire project delivery lifecycle</li><li>Facilitate design and configuration sessions and provide business recommendations to ensure our clients experience value through the Mavenlink solution</li><li>Work with other team members to design the client’s Mavenlink solution including core product configuration, custom reporting, integration with 3rd party applications such as Salesforce.com and JIRA and conversions of data from legacy systems into Mavenlink</li><li>Develop and provide services industry domain expertise as it relates to Mavenlink’s world-class software solution</li><li>Continuously and consistently drive a Remarkable Client Experience!</li></ul><p><strong>RESPONSIBILITIES:</strong></p><ul><li>Identify, assess and solve complex business problems. Understand our clients’ business requirements and objectives while ensuring alignment with the Mavenlink solution to drive desired business result&nbsp;&nbsp;</li><li>Assist or drive other deployment activities such as requirements gathering, functional design, system testing, user acceptance testing, issue troubleshooting and resolution, change management and training</li><li>Work across internal teams to perform the full design of Mavenlink required for the deployment of the solution including core configuration, custom reports,&nbsp;integrations and data migrations</li><li>Contribute to an environment that fosters collaboration and teamwork through sharing experiences, information, perspectives, skills and expertise</li><li>Actively participate in the ongoing improvement of the Mavenlink product suite and the services implementation methodology&nbsp;&nbsp;</li><li>Build and share repeatable processes and quality deliverables that may be leveraged across multiple projects to increase speed and reduce costs</li><li>Be a mentor and coach to other team members</li><li>Contribute to the collective learning of Mavenlink.&nbsp;Seek out opportunities to identify and disseminate improvements to organizational methodology, processes and practices</li><li>Contribute to the consultant tool set by identifying trends and support internal documentation, development projects and process improvements</li></ul><p><strong>YOUR QUALIFICATIONS:&nbsp;&nbsp;</strong></p><ul><li>Two years of progressive experience working in a client-facing role at a consulting firm or software company</li><li>Experience leading solution design workshops, defining business needs and proposing business processes</li><li>Experience implementing software solutions, in the project/software delivery lifecycle and in executing project plans to produce quality client deliverables</li><li>Experience in the areas of financial reporting, business intelligence and key performance metrics&nbsp;&nbsp;</li><li>Knowledge related to managing and tracking project ROI metrics with experience in the presentation of financial dashboards or scorecards</li><li>Previous services industry experience and/or experience working with a Professional Services Automation (PSA) solution is a plus</li><li>Possesses technical skills and project implementation experience designing, configuring and deploying SaaS-based software solutions</li><li>Proficient in the use of standard business applications and specialized in-house and customer systems</li><li>Broad technical knowledge of internet based products and technologies</li><li>Programming fundamentals and experience with relational databases and data analysis is a plus</li><li>Broad technical knowledge of internet based products and technologies&nbsp;</li><li>Bachelor’s Degree in Business Administration, Finance, Statistics, Information Quality, Information Systems, Data Science or related area of study</li></ul><p><strong>We consider it a plus if you have experience with:&nbsp;&nbsp;&nbsp;</strong></p><ul><li>Familiarity of cloud-based and on-premise applications and architectures - web services, APIs and XML/JSON data structures is a plus</li></ul><p><strong>ABOUT US:</strong></p><p>Founded in 2006, Metova has a long history of providing cutting edge technology solutions to clients across a variety of industries. Today, Metova specializes in software and application development for web based solutions, iOS, and Android. Working at Metova allows you to not only provide your strategic and technical expertise to others, but also continued personal development through internal career development curriculum, cross-training programs with fellow employees, and challenging projects solving real-world issues. We are a growing company looking for thought leaders who want to revolutionize industries to join our team.&nbsp;</p><p>We offer a work environment that also works for you through remote teams, flexible schedules, open PTO policy, and a flat organization that embraces the diverse backgrounds and skill sets across our teams to continue to drive Metova forward on our path to success. We offer a competitive salary, dental, vision, and health plans, and a matching 401(k) program.&nbsp;</p><p>Metova is interested in every qualified candidate who is eligible to work and reside in the United States. However, we will not consider applicants who are not U.S. citizens, U.S. nationals, lawful permanent residents, asylees, or refugees.</p><p>Metova, Inc. is an Affirmative Action and Equal Opportunity Employer.&nbsp;&nbsp;</p><p></p>",
    "apply": "https://metova.com/open-job-positions/",
    "company": "/companies/metova",
    "cName": "Metova",
    "location": "Remote",
    "type": "full-time",
    "category": "business-management"
  },
  {
    "title": "Clinical Product Manager",
    "description": "<p></p><p>Welcome to Allscripts! Our Mission is to be the most trusted provider of innovative solutions that empower all stakeholders across the healthcare continuum to deliver world-class outcomes. Our Vision is a Connected Community of Health that spans continents and borders. With the largest community of clients in healthcare, Allscripts is able to deliver an integrated platform of clinical, financial, connectivity and information solutions to facilitate enhanced collaboration and exchange of critical patient information.</p><p><strong>Overview</strong></p><p>Veradigm, an Allscripts business, offers real world evidence with the largest patient-level electronic health records (EHR) research database (Health Insights), registries (PINNACLE, Diabetes Collaborative Registry), analytic platform (Evalytica), and retrospective and prospective research services.&nbsp;</p><p><strong>Job Summary</strong></p><p>Delivers on product roadmap priorities to achieve time to market and time to value targets by managing the product development lifecycle for a given product(s) through proven technical leadership. The type of budget responsibility or revenue responsibility, i.e. project profitability, sales revenue, training budget, etc.</p><p><strong>Essential Functions</strong></p><ul><li>Gather and incorporate data, research, market analysis, and client analysis to inform product strategies and roadmaps</li><li>Have experience in healthcare working on EHR data,&nbsp;and client (internal/external) facing platforms or pharmaceutical industry</li><li>Enjoy analyzing product performance and competitive landscapes to identify unserved needs and high impact market opportunity</li><li>Is adaptable in response to changing requirements and ambiguous business problems while staying true to core principles</li><li>Gather and analyze information quickly to problem solve, develop compelling recommendations, and drive decision-making effectively</li><li>Are experienced socializing new product concepts and quickly building alignment on fast-moving projects</li><li>Enjoy working cross-functionally with the product, engineering, marketing, and sales teams to recommend product enhancements</li><li>Are comfortable working on a high-performance team towards a multi-year vision with incremental deliverables</li><li>Are an entrepreneurial self-starter, curious about both technology and business, and driven by delivering end-user value and impact</li><li>Helpful: you have data management and analysis experience</li></ul><p><strong>Responsibilities</strong></p><ul><li>The successful candidate will own the product vision and roadmap for a team on our Healthcare Clinical Workflows Initiative</li><li>Own aligning our business strategy and metrics with our product development efforts and leading an engineering team from design through successful rollout</li><li>Manage and drive projects with high technical risk and high coordination complexity</li><li>Create detailed roadmaps, prioritize relentlessly, and communicate trade-offs internally</li><li>Identify and fix process gaps around execution, roll-out, and ongoing support of software projects</li></ul><p><strong>Qualifications</strong></p><ul><li>You’ve At least 3 years of experience in a software, SaaS, or systems development environment</li><li>You’ve At least 4 years of working with managing and building products</li><li>You’ve experience with healthcare operations, information technology applications, data integration and interoperability, analytics, and standards</li><li>You’ve deep understanding of ambulatory clinical workflows</li><li>You’ve experience in writing clinical development and production release requirements</li><li>Strong technical aptitude and an ability to understand technical designs, challenges, and risks</li><li>Strong understanding of technical architecture</li><li>Understanding of HIPAA stat cert</li><li>Own aligning our business strategy and metrics with our product development efforts and leading an engineering team from design through successful rollout</li><li>curious, empathetic, passionate and collaborative problem-solver who seeks and gives candid feedback, and values the chance to make an important impact</li><li>strong project management skills and excellent organizational and communication skills</li><li>You are skilled at gathering qualitative and quantitative insight to inform decision making</li><li>You have strong verbal communication skills and your written communication is top notch</li><li>You're excited by the prospect of rolling up your sleeves to tackle meaningful problems each and every day</li><li>You can flex between the strategic vision and the details of execution gracefully and relish time in both ways of thinking</li><li>You have BA/BS degree in a technical field, or equivalent practical experience</li></ul><p>Must have received or be willing to receive the COVID-19 vaccine by date of hire to be considered for employment with Allscripts.</p><p>Visa Sponsorship is not offered for this position.</p><p>At Allscripts, our greatest strength comes from bringing together talented people with diverse perspectives to support the technology needs of 180,000 physicians, 1,500 hospitals and 10,000 postacute organizations across the globe. Allscripts offers a comprehensive compensation and benefits package, including holidays, vacation, medical, dental, and vision insurance, company paid life insurance and retirement savings.</p><p>Allscripts’ policy is to provide equal employment opportunity and affirmative action in all of its employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation or gender identity or expression or any other legally protected category. Applicants for North American based positions with Allscripts must be legally authorized to work in the United States or Canada. Verification of employment eligibility will be required as a condition of hire. Allscripts is proud to be an equal opportunity workplace dedicated to pursing and hiring a diverse and inclusive workforce.</p><p>From a \"VEVRAA Federal Contractor\" We request Priority Referral of Protected Veterans</p><p>This is an official Allscripts Job posting.&nbsp;To avoid identity theft, please only consider applying to jobs posted on our official corporate site.</p><p>Thank you for reviewing this Allscripts opportunity!&nbsp;Does this look like a great match for your skill set?&nbsp;If so, scroll on down and tell us more about yourself!&nbsp;</p><p></p>",
    "apply": "https://careers.allscripts.com/jobs-us/",
    "company": "/companies/allscripts",
    "cName": "Allscripts",
    "location": "USA",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Senior Product Manager",
    "description": "<p></p><p><strong>Who is Litmus?</strong></p><p>Litmus’s email creation, testing, and analytics platform empowers marketers, designers, and agencies to confidently deliver quality, brand-aligned communications that delight and engage consumers. Over the last 10+ years, we’ve built a reputation as thought leaders and one of the most trusted solutions in the industry, and it shines through our customers – all 250,000 of them, representing the world’s top brands in tech, banking &amp; finance, retail, media, and more.&nbsp;</p><p>And with our newest acquisition of Kickdynamic,&nbsp;<em>an AI-driven personalization and content automation solution</em>, we are now leaders in email marketing personalization.</p><p><em>How do we do this?</em>&nbsp;It all starts with our people, and a core belief that the talent we seek should be a culture&nbsp;<strong><em>add</em></strong>&nbsp;rather than a “culture fit”.</p><p><strong>What would I do at Litmus?</strong></p><p>As a Senior Product Manager, you will own a product area and drive strategy, roadmap, execution, and collaborate on go-to-market. You’ll work closely with team members from UX, Engineering, Marketing, Finance, and Sales to conceive and execute the Litmus product experience.</p><p><em>On any given day you might be:</em></p><ul><li>Conducting discovery research or testing a new user experience with Litmus customers</li><li>Analyzing product KPIs and reviewing learnings with team members</li><li>Briefing design and engineering teams on product opportunities</li><li>Organizing collaborative ideation sessions with cross-functional partners</li><li>Presenting business cases to executive leaders and stakeholders</li><li>Collaborating on a product launch with product marketing</li><li>Communicating the roadmap to internal stakeholders</li></ul><p><strong>What is Litmus looking for in a candidate?</strong></p><ul><li>Enterprise software experience;&nbsp;<strong>content personalization and email marketing</strong>&nbsp;product experience highly desirable</li><li>Previous ownership of product roadmaps that support and balance objectives such as user success and revenue growth through data-driven prioritization</li><li>Ability to break down complex problems and identify opportunities to deliver incremental value</li><li>Creates and holds a clear vision and strategy to set the direction for their product team and drive the appropriate product outcomes</li><li>Excellent verbal and written communication skills and the ability to tailor communication and information to different audiences</li><li>Strong understanding of UX design practices and concepts such as user research/testing, information architecture, and common software UI patterns</li><li>Ability to define KPIs and understand and interpret data and analytics to drive decision-making and measure product outcomes</li></ul><p><strong>Why should I choose Litmus?</strong></p><ul><li>We offer everything you’d expect from a profitable company that’s been going strong for 10+ years, including a great salary and stock options, comprehensive health care benefits, and a generous retirement plan match&nbsp;</li><li>You’ll receive 28 days of paid vacation—on top of team retreats and public holidays</li><li>A platform for good: Affinity Groups, a culture of Diversity, Equity &amp; Inclusion, and volunteer days—creating belonging for&nbsp;<em>all</em>&nbsp;is in our DNA both inside and outside of work #bebeyondlitmus</li><li>Remote-friendly culture. No matter where you are, you’ll feel connected to the team</li><li>Over half of our employees work remotely in the U.S. and UK and your work experience is just as exciting, entertaining (!), and engaging&nbsp;</li><li>We take family seriously and offer flexible schedules and generous parental leave programs</li><li>We give you great tools and tech to do your best work: Hardware, software, and home- and office setups</li></ul><p><strong><em>Not sure if you meet all the requirements?</em>&nbsp;</strong>Please apply! We know there is no job description that can measure a person’s attitude, aptitude, or amplitude (the ability to turn it up a notch) and highly encourage you to apply.&nbsp;</p><p>Our approach is shaped by a strong respect for each individual. This applies to every aspect of employment – from equitable wages, work-life balance, the freedom to be your whole self, to equal opportunities for growth and development at Litmus. We believe wholeheartedly the more inclusive we are, the better our work will be.</p><p></p>",
    "apply": "https://www.litmus.com/careers-list/",
    "company": "/companies/litmus",
    "cName": "Litmus",
    "location": "Remote",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Product Manager",
    "description": "<p></p><p>Join us in our mission to connect the world through games and to delight consumers with exhilarating social gaming experiences! Zynga is looking for a dedicated and passionate Product Manager who can own projects, drive results and directly impact business performance of large-scale games. As Product Manager, you will work closely with a cross functional group to write product specifications, drive features through launch and understand metrics to make data driven decisions.</p><p><strong>MAIN RESPONSIBILITIES:&nbsp;</strong></p><ul><li>Responsible for the full product/game lifecycle. Own and write product specifications while working in multi-disciplinary teams of design, art, and engineering to launch core features within existing and new games!</li><li>Communicate clearly with cross-functional team members.</li><li>Advise and execute against defined product strategy on a feature or project level.</li><li>Understand core metrics. Use a hypothesis based analytical approach, conduct experimentation.</li><li>Own results of individual features/projects and consistently manage against defined expectations.</li></ul><p><strong>DESIRED SKILS AND EXPERIENCE:</strong></p><ul><li>2+ years of experience in product management in consumer web or game development is preferred but not required</li><li>Ability to deconstruct competing feature sets and understand the market landscape.</li><li>Capable of building relationships and earning respect of cross-functional team.</li><li>Strong community focus. You’re someone who interprets community feedback into digestible insights for the team and incorporates community feedback into product requirements and improvements.</li><li>Ability to build wire-frames and product specifications.</li><li>Passion for games and crafting fun, compelling and exciting user experiences</li><li>Outstanding written/oral, organizational, analytical abilities, and attention to detail</li><li>BA/BS degree</li></ul><p><strong>WHAT WE OFFER YOU:</strong></p><ul><li>Competitive salary, bonus plan, Take-Two RSU’s (Restricted Stock Units), ESPP (Employee Stock Purchase Plan)</li><li>401K Company Match Contribution (US)</li><li>RRSP Company Match Contribution (Canada)</li><li>Extended Health coverage, dental, disability, critical illness, EAP, and life insurance (Canada)</li><li>Medical, dental, vision, EAP, life insurance, and disability benefits (US)</li><li>Virtual mental health and neurodiversity support programs</li><li>Fitness benefits (offering varies by location)</li><li>Financial wellness program with unlimited access to certified financial planners</li><li>Discretionary Time Off policy for many employees</li><li>Family planning support program</li><li>Generous paid maternity/parental leave</li><li>Subsidized Back-up child care</li><li>Zynga happy hours and frequent employee events</li><li>Flexible working hours on many teams</li><li>Culture of diversity and inclusion including employee resource groups</li><li>Work with cool people and impact millions of daily players</li></ul><p><strong>HIRING UPDATE:</strong>&nbsp;The safety of our candidates and team members is our top priority. During the COVID-19 pandemic, our workforce transitioned to working from home, with all interviewing and onboarding being conducted virtually until further notice.</p><p>We are an equal opportunity employer and we are committed to building a diverse and talented workforce. We do not discriminate on the basis of race, sex, religion, colour, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, medical condition, disability, or any other class or characteristic protected by applicable law. We welcome job-seekers, players, employees, and partners from all backgrounds to join us!</p><p>We will consider all qualified job-seekers with criminal histories in a manner consistent with applicable law.</p><p>We are committed to providing reasonable accommodations to qualified individuals with physical or mental disabilities in order to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us at&nbsp;<a href=\"mailto:AccommodationRequest@zynga.com\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(220, 6, 6);\">AccommodationRequest@zynga.com</a>&nbsp;to request an accommodation associated with your application for an open position.</p><p>Zynga does not&nbsp;engage in financial exchanges during the recruitment or onboarding process. We do not conduct job interviews over third-party messaging apps such as Telegram, WhatsApp or others. We will never ask you for your personal or financial information over unofficial chat channels. Our in-house recruitment team only contacts individuals via official company email addresses (i.e., via a zynga.com or naturalmotion.com email domain).</p><p>If you believe you have been the victim of a scam, you may wish to contact the authorities. In the United States, you may file a complaint with the FBI. More information is available here:&nbsp;<a href=\"https://www.ic3.gov/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(220, 6, 6);\">https://www.ic3.gov</a>.</p><p><strong>CAREERS CATEGORY:</strong>&nbsp;Product Management</p><p><strong>CAREERS LOCATION:</strong>&nbsp;Austin, TX, Remote, US, Remote, Canada, Toronto, Canada</p><p><strong>CONNECTED WORKER TYPE:</strong>&nbsp;Connected, Onsite, Offsite</p><p><strong>REQUISITION ID:</strong>&nbsp;P211328</p><p></p>",
    "apply": "https://www.zynga.com/job-listing/product-manager-p211328/",
    "company": "/companies/zynga",
    "cName": "Zynga",
    "location": "US + Canada",
    "type": "full-time",
    "category": "product"
  },
  {
    "title": "Client Support Manager II",
    "description": "<p></p><p><strong>About Lumen</strong></p><p>Lumen is guided by our belief that humanity is at its best when technology advances the way we live and work. With 450,000 route fiber miles serving customers in more than 60 countries, we deliver the fastest, most secure global platform for applications and data to help businesses, government and communities deliver amazing experiences. Learn more about Lumen’s network, edge cloud, security and communication and collaboration solutions and our purpose to further human progress through technology at news.lumen.com, LinkedIn: /lumentechnologies, Twitter: @lumentechco, Facebook: /lumentechnologies, Instagram: @lumentechnologies and YouTube: /lumentechnologies.</p><p><strong>The Role</strong></p><p>The primary responsibility of the Client Support Manager is to provide sales and sales support for complex communications product solutions (data, voice, IP, etc.) for Lumen customers. The Client Support Manager is a key member of a Sales team, who is responsible for customer life cycle management and retention.&nbsp;As a primary interface with both internal and external customers, the Client Support Managers service and skills make a positive contribution to the strength of Lumen’s relationship within&nbsp;our&nbsp;accounts.</p><p><strong>The Main Responsibilities</strong></p><p><span>Complete service orders in a legible, accurate and timely manner.</span></p><ul><li><span>Interact effectively as a team member within a Commercial Account Team organization to support achievement of sales objectives and deliver Lumen’s Spirit of Service.</span></li><li><span>Partner with Sales, Service and Support personnel to strategically support accounts.</span></li><li><span>Make accurate and timely decisions based on customer needs and business requirements.</span></li><li><span>Develop, maintain and manage customer relationships from the operational to executive levels throughout the organization.</span></li><li><span>Ability to contribute to the attainment of revenue objectives by managing orders from the sales stage through to accurate billing and revenue recognition.</span></li><li><span>Ability to effectively represent Lumen to multiple departments and levels within the Account, by understanding how Lumen’s products meet their goals.</span></li><li><span>Project Management of the activities of multiple Lumen departments such as Contracts, Pricing, Order Entry, Provisioning, Design, Installation and Billing on behalf of Lumen Customer to install new service, or to coordinate moves, adds or changes to existing service.</span></li></ul><p><strong>What We Look For in a Candidate</strong></p><ul><li>5-7 years experience in a Telecommunications customer-facing environment supporting Enterprise Customers.&nbsp;</li><li>Experience in developing long-term business relationships with key decision makers within organizations, with a proven knowledge of the sales cycle.</li><li>An ability to work closely with the customer and effectively negotiate directly with the customer and internally on their behalf.</li><li>Drive balanced communication with tact and diplomacy, while juggling competing customer &amp; company priorities.</li><li>Extensive knowledge of new technologies and selling points which includes enhancing expertise in the company's product application technologies.</li><li>Strong understanding of IP Products and Services.</li><li>Experience in teaming effectively with others across different disciplines, functions and organizations.</li><li>Strong written, oral communication skills to include presentation skills, interpersonal skills, and a professional business image.</li><li>Ability to multi task and meet multiple timelines.</li><li>The ability to travel to customer sites.</li><li>Working knowledge of the applicable tools &amp; techniques of customer support within telecommunications.</li><li>Working knowledge of MS Office suite.</li></ul><p>Requisition #: 298131</p><p><strong><u>EEO Statement</u></strong></p><p>We are committed to providing equal employment opportunities to all persons regardless of race, color, ancestry, citizenship, national origin, religion, veteran status, disability, genetic characteristic or information, age, gender, sexual orientation, gender identity, marital status, family status, pregnancy, or other legally protected status (collectively, “protected statuses”).&nbsp;We do not tolerate unlawful discrimination in any employment decisions, including recruiting, hiring, compensation, promotion, benefits, discipline, termination, job assignments or training.</p><p><strong><u>Disclaimer</u></strong></p><p>The above job definition information has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.&nbsp;Job duties and responsibilities are subject to change based on changing business needs and conditions.</p><h4><strong>Salary Range</strong></h4><p>Salary Min :48465Salary Max :107700</p><p>This information reflects the anticipated base salary range for this position based on current national data. Minimums and maximums may vary based on location. Individual pay is based on skills, experience and other relevant factors.</p><p>This position is eligible for either short-term incentives or sales compensation. Director and VP positions also are eligible for long-term incentive. To learn more about our bonus structure, you can view additional information<a href=\"https://jobs.lumen.com/global/en/compensation-information\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\"><u>&nbsp;here.</u></a>&nbsp;We're able to answer any additional questions you may have as you move through the selection process.</p><p>As part of our comprehensive benefits package, Lumen offers a broad range of Health, Life, Voluntary Lifestyle and other benefits and perks that enhance your physical, mental, emotional and financial wellbeing. You can learn more by clicking&nbsp;<a href=\"https://centurylinkbenefits.com/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 0);\"><u>here.</u></a></p><p>Note: For union-represented postings, wage rates and ranges are governed by applicable collective bargaining agreement provisions.</p><p></p>",
    "apply": "https://jobs.lumen.com/global/en/job/298131/Client-Support-Manager-II",
    "company": "/companies/lumen",
    "cName": "Lumen",
    "location": "USA",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Sr Customer Support Representative",
    "description": "<p></p><p><strong>Job Description :&nbsp;</strong></p><p><strong>JOB SUMMARY</strong></p><p>This job provides new and existing customers with the best possible service in relation to billing inquiries, service requests, suggestions and complaints.</p><p>Assists the department in meeting quality and production standards.&nbsp;Responds to members, providers, group administrators and producers in an accurate and timely manner, ensuring acceptable service levels, metrics and/or performance guarantees are achieved.</p><p><strong>ESSENTIAL RESPONSIBILITIES</strong></p><ul><li>Responds to members, providers, group administrators and producers in an accurate and timely manner.</li><li>Manage multiple production oriented tasks and responsibilities</li><li>Ensures acceptable service levels, metrics and/or performance guarantees are achieved.</li><li>Other duties as assigned or requested.</li></ul><p><strong>QUALIFICATIONS</strong></p><p><strong>Minimum</strong></p><ul><li>High School Diploma / GED</li><li>5-10 years of related, progressive experience</li></ul><p><strong>Preferred</strong></p><ul><li>None</li></ul><p><strong>Knowledge, Skills and Abilities</strong></p><ul><li>None</li></ul><p><strong>SCOPE OF RESPONSIBILITY</strong></p><p>Does this role supervise/manage other employees?&nbsp;&nbsp;&nbsp;</p><p>No&nbsp;</p><p><strong>WORK ENVIRONMENT</strong></p><p>Is Travel Required?</p><p>No&nbsp;</p><p><strong><em>Disclaimer:&nbsp;</em></strong><em>The job description has been designed to indicate the general nature and essential duties and responsibilities of work performed by employees within this job title. It may not contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees to do this job.</em></p><p><strong><em>Compliance Requirement:&nbsp;</em></strong><em>This position adheres to the ethical and legal standards and behavioral expectations as set forth in the code of business conduct and company policies</em></p><p>Highmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, national origin, sexual orientation/gender identity or any other category protected by applicable federal, state or local law. Highmark Health and its affiliates take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, sexual orientation/gender identity, protected veteran status or disability.</p><p>Highmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, age, religion, sex, national origin, sexual orientation/gender identity or any other category protected by applicable federal, state or local law. Highmark Health and its affiliates take affirmative action to employ and advance in employment individuals without regard to race, color, age, religion, sex, national origin, sexual orientation/gender identity, protected veteran status or disability.&nbsp;</p><p>EEO is The Law</p><p>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled/Sexual Orientation/Gender Identity (&nbsp;<a href=\"https://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 124, 173);\"><em>https://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf&nbsp;</em></a>)</p><p>We endeavor to make this site accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact number below.</p><p>For accommodation requests, please contact HR Services Online at&nbsp;<span>HRServices@highmarkhealth.org</span></p><p><a href=\"https://careers.highmarkhealth.org/media/sg0ccxmk/ccpa-notice.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 124, 173);\">California Consumer Privacy Act Employees, Contractors, and Applicants Notice</a></p><p></p>",
    "apply": "https://careers.highmarkhealth.org/explore-jobs/job/j206287-senior-customer-support-representative-remote-flex/",
    "company": "/companies/highmark",
    "cName": "Highmark",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Desktop Support II",
    "description": "<p></p><p>Are you looking for a hybrid or remote work opportunity?&nbsp;Are you ready for&nbsp;a workplace&nbsp;that&nbsp;provides benefits that suit your needs? Do you seek a workplace where you grow and transform your career?&nbsp;</p><p>We are Relativity. A market-leading, global tech company that equips legal and compliance professionals with a powerful platform to organize data, discover the truth, and act on it. The US Department of Justice, 199 of the Am Law 200, and more than 329,000 enabled users trust Relativity during litigation, internal investigations, and compliance projects.&nbsp;</p><p>Our SaaS product, RelativityOne, has become the fastest-growing product in the company's history and we have consistently been named a great workplace. As we grow, we continue to seek individuals that will bring their whole, authentic self to our team.&nbsp;</p><p>The IT Operations Support team manages all IT-related service requests from employees. The Desktop Support (Analyst) II provides computer, device, hardware, software, storage, networking and operation support to company employees, with in-depth knowledge of desktops, communications systems, and a high level of customer support expertise. You will be an escalation point for Desktop Support I. This role will report into the Manager of IT Operations.&nbsp;This is a hybrid role based in Chicago, IL.</p><p><strong>Your Role in Action:</strong></p><ul><li class=\"ql-indent-1\">Oversee new employee device set ups, user accounts, and access to resources</li><li class=\"ql-indent-1\">Help manage hardware and software assets and inventory (SCCM and JAMF)</li><li class=\"ql-indent-1\">Manage onboarding, off-boarding, knowledge base article creation, and training around our collaboration and communication tools for end-users and end-user support personnel</li><li class=\"ql-indent-1\">Help create SOPs to help all employees to make the best use of our supplied tools</li><li class=\"ql-indent-1\">Be an escalation point for service desk and desktop support requests</li><li class=\"ql-indent-1\">Respond to requests for assistance and contribute to an online knowledge base to enhance end-user knowledge base</li><li class=\"ql-indent-1\">Provide remote on-call support on assigned shift coverage</li><li class=\"ql-indent-1\">Troubleshoot deployments, view logs and provide support for managed devices and systems including Microsoft Endpoint Manager, SCCM and JAMF</li><li class=\"ql-indent-1\">Office infrastructure support; network, desktop hardware (docks, monitors) and print servers</li><li class=\"ql-indent-1\">Work with team leadership to plan upgrades, deployments, and project-based work</li><li class=\"ql-indent-1\">Assist with inventory management and ordering with our vendors</li><li class=\"ql-indent-1\">Stay up to date with new hardware products relevant to our workstations</li><li class=\"ql-indent-1\">Assist with troubleshooting advanced android and iOS issues (software only)</li><li class=\"ql-indent-1\">Track all help desk interactions</li><li class=\"ql-indent-1\">Demonstrate commitment to core company values</li></ul><p><strong>Your Skills:</strong></p><ul><li class=\"ql-indent-1\">3+ years of experience</li><li class=\"ql-indent-1\">Experience explaining technical concepts in non-technical terms to ensure end-user understanding</li><li class=\"ql-indent-1\">Knowledge of general operating systems (e.g., Windows 10, OS X, iOS, Android)</li><li class=\"ql-indent-1\">Knowledge of general desktop hardware, software, modern browsers and networking concepts.</li><li class=\"ql-indent-1\">Experience providing support for enterprise applications such as Zoom, Slack, Workday, Okta, and Tableau</li><li class=\"ql-indent-1\">Experience with Apple device solutions (e.g., iPads, Macbook Pro, iMac) and Apple/Windows deployment technologies.</li><li class=\"ql-indent-1\">Knowledge of ITIL Foundations</li><li class=\"ql-indent-1\">Implement logical, progressive troubleshooting processes</li></ul><p>Relativity is a diverse workplace with different skills and life experiences—and we love and celebrate those differences. We believe that employees are happiest when they're empowered to be their full, authentic selves, regardless how you identify.</p><p><strong><u>Benefit Highlights:</u></strong></p><p>Comprehensive health, dental, and vision plans</p><p>Parental leave for primary and secondary caregivers</p><p>Flexible work arrangements</p><p>Two, week-long company breaks per year</p><p>Unlimited time off</p><p>Long-term incentive program</p><p>Training investment program</p><p><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.</em></p><p></p>",
    "apply": "https://jobs.lever.co/relativity/2c467c14-5597-4762-9231-bc7c4b91cd74",
    "company": "/companies/relativity",
    "cName": "Relativity",
    "location": "Remote",
    "type": "full-time",
    "category": "customer-service"
  },
  {
    "title": "Contracts Specialist",
    "description": "<p></p><p><strong>How will you make an impact?</strong></p><p>As part of the Thermo Fisher Scientific team, you’ll discover meaningful work that makes a positive impact on a global scale. Join our colleagues in bringing our Mission to life every single day to enable our customers to make the world healthier, cleaner and safer. We provide our global teams with the resources needed to achieve individual career goals while helping to take science a step beyond by developing solutions for some of the world’s toughest challenges, like protecting the environment, making sure our food is safe or helping find cures for cancer.</p><p>This role can be based at our sites in Carlsbad, CA (San Diego area), Waltham, MA (Boston area), South San Francisco, Hillsborough, OR (Portland area) or Austin, TX. Other locations, including remote, may be considered for experienced candidates.</p><p><strong>What will you do?</strong></p><p>As a part of Thermo Fisher’s Intellectual Property team, you will enable biotech and large pharma customers to deliver breakthrough medicines to patients. You will be a member of the global License Management team and your key responsibilities will include:</p><ul><li>Managing contract intake of in- and out-licenses.</li><li>Working with other team members in the Legal, Marketing, Product Management, New Product Introduction, R&amp;D, and Licensing departments to support license-related projects and processes</li><li>Managing end-user license agreement submission and review process.</li><li>Providing support for scientific/intellectual property/license-based initiatives as required.</li></ul><p><strong>Keys to Success:</strong></p><p>Education</p><ul><li>Bachelor’s Degree, or the equivalent knowledge and experience.</li></ul><p>Experience</p><ul><li>Minimum 7 years of work experience, with 3-4 years in paralegal, legal operations, or contract management.</li><li>Preference for experience in a life science or biotechnology company and/or technology transfer office.</li><li>Experience with license agreements is highly desirable.</li><li>Experience with analytic software tools, such as Power BI preferred</li><li>Experience in project or process management preferred</li></ul><p>Knowledge, Skills, Abilities</p><ul><li>Excellent interpersonal and communication (written and verbal) skills, strong initiative, results-orientation, collaborative/team instinct, and can-do attitude.</li><li>Demonstrated ability to manage complex, fast paced projects and effectively support and interact with different functions and roles across the company.</li><li>The abilities to work independently, prioritize projects, multi-task, and work well within an interdisciplinary team.</li><li>Desire to learn new skills and step outside traditional tasks including exposure to or interest in project management frameworks.</li></ul><p>Our Mission is to enable our customers to make the world healthier, cleaner and safer. Watch as our colleagues explain 5 reasons to work with us. As one team of 100,000+ colleagues, we share a common set of values - Integrity, Intensity, Innovation and Involvement - working together to accelerate research, solve complex scientific challenges, drive technological innovation and support patients in need. #StartYourStory at Thermo Fisher Scientific, where diverse experiences, backgrounds and perspectives are valued.</p><p>Apply today! http://jobs.thermofisher.com</p><p>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.</p><p><strong>Accessibility/Disability Access</strong></p><p>Job Seekers with a Disability: Thermo Fisher Scientific offers accessibility service for job seekers requiring accommodations in the job application process. For example, this may include individuals requiring assistance because of hearing, vision, mobility, or cognitive impairments. If you are a job seeker with a disability, or assisting a person with a disability, and require accessibility assistance or an accommodation to apply for one of our jobs, please submit a request by telephone at 1-855-471-2255*. Please include your contact information and specific details about your required accommodation to support you during the job application process.</p><p>*This telephone line is reserved solely for job seekers with disabilities requiring accessibility assistance or an accommodation in the job application process. Messages left for other purposes, such as not being able to get into the career website, following up on an application, or other non-disability related technical issues will not receive a response.</p><p></p>",
    "apply": "https://jobs.thermofisher.com/global/en/job/203450BR/Contracts-Specialist",
    "company": "/companies/thermo-fisher-scientific",
    "cName": "Thermo Fisher Scientific",
    "location": "Remote",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Contracts Manager",
    "description": "<p></p><p><strong>About Pinterest</strong>:&nbsp;&nbsp;</p><p>Millions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love.&nbsp;In your role, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping&nbsp;Pinners&nbsp;make their lives better in the positive corner of the internet.</p><p><em>Our new progressive work model is called PinFlex, a term that’s uniquely Pinterest to describe our flexible approach to living and working. Visit our&nbsp;</em><a href=\"https://www.pinterestcareers.com/pinflex/\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(230, 0, 35);\"><em><u>PinFlex</u></em></a><em>&nbsp;landing page to learn more.&nbsp;</em></p><p>The Commercial Legal Team at Pinterest negotiates Pinterest’s inbound and supplier agreements.&nbsp;We are looking for a Contracts Manager with a strong background in independently negotiating a high volume of low risk standard form commercial vendor agreements.&nbsp;As the first point of contact for internal business partners you will be responsible for ensuring our clients understand what we do and why we do it (through communication, training, documentation, etc.) and ensuring that our clients have a seamless, efficient and positive experience. The position will perform legal review and negotiation of our low spend, low risk commercial vendor agreements, provide back-up/overflow coverage for our Specialty Agreements (Events/Speaker Agreements, Communities Agreements, Confidential Agreements), as well as assist the Senior Contracts Manager with the day-to-day&nbsp;operations of Ironclad assignments for contracts analysts.&nbsp;This role will also provide support in a Lead capacity, providing coaching/mentoring, training, and audit of contracts analysts work.&nbsp;&nbsp;You should have experience working with templates, be able to&nbsp;effectively identify gaps and/or redundancies in processes, provide solutions and recommendations to solve potential issues, and effectively implement new processes.</p><p><strong>What you’ll do:</strong></p><ul><li>Triage and perform legal review and negotiation of our low risk commercial vendor agreements&nbsp;</li><li>Provide back-up and overflow support for specialty agreements (i.e. speaker/event agreements, communities agreements, confidential agreements, etc.)&nbsp;&nbsp;&nbsp;</li><li>Lead with a “business first” attitude that ensures our clients have a seamless, efficient and positive experience with the Commercial Legal Team.&nbsp;&nbsp;</li><li>Partner closely with contracts managers to develop processes and systems to scale globally</li><li>Proactively develop and update business processes for identified&nbsp;waste and re-work to help prepare the Commercial Legal team to scale globally&nbsp;</li><li>Provide guidance, mentorship to team members, as well as develop and train contract analysts on new work processes or initiatives</li><li>Review and audit work of contracts analysts to identify where there may be areas for improvement</li><li>Field questions from attorneys, contracts analysts and contract managers or XFN business partners on our business processes or Ironclad questions</li><li>Act as a liaison to XFN business partners for escalated matters</li><li>Monitor the Contracts-Legal alias (email inbox) and NDA alias and workflows and respond promptly and thoroughly to queries received&nbsp;&nbsp;</li></ul><p><strong>What we’re looking for:&nbsp;</strong></p><ul><li>5+ years of experience negotiating commercial vendor agreements (preferably with at least 1 year in-house)</li><li>Effective communicator, both written and verbal&nbsp;</li><li>You are able to distill and communicate highly nuanced legal positions within Pinterest in a clear, concise, compelling manner</li><li>You consistently exhibit strong judgment in ambiguous or challenging situations</li><li>A collaborative team player who likes&nbsp;nurturing business relationships and fostering an environment where ideas and creative thinking is encouraged&nbsp;</li><li>A problem solver who can anticipate needs and offer solutions</li><li>Experience in building processes to scale a growing commercial team (including template and provision libraries, automation in review, standard responses, and playbooks)</li></ul><p>#LI-HC</p><p>#LI-REMOTE&nbsp;</p><p><strong>Our Commitment to Diversity:</strong></p><p>At Pinterest, our mission is to bring everyone the inspiration to create a life they love—and that includes our employees. We’re taking on the most exciting challenges of our working lives, and we succeed with a team that represents an inclusive and diverse set of identities and backgrounds.</p><p></p>",
    "apply": "https://www.pinterestcareers.com/job/12630482/contracts-manager-remote/",
    "company": "/companies/pinterest",
    "cName": "Pinterest",
    "location": "Remote",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Contracts Coordinator",
    "description": "<p></p><p><span>This position is responsible for the day-to-day administration of contract management processes and interfaces between stakeholders, that may include business owners, vendors, as well as the contracts and subcontracts team, program management, business development, compliance, and legal. Facilitates contract actions and processes independently and effectively.</span></p><ul><li>Assists in the preparation of<span> responses to </span>request for quotes/proposals (RFQ/RFP)<span>.</span></li><li>Reviews RFQ/RFP for subcontract flow down requirements.</li><li>Collaborates with the contracts and subcontracts teams to create and revise systems and procedures by analyzing practices, reporting requirements, and archiving guidelines.</li><li>Collaborates with contract and subcontract managers in the review and preparation of support documents for agreements, amendments, and contract extensions for review, approval and full execution.</li><li>Coordinates execution of approved documents, updates status in system and assists with the distribution of documents, both internally and externally.</li><li>Assists with resolves billing and invoicing issues.</li><li>Maintains contract management <span>system.</span></li><li>Performs special tasks and assignments as required by <span>management.</span></li><li><span>Serves as key contact for the contract management system.</span></li><li>Prepares and coordinates non-disclosure agreements and teaming a<span>greements.</span></li><li>Negotiates and executes standard non-disclosure agreements <span>(NDAs).</span></li><li>Maintains contractual documentation and file set-up information including contract agreements, modifications, task/delivery orders, funding status, invoicing status,<span> representations/certifications,</span> and correspondence.</li><li>Processes and sets up contracts, modifications, etc. through company's <span>approval.</span></li></ul><p><strong><u>Other Job Requirements</u></strong></p><p><strong>Responsibilities</strong></p><p><span>3+ years of applicable experience (i.e., procurement or contracting).</span></p><p><span>Strong organizational skills demonstrated across a range of supplier and commercial contexts.</span></p><p><span>Excellent written and verbal communication, project coordination, leadership and interpersonal skills.</span></p><p><span>Proficient in the use of spreadsheets, database and word-processing applications.</span></p><p><span>Ability to rapidly establish credibility and relationships with a broad range of individuals.</span></p><p><span>Attention to detail and high level of accuracy.</span></p><p><span>Ability to work in disparate programs/systems and understand how they interact (Cobblestone, RITA, Compliance360).</span><u style=\"background-color: transparent;\">General Job Information</u></p><p><strong>Title</strong></p><p><span>Contracts Coordinator - Remote</span></p><p><strong>Grade</strong></p><p><span>23</span></p><p><strong>Work Experience</strong><span> - Required</span></p><p><span>Contract Administration and Management</span></p><p><span><span class=\"ql-cursor\">﻿</span></span><strong>Work Experience</strong><span> - Preferred</span></p><p><strong>Education</strong><span> - Required</span></p><p><span>Bachelors</span><span>Education - Preferred</span></p><p><span>License and Certifications - Required</span></p><p><span>License and Certifications - Preferred</span></p><p>Magellan Health, Inc. is proud to be an Equal Opportunity Employer and a Tobacco-free workplace.<span> EOE/M/F/Vet/Disabled.</span></p><p>Every employee must understand, comply with and attest to the security responsibilities and security controls unique to their position; and comply with all applicable legal, regulatory, and contractual requirements and internal policies and procedures.</p><p></p>",
    "apply": "https://magellanhealth.wd5.myworkdayjobs.com/en-US/magellan_health_careers/job/Remote---United-States/Sr-Contracts-Coordinator---Remote_R00000050464-1",
    "company": "/companies/magellan-health",
    "cName": "Magellan Health",
    "location": "USA",
    "type": "full-time",
    "category": "finance-legal"
  },
  {
    "title": "Strategic Marketing Comm Analyst II",
    "description": "<p></p><p><strong>Job Description</strong></p><p><strong>About Conduent</strong></p><p>Through our dedicated associates, Conduent delivers mission-critical services and solutions on behalf of Fortune 100 companies and over 500 governments – creating exceptional outcomes for our clients and the millions of people who count on them.</p><p>You have an opportunity to personally thrive, make a difference and be part of a culture where individuality is noticed and valued every day.</p><p><strong>Job Description</strong></p><p><strong>Job Track Description:</strong></p><ul><li>Requires formal education and relevant expertise in a professional, sales, or technical area.</li><li>Performs technical-based activities.</li><li>Contributes to and manages projects.</li><li>Uses deductive reasoning to solve problems and make recommendations.</li><li>Interfaces with and influences key stakeholders.</li><li>Leverages previous knowledge and expertise to achieve results.</li><li>Ability to complete work self-guided and with a team.</li><li>College or university degree required.</li></ul><p><strong>General Profile</strong></p><ul><li>Requires knowledge and experience in the field.</li><li>Will acquire higher-level knowledge and skills.</li><li>Develops an understanding of the company, processes, and customers.</li><li>Uses existing procedures to solve standard problems.</li><li>Receives moderate guidance and direction from others.</li></ul><p><strong>Functional Knowledge</strong></p><ul><li>Requires expanded conceptual understanding of theories, practices, and procedures.</li></ul><p><strong>Business Expertise</strong></p><ul><li>Uses an understanding of key business drivers to accomplish work.</li></ul><p><strong>Impact</strong></p><ul><li>Impacts a team, by example, through the quality service and information provided.</li><li>Follows standardized procedures and practices to achieve objectives and meet deadlines.</li></ul><p><strong>Leadership</strong></p><ul><li>No supervisory responsibilities.</li><li>Provides informal guidance to new team members.</li></ul><p><strong>Problem Solving</strong></p><ul><li>Uses existing procedures and technical experience to solve problems.</li></ul><p><strong>Interpersonal Skills</strong></p><ul><li>Exchanges complex information and ideas effectively.</li></ul><p><strong>Responsibility Statements</strong></p><ul><li>Applies communications expertise to create, edit, print, and deliver client communications.</li><li>Coordinates and reviews communications deliverables following the defined workflow guidelines.</li><li>Manages inventory and coordinates re-ordering requests with internal and external print vendors.</li><li>Provides extensive deliverable support during Annual Enrollment.</li><li>Manages rounds of edits and reviews submissions.</li><li>Manages project deliverables and timelines, supporting cross-functional communication needs.</li><li>Performs other duties as assigned.</li><li>Complies with all policies and standards.</li></ul><p><strong>Closing</strong></p><p>Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law.</p><p>People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the “Submit” button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first:&nbsp;<a href=\"https://downloads.conduent.com/content/usa/en/file/conduent-applicant-adaaa-referral-form.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(51, 51, 51);\">click here to access or download the form</a>. You may also&nbsp;<a href=\"http://downloads.conduent.com/content/usa/en/document/cdt_adaaa_accommodation_pol.pdf\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(51, 51, 51);\">click here to access Conduent’s ADAAA Accommodation Policy</a>.</p><p><em>At Conduent we value the health and safety of our associates, their families and our community. For US applicants while we DO NOT require vaccination for most of our jobs, we DO require that you provide us with your vaccination status, where legally permissible. Providing this information is a requirement of your employment at Conduent.</em></p><p></p>",
    "apply": "https://jobs.conduent.com/job/15925853/",
    "company": "/companies/conduent",
    "cName": "Conduent",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  },
  {
    "title": "Partner Marketing Coordinator",
    "description": "<p></p><p><strong>Company Description</strong></p><p>Jitterbit is a market-leading Enterprise Integration Platform as a Service (iPaaS) &amp; API Management (API-M) solution provider&nbsp;recognized by Gartner as a Leader in the Magic Quadrant for 6 years in a row!</p><p>Jitterbit helps businesses make faster, more effective decisions by enabling them to unify and exploit data from all sources.</p><p>Using the Jitterbit API integration platform companies can rapidly connect SaaS, on-premises and cloud applications and instantly infuse artificial intelligence into any business process. Our intuitive API creation technology enables companies to reuse business-critical applications and data to bring new offerings to market in days, not months.</p><p><strong>Job Description</strong></p><p>We currently have an opportunity for a highly motivated, detailed, and pro-active Partner Marketing Coordinator to join our Global Partner Marketing team. This is an exciting opportunity to help drive and build partner programs for new and existing Jitterbit partners. Working closely with the Senior Manager, Partner Marketing; Programs Alliances, Sales, and Marketing teams, you will collaborate with key stakeholders to maintain, expand, and create joint market reach, combined with brand awareness, and increase demand for both new logo and expansion business. This role will help drive growth through development and execution of initiatives such as content creation, demand generation, sales enablement, and partner communications. You will own the on-going management of the Jitterbit Partner Portal, including partner onboarding, training and development of with-Partner and thru-Partner marketing programs, campaigns, collateral, and events. In addition, you will support the build of resources, documents and planning for the new Partner Program. The ideal candidate must be creative, analytical, organized, data-driven, and results-oriented with a strong bias for action, the ability to meet deadlines, thrive in cross-functional and collaborative organizations, and is driven by the impact and support of change they will bring to the organization. What you’ll be doing ● Helping to develop, execute, and automate Partner Onboarding ● Managing the Jitterbit Partner Portal, maintaining new content, campaigns, and updates ● Leading the ongoing execution of our Partner Recognition Program with global stakeholders ● Supporting the evolution and maintenance of JItterbits Partner Program documentation, processes ● Working with sales and SMEs to enable sales activities through the development and refinement of sales presentations and collateral ● Using data efficiently to maintain and create dashboards and reporting for end-to-end partner programs in conjunction with Alliances, Sales, and Product teams ● Implementing and managing intake request process for the Partner Marketing Team to measure and scale work across team members ● Participating in projects and initiatives to ensure partner team alignment with goals and objectives associated with Jitterbit partner strategy ● Coordinating monthly newsletters, webinars, public website partner pages and other content and events ● Willing to execute and dive into new projects and programs as they are presented</p><p><strong>Qualifications</strong></p><p>● Bachelor’s degree required, preferably in Marketing, Communications, or related field ● 1- 3 years relevant experience ● Excellent written and verbal communication skills. Must be able to create, assemble and coordinate content ● Solid project and time management skills ● Proficiency with Microsoft Office ● Detail-oriented and highly organized individual with the ability to multitask ● Strong interpersonal skills, highly-motivated, proactive, and accountable ● Team player, self-starter with a passion for storytelling who will demonstrate a commitment to elevating the group’s marketing mission ● Ability to work under pressure to manage multiple priorities, often with competing and tight deadlines</p><p><strong>Additional Information</strong></p><p>All your information will be kept confidential according to EEO guidelines.</p><p></p>",
    "apply": "https://jobs.smartrecruiters.com/Jitterbit/743999830485512-partner-marketing-coordinator",
    "company": "/companies/jitterbit",
    "cName": "Jitterbit",
    "location": "USA",
    "type": "full-time",
    "category": "sales-marketing"
  }
]
