[
  {
    "company": "FireMon",
    "reviews": [
      {
        "rating": 1,
        "title": "No training for FireMon specific duties",
        "content": "With proper management, FireMon would be a great place to work. The environment is easy going and you get to work on a variety of firewalls and software.The position I had came with absolutely no training. Sat for months trying to figure out what exactly I should be studying to effectively do my job.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Typical day",
        "content": "The hardes part of  the job is the long hours. Not enough training Management is off and out of touch. Workplace is cut throath\nwhat I learned is to be tough.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great Place to Work",
        "content": "Pros* Laid back environment\n* Great people\n* Flexible hours and dress code\n* Great location\n* Free beverages\n* Pays well\n* Cutting Edge Technology\n* Market leading Software",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Relaxed work enviroment",
        "content": "This job is very dedicated to providing employees with work, life balance and understand that we work to live not live to work",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Too many periods of not enough work to do, poor management",
        "content": "The company lacks an employee handback and decent mgt. The devs are paid well but then don't get reviews, except some special ones. Favorites are played in the company, symptomatic of a small company. Not a place I'd work for if you want stability and reason.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Innovien Solutions",
    "reviews": []
  },
  {
    "company": "Provi",
    "reviews": []
  },
  {
    "company": "Level Ex",
    "reviews": []
  },
  {
    "company": "Q-Centrix",
    "reviews": []
  },
  {
    "company": "UKG",
    "reviews": []
  },
  {
    "company": "InfoTrust",
    "reviews": []
  },
  {
    "company": "Metova",
    "reviews": [
      {
        "rating": 3,
        "title": "Modern software development company, but mismanaged",
        "content": "A great place to work at if you look past the poor project management. People are fun to work with, office environment was very modern, and plenty of after work activities with co workers. Communicate was not a problem between the employees as you could usually ask for help or for feedback and receive a response very quickly. Project management was bad and there was poor communication of expectations.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Great Place to work",
        "content": "Metova was a great place to work. Good balance of time and working hours. They really worked with people for any concerns regarding the benefits package and for any sick days or illnesses.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Great team environment",
        "content": "Metova is a great place to work. They genuinely care about their employees and their product. I really enjoyed the team atmosphere and the opportunity to learn with my team.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Fun Office Environment",
        "content": "Fun office environment with great camaraderie and rapport. Learned new technologies on a weekly basis.\nManagement could be either overbearing or non-existent.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Still getting their footing",
        "content": "If you're not a developer there isn't anyone one who is willing to show you how to do your job but there are people that will tell you how to do your job.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Great company to work for",
        "content": "Great environment for learning and growing.Supportive and helpful executive leaders\nGreat work climate\nExcellent benefits package\nWelcoming environment",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Learning Experience",
        "content": "Work load varies some days light others very very heavy.\nCo-workers - loved\n\nHardest part of job - never felt properly trained on any one function so I could never really exceed at any one task.\n\nMost enjoyable - the other people I worked with.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Allscripts",
    "reviews": [
      {
        "rating": 4,
        "title": "Overall a good place to work",
        "content": "A good company to work for that unfortunately has been plagued with lots of layoffs. Since they have recently sold off the software business where I worked, this review may not be particularly useful.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Very corporate",
        "content": "Not a very rewarding company to work for. Very poor management at the various levels. Way too many meetings every single day. Very little is accomplished while charging the customer lots of money",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Software engineer",
        "content": "Good work life balance. In lockdown period very less layoffs and Company supported work from home. Company benefits are good. Health insurance is good.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Decent place to work, but lots of red tape",
        "content": "Good place to work but getting anything done was a slow process. Constant management changes slowed down the process as well.  Experience will vary depending on your team and manager.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Great people, smart, teamwork mentality",
        "content": "Laid off after many years with the company.  It was time but made you feel like a number rather than a person. No chance to look elsewhere in the company.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Managed Services is a tricky spot",
        "content": "AS focused on Managed Services at one point but that has slipped.  The employees have a rough time when contracts end and AS makes best effort to place elsewhere but not everyone has a position at the end of the contracts.  I have a harder time working from contract to contract now knowing my job security.  Sometimes you feel like a cog in a very large machine.  Is that part of the machine is no longer needed, you are gone.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Great company culture and environment to succeed",
        "content": "Really enjoy working at Allscripts.  Very inclusive and accepting with emphasis on diversity and inclusion.  Great people, supportive and striving for customer satisfaction and good solutions.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Large company. Many large siloed software solutions. The employee experience probably varies between silos.",
        "content": "You can waste a huge amount of time in meetings that have very little value. Developers tend to just multitask/code through them. All the US managers in my solution silo quit.The hardest part is pretending to follow SCRUM/Agile when it is really just waterfall for software capitalization.The coding opportunities themselves are pretty fun and varied though.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great work environment",
        "content": "I had a contract position before Covid happened and then the job was cut short. But while I was there the management was nice and the new hires I worked with were friendly.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Ability to work from home remotely.",
        "content": "Hardest part of job was taking instruction from management that was clearly incorrect and having no recourse.  This problem stems from hiring/promoting only people with degrees for management positions rather than promoting employees with experience.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great management for the NSD, and great people on the team! Very inclusive and helpful!",
        "content": "The company is good and I believe is getting better. Has definitely been a good entry level position. Highly recommend. High call volume and a steep learning curve but teammates willing to help you learn! Really can't ask for a better group to work with.The biggest issue I have is the benefits. Not great, and parental leave is unpaid.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Productive workplace with great people",
        "content": "Allscripts is an ever changing environment. The people are wonderful to work with. The benefits for the most part are good. Folks here are collaborative and are always up for a challenge.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Downhill slide",
        "content": "There are some people here that are caring and talented, however the leadership decisions being made often leave you scratching your head and wondering where you fit.  Compensation is ok, nothing to write home about, and perks are sub par for most companies nowadays.  Remote work is great though, so that is a plus.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Great Company Poor Accountability",
        "content": "Fantastic product lines. No Accountability in any role. Very poor communication across the service lines to achieve goals for clients. Almost impossible to grow and move forward even with prior experience.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Litmus",
    "reviews": []
  },
  {
    "company": "Zynga",
    "reviews": [
      {
        "rating": 4,
        "title": "Great people and a highly creative environment.",
        "content": "I would recommend any creative who would like to work with Zynga, they are not only a great games company they value any and all input to the creative process. One is surrounded by the highest quality and talented people as Zynga employs only the best in their respective field.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great place to work if you can stick around.",
        "content": "It was a real pleasure working at Zynga. I was on a fantastic team with a great culture. It was really great to work there. The team was highly skilled and we accomplished a lot in a short amount of time and were able to quickly turn directions several times without missing a beat.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Best learning environment for games as a live service",
        "content": "Growth rocket ship during the the FB web days. Overcame hurdles to transition to mobile first gaming company.                                            .",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "The Most Enjoyable Part of the Job",
        "content": "One of the most enjoyable parts of the job was when I first started and working at a video game company that I always was a huge fan.  Working here was definitely my dream job.  \nAlthough at the time I was hired they were going through several structural changes to management and leadership.\n\nWhen I left Zynga in 2017, I felt overly stressed for just working there for a short time, due to the energy and work environment.  I think 2 years later the company most likely is doing much better.  I honestly don't know, but I wouldn't work there again. \n\nI wish the best for those currently working there now.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Fun workspace",
        "content": "Culture is great at Zynga! There is a good work life balance with chances to de-stress while still in the building. Employees are friendly with one another and work closely with partnering teams.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Not a great place to work",
        "content": "Poor management, very little room to advance. Company culture with events is good. Benefits are good. A lot of gossip and politically correct culture is enforced.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Fun work environment, friendly, happy people",
        "content": "The workplace culture if a huge plus, and a predominant reason why people enjoy working there. Unfortunately, it can be rather disorganized and the departments don't communicate with one another as much as they should.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "An alright place (but it's changed since I been there)",
        "content": "I was at Zynga during a time of rapid transition, including three different CEOs and a round of layoffs. Ultimately, I found the people there to be better than the organizational structure and the top-level strategy. This was on the mend by the time I had left.\nA typical day had several meetings but mostly my superiors gave me the flexibility in order to do what I wanted and needed to. The hardest part, however, was that sometimes the requirements were vague or the tasks were very daunting. I felt like I didn't learn as much as I could have from the job, mostly due to a lack of documentation.\n\nThe people there were great, though, as were the perks and compensation.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great place with room for advancement",
        "content": "Zynga offers great pay and a fantastic work-life balance. The perks are insane as well (happy hours, full arcades, unlimited vacation, awesome gym with indoor basketball court). Management can be a bit frustrating to deal with at times.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "IT Support Intern",
        "content": "Internship provided by Year Up. This opportunity gave me the correct platform to start my career however the learning and mentor process needs to be cleaned up before I'd recommend for anyone to get their start here. If it's not then It's a whole lot of learning on your own.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Fun and Productive",
        "content": "Fun and productive. Chances to grow in the business. Opportunities to work on different aspects of the business. Dynamic and collaborative environment.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Working at Zynga",
        "content": "This is a fast pace company that has a lot of growing pains.  There was very little work life balance, however, if you like working and having all your perks at the office, breakfast, lunch, dinner, gym, etc, this maybe the place for you.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "You never know when it's going to end",
        "content": "Working at Zynga was great: state-of-the-art offices in San Francisco, catered breakfast, lunch and dinner, sushi on Wednesday, free gym and yoga, unlimited paid vacation etc etcHowever. apparently all this spending was not doing good for the Company, so they decided too cut expenses, together with 20% of the workforce after an year. In the gaming industry, this behavior is pretty typical thou. Games get staffed and un-staffed depending on their success, and layoff are pretty common. At least, they compensated me generously at my departure.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Awesome gaming company",
        "content": "As you can imagine working for a gaming company is really fun, games everywhere in the office. Also many fun nights organised by the management and in general awesome culture.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Lumen",
    "reviews": [
      {
        "rating": 4,
        "title": "Flexibility is a good thing at Lumen. There is a good work life balance.",
        "content": "They say they support personnel and value your career progression but, I didn't really see it. They hire externally when internal applicants abound. It is somewhat political and clique-ish.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Excellent company",
        "content": "very challenging training program that sets you up for success. Managers are very pleasant to work with, but will also push you to reach your max potential.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "I enjoy the laid-back work environment. As long as work is getting done and we stay within the rules of the company, no one really bothers us.",
        "content": "I often recommend Lumen to others because overall they've treated me well, which is why I'm still here past 3.5 years. They seem to care about their employees.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Great pay and benefits, POOR management. Watch your back.",
        "content": "I have worked for LUMEN since they became and before they were LUMEN.I have talked to many people and most of all I have spoken to share my experience, my views and general opinion of the company.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Corporation is too big with too many branches.",
        "content": "No raises in 5 years.   Only Bonus STI.  Never know when your job will end.   Scheduling is ever changing.  They hire new people to prepare changes with old programs.   Hard to get trained correctly.   76 page M & P to do one task.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Good company",
        "content": "Good company with good people. You can learn a lot and meet great people! Have to put in work but worth it! Make sure to work hard and learn as much as you can!",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Overall a good place to work if you're a good worker.",
        "content": "The kind of Boss you have is really what makes it a good place to work or not. Leadership is awful but where is it not? It's a good paycheck and good benefits if you actually put effort into your work. Used to be a place you would work 50 years and retire on full pension but now it's a standard 5 year job if you're lucky . Used to pay at the top or above competition, but now have fallen below any competitive salary for high performing professionals.  Good bonus. No raises.  Ever.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Constant pressure to accomplish more.  No job security or satisfaction.  Lower than average pay.",
        "content": "Run away from this company.  It's worth it to take a lower paying job elsewhere, trust me.  Until they change the culture and expectations this will be a poor environment to work.  Also, there is next to nil job security.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "It is either feast or famine.  Either you are overworked or you don't have enough to do.",
        "content": "Management support is about 50/50.  I had some managers that were excellent on supporting me and getting me projects to work on.  Others that I never heard from and offered no support helping to find areas where I could contribute.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Uncertain Future",
        "content": "Lots of mergers in the past. Now the business is splitting into 2 separate companies. A very uncertain future.  No one knows which company they will be working for.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "good company and good benefits",
        "content": "great place and people, i have a lot of support from my peers and manager, there is a lot to learn and remember on a daily basis but you have a long break in time.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Hours suck",
        "content": "Hours suck. Pay decent. Changes constantly and high volume of work. Kept in dark a lot. Must work events, weekend and holidays. Even after being there 10+ years.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "It's cool if you're getting your feet wet.",
        "content": "Technicians are paid less than the national average. Expect to be multi-tasking multiple tickets at once, with Management not remembering what they gave you 30 minutes ago.Management attempts to use the same placation strategies on us that they ask you to perform on customers when we ask for raises or proper procedure implementation.No formal training:  I did the math - for at least 4000 hours of real work, they supplied us 15 hours of training to troubleshoot these massive circuits you pay the company for.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Company Has  Gone Downhill",
        "content": "There were so may changes every other week low staff because they kept cutting people putting more stress on current employees management did not care about their staff there was a lot of favoritism employees were overworked and underpaid if you have small children this job is not for you most of us were so burnt out but of course management could care less they did not care about customers either only good thing about my experience is that they did work with you if you had some personal things to handle and it allowed me the opportunity to return back to school and pursue something I really wanted to do…a huge con is NO ADVANCEMENT AT ALL AND THE PAY SUCKS especially if your a contractor too much work and little pay for what you have to do",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Highmark",
    "reviews": [
      {
        "rating": 3,
        "title": "Bad experience, terrible management, outdated technology",
        "content": "Will make a lot mistakes you aren’t aware of or have control over because of incompetent trainers, They want you to learn without them telling you how to do it, Too high expectations, Bad communication (as far as who is in charge of your scheduling, not clear on instructions, Some problematic people in the work place (bad attitudes), make you a target if you are new or aren’t already buddies with them outside of workplace, Make you a target if you don’t “figure it out on you own” even though they are bad at their jobs, System (and training) is outdated, You are expected to remember a lot in a short amount of time even though not clear in beginning",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "meh",
        "content": "seems all high and great at first.. aaaand then the true colors show. if you’re a hard worker you’re treated unfairly. you basically cannot even take a bathroom break without them asking where you are. if you take a vacation, they punish you when you come back with nonstop work and other things. there’s no equality. what one sup may do for someone else, they won’t do for you. they don’t care if you’re sick. they don’t care if you’re hospitalized (i would know).",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Comp good, work life balance not so much",
        "content": "There is a lot going on and that is reflected in your workload. Often worked in excess of 50 hours per week. However, compensation is good especially with the added yearly bonus",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great benefit package",
        "content": "Great benefits and PTO very busy and must be good with time management. Each department is different. I love my area and team. Happy to tell people I work at Highmark.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "No training",
        "content": "The credentialing dept is a mess. When I started I was told there would be a solid two months of training. My group received 8 days of training before the person doing it left. No one bothered to continue teaching us. Paid time the is dictated by the state was withheld. I prolonged/rescheduled my health appointments to be available for training that didn’t happen resulting in me becoming dangerously sick. The supervisor took five weeks off at the end of the year so there was no help/supervision/guidance. The position was titled data entry and it is far more complicated and the pay is not equal to the work.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Very flexible with your life schedule",
        "content": "I work remotely and enjoy the flexibility this job provides. Everyone is very helpful here whenever you have questions/need assistance.Like any other place, there will be times with some stress, but it's all very balanced in my opinion. Opportunities for OT available with shift differential pay after 5pm if needed. Always negotiate your pay before hired! I know I did. Also, once you get through training (for member services) things get easier. You do learn as you go a lot. Everyday I'm learning something new. Just stick to the initial training. Don't give up on it! It can be dry. But needed to move on on your own. You do get to shadow experienced agents and work 1:1 with them once out of training. They send you a very nice laptop to work with, extra screens and everything else needed (except desk of course lol)You get two 15 mins breaks (paid) and one 45mins lunch (not paid). There are lots of opportunities to advance if you prove yourself (showing interest in learning more, for example) New positions are posted internally for employees that are interested, too. The company offers health insurance with different types that you can choose from, as well as other benefits. I was personally surprised by the generous amount of personal time off you get in a year. You can also roll some of it to the next year too. I don't feel like a slave with this company so far. Been here for almost a year now!",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Day-by-day Changes",
        "content": "During Weekly Meetings, there wasn’t much clear instructions for new employees as long as veteran employees understood. Too many expectation changes daily and weekly. No heads up or feedback from Management before ending your contract. Even when you email management for feedback, they continue to ignore you. They only give you 2-3 weeks to reach their new goals. They give you less than 3-months to learn their systems but in orientation they tell you, you have 6-12 months to learn and feel comfortable with everything. They sent me a defective monitor that would go black everyday so I spent more of my time rebooting everything 1-2 times a day. They believe quantity is more important than quality service which explains their very high call and web volume. They recognize the same favorite employees every meeting and disregard the new employees reviews. I never seen any bad reviews about me from employees but seen plenty from those favorites they praise weekly. Honestly they act like new employees should know everything on the same level as veteran employees do. After training, I was never told what I did good or bad. I only knew I did good because the employees that I answered their calls would tell me they appreciated how I handle things and Highmark should have more HR employees like me who care.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Outdated company culture, management and technology",
        "content": "It's a paycheck. There are some major gaps in HR and work life balance. At first it might seem very good but quickly you are overworked and underpaid.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Overall good company, but pay could be better",
        "content": "The company overall is nice. However, the pay, raises, and bonuses could have been better, and favored management as opposed to those who did the work to reach the goals.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Poor management/employee relationships. Employees are not heard. No work life balance.",
        "content": "Employee breaks and lunches are not valued. This is a high stress environment. Employees are not valued by managers or administration. Human Resources are for the management and not supportive to employees.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Productive environment. Will be able to grow within the company.",
        "content": "Very good company to work for long term. Will be able to grow your knowledge within the health insurance field. Will also have the ability to utilize multiple customer service as well as analytical skills.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Often feel like just an employee number",
        "content": "The employees and team managers are great to work with.  However, HR and upper management are cold and make you feel like you are not really respected as an employee - you are just a number.  The company seems to be pushing more work offshore.  The work from home policy is great.  Depending on your position, the hours can be long with nights and weekends.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Great Culture...Leadership walks the talk!",
        "content": "Great culture, Remote working flexibility, awesome benefits, awesome pay/compensation, yearly bonuses and raises, Core Behaviors and Employee engagement are important to leadership and colleagues.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great coworkers. Very flexible for family needs.",
        "content": "Good pay for your job, coworkers and manager care about me as a person. Love being able to work from home and be flexible if something comes up. Benefits could be better, but you get an annual bonus that is nice.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Relativity",
    "reviews": []
  },
  {
    "company": "Thermo Fisher Scientific",
    "reviews": [
      {
        "rating": 3,
        "title": "Don't waste your time",
        "content": "Better options than this place. Co workers are cool, but management needs improvement. Not a good place to work if you are looking to advance your career.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Terrible place to work if your looking for a solid future",
        "content": "Upper management is a no show. Everyone lives in a bubble and has no time to show you anything. Complete self service company that won't help you even when it affects the company's stature with it's contracted company.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Respectful management. Pay is not bad benefits are ok",
        "content": "Thermo Fisher is a great place to work. The management is superd and the pay is fair. Only thing I don't like is some of the employees that think they're manager.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Site Issue",
        "content": "Pay ranges are not transparent and discussing wage is highly discouraged. Supervisors here practice favortism and doesn't seem to care about concerns or suggestions, especially if you are at the bottom of the totem pole. There's no strong sense of team work because everyone looks out for themselves and makes other people look bad. Parking and seating have been a big issue since I started working at this site.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Great Company with poor leadership in certain areas...",
        "content": "Management hires unqualified people for leadership roles and the pay is low for the work you are doing. Steriles South is a complete joke, chaos everyday, Bad Information from Supervisors and upper management leads to mistakes which are always blamed on the operators. Some shifts have been short handed on help for months while others are overflowing with help.Poor performers are celebrated when they do a small amount of work one day while the people who always show up to work and carry the shift forward day to day are overlooked and expected to pick up the slack from other employees. Thermo-Fisher isn't all bad though, the yearly raises are nice, along with a yearly bonus. Other departments like steriles north are much better enviroments to work in. The work schedule isn't bad either...you work 4 days one week and 3 the next week, 12 hour shifts of course. But you also are able to work as much overtime as you like.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Great  Company for long term careers",
        "content": "Thermo Fisher is a great place to work, provides great benefits and the oportunity to growth on your career.  I consider Thermo one of the most admired companies in the world.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Only liked my small office",
        "content": "I worked off site and enjoyed that office specifically. I felt out of touch with the main branch and it didn't feel like they cared about us, though. I've worked here almost 3 years and have had no opportunities to move up. I'm an introverted person myself, but it would've been nice to feel like the whole part of the company. Benefits are very nice, though, and I loved my small office and boss. I still prefer this company over previous ones I've worked at.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "A place for new grad to learn and improve",
        "content": "TFS is a great place to start off your career path because you would put yourself into situations where you have to learn, act and improve because the company is growing so fast that you have to keep up with the flow. However, this is like the cosmetic industries where new products keep launching. Instead, at TFS which is a medical device company, you need to get familiar with the regulations and standards because medical products are way more strenuous than regular products. By keeping up, I mean you might have to work on several projects at the same time where different knowledge or regulations might apply.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Good company/ poor management, poor execution of goals, customer not priority",
        "content": "Bottom line for shareholders is priority #1managers do not know how to execute goals and follow through, poor self development unless you push for itcustomers often left feeling neglected as a result of corp policies",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "It's a job",
        "content": "Depending on where you are depends on your experience. If you have good coworkers, you'll have an okay. Management and communication is absolutely horrible. Work and life balance are also awful, good luck if you have a kid.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Overwhelming hours.",
        "content": "ThermoFisher is a cool company that prides itself in quality assurance, and has a solid team environment. However, they work you on average 10 hours a day M-F with mandatory work on Saturdays as well; before I left, we worked every single Saturday for 3 months, which made doing anything outside of work extremely inconvenient. Management was strong but cared more about numbers than you as a person.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Seen but not heard",
        "content": "Strong emphasis on maximum productivity and management is okay burning people out to do it. Your success depends on your lead or supervisor. Some are good but most are not.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Favoritism",
        "content": "They favor certain people, and whomever they don’t have to fight battles to be accepted every day and they lie to you about reasons for trouble.     They do not give any feedback in any way shape or form, they will not listen to any one’s ideas, and they do not honor legal commitments. Poor place to work wouldn’t recommend to anyone for any reason.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Favoritism, subject matter expertise is an after thought in the business side of things.",
        "content": "Get one person to do everything. Worst type of politics and toxic culture. Everyone rides on one person and turns a blind eye to progress. Management does not know the right questions to ask. Everyone must follow hierarchy even if people above you don't know what they are doing and will waste your time and theirs in chasing the wrong ideas and asking the wrong questions. Lack of respect.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Pinterest",
    "reviews": [
      {
        "rating": 3,
        "title": "It was a cool experience",
        "content": "It was a fair and cool work place. A friendly environment to be in and nice people to work with. It's like being at a little city inside of San Francisco. It was great and i had a good time working there.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Pinterest was a great experience",
        "content": "Pinterest was a very cultural diverse job with many different faces that came with nothing but positive energy. I would say the best part about working for Pinterest was being able to experience how the CEO cared for his workers as if they didn’t work for him, and the amazing overtime they gave us.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great place to work.",
        "content": "A great culture and atmosphere to work in. I learned so much with the team and the businesses I got to encounter every single day. The ability to collaborate in such an open setting really gave us ability to grow.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Great Work/Life Balance",
        "content": "Pinterest believes in work/life balance, and the mission behind working for Pinterest is extremely inspiring no matter what department you're working for.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "productive and fun place to work but getting politic",
        "content": "Good flexible workplace but lots of red tape to navigate internally. The CEO has great product vision but not the best and most competant people in places of leadership",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Workplace Culture",
        "content": "Great culture!\nOverall the SMB team in the Ogden UT office is a fast-paced and positive environment. It is a very busy office and if you aren't intrinsically motivated Pinterest might not be the place for you.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "competitive and standard",
        "content": "my typical day at work is to Prepare all my tools then they send me a text what I'm going to do the whole day. I try to complete all the work I need to do. If I finish on time we have to do extra stuff. you Have to be flexible to move to different buildings and other stuff.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Amazing Company",
        "content": "I have loved my time at Pinterest. The culture is unreal and there is a certain work hard and play hard mentality. The only downside is having to live in a crowded city to work at an office if you want to promote",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Pretty good",
        "content": "It was a fun internship. The people are really friendly, the office is really nice, and the benefits are pretty on par with other companies on their level.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Fun, forward thinking, but lacks good compensation.",
        "content": "The Ogden Office is a great place to learn, for entry-level employees, but as far as earning potential in the SLC area, is quite poor. The reward is in knowledge not in compensation.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Pinterest was a great learning experience.",
        "content": "The hardest part of the job was looking for businesses to speak with. It was very challenging and probably the most challenging jobs but it was the most rewarding.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Just soso",
        "content": "Like the team. Dislike the management who doesn't know anything. Brand new equipment t to use which is a plus.\nMost teammates act way too spoiled meaning they act like they are better than this place. Leaving a mess at their station and bathroom allowing someone else to pick up after them.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "good place to work",
        "content": "good culture and people, bad management as its a growing company and having hard time scaling the management correctly. very smart people are hired and the work is interesting",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Solid Job",
        "content": "Best job I've had so far. Loved my team, management, etc. Company culture had some of the typical silicon valley pitfalls, but many benefits to compensate.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Magellan Health",
    "reviews": [
      {
        "rating": 2,
        "title": "Management = Nightmare Fuel",
        "content": "Management changes far to often and usually decides to change everything about your job with no notice or acknowledgment from the employees. Even after a trip to HR they continuously add clients and workload. My daily responsibilities are unclear and nothing close to what it was the day before. Management tells HR one thing and does the opposite creating an atmosphere which full of criticism and restrictions. Don’t go to HR because it does no good. Just go ahead and quit the moment you feel you are at the point where you might need HR. It does no good.I am at the point it’s either quit or be under appreciated and have zero consistency in my daily life. Everyone deserves to have a bit of consistency. You will not find it at Magellan. ALL management issues.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Good culture, good people, management needs to get their act together.",
        "content": "Good work life balance.Meaningful work.You’ll never get fired unless you do something extremely dumb. Some people are amazing at what they do.Some people are mindless crank turners (including some in upper management) Good opportunity to grow and learn if one chooses to do so. Most of IT is incompetent , PMs are also incompetent. Everything moves extremely slow",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Great work environment",
        "content": "My current role allows me the opportunity to be creative and still help others. Leadership takes the time to hear feedback and so far I have no complaints.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Solid option for providers seeking nonclinical work",
        "content": "Training and equipment are provided to ensure you have what you need to start work.  The company seems to be willing to work with providers who don’t have previous benefits management experience and allow for the necessary time to get up to speed with this type of work.  Once fully up to speed, you are expected to meet quality and productivity metrics that are clearly outlined.  In my experience, meeting those metrics has been fairly recognized with bonuses.  The base pay rate per hour should be increased to be more competitive with other companies and seems to vary somewhat depending on provider specialty. The relatively low base salary rate is the only real reason I would look for or consider other jobs, as I’m overall very satisfied with the day to day experience of working for Magellan.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Productive and fun work place.",
        "content": "The company offers positions that are full of fun as well as opportunities to advance.  The bad aspect of this company is that employees have to complete the same yearly trainings, however some are CE accredited.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Low Pay for RNs",
        "content": "They only offer $40 thousand a year for RNs. The pay is really low but the job is easy and flexible working in New Parent Support Program as a Home Visitor. This job can be done by anyone it does not require Nurses. We dont use any skills and sit most of the day.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Has the potential to be good however misses the mark.",
        "content": "Magellan has the potential to be good however the turnover rate is very high mainly because management micromanages and quantity is more important than quality. Adherence is scrutinized way to much. For instance if you are seeking out help from the assist line or if someone asks for a manager and you have to place someone on hold your hold time is held against you. Another example if you are on a call and it spills over into your lunch or break it's held against you as out of adherence. ultimately these can stop you from getting a merit raise even if your quality score is 100. the communication between managers and employees is minimum most system changes and policy changes are found out when you make a mistake or when you log into the system. Calls are back to back with no time in between calls. I've never worked at a company where you don't get 3-5 seconds between calls to just take a sip of water. They should also focus on their website Radmd because if it worked like it should people wouldn't get so burned out (hence the high turnover rate). Offices prefer to use the website but they can't because it has too many limitations and is always down which leads them to call into the center. claims to be really diverse and inclusive but won't recognize or even acknowledge Hispanic heritage month, Black history month, or MLK birthday literally not onw peep. They will however will send out 20 emails about St. Patty's day and have games and celebrations surrounding it. Not very inclusive to POC.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Love the flexibility in schedule",
        "content": "Can work from anywhere and set my own hours which is the main thing I look for in jobs so happy. Very relaxed culture no micromanaging in my position. Very helpful to questions and assistance is available when you need it",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Behavioral Health Care Manager",
        "content": "I just got hired as a RN. I’m currently getting to know the company. So far I’ve had a good experience with management/leadership and I look forward to working with the company.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Micranaged to the endth degree",
        "content": "Managers have no clue what is going or how to show you the system, clocking in and out and just simple things. They throw you on the floor after training and then get smart when you ask a question. The leads are two faced and the operations people will message you to get back on the phone when you try to go to the bathroom. It's a five min walk and they give you five min. You cannot be a min late esp during training. It is awful, esp if you have anxiety.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Good pay but extremely disorganized",
        "content": "Literally from day 1, with absolutely NO training, they put my class of new hire agents on the phone. In two weeks, they moved us again. Maybe a week later, they interrupted that training bc we were no longer needed for that project, and they moved us into our final positions. We were trained for a week, and then we were taking customer service calls permanently. I applied and was hired to be a clinical pharmacy technician, not to be a customer service technician but I stayed in it for a year bc of the pay. Bc they trained us poorly for customer service, my calls were often more complex than they needed to be. I would have to put members on hold for simple questions that I didn’t know the answer to. The plans that the members enroll in through their jobs really aren’t good, and then we have to hear about it when they call.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "If you can handle a fast paced environment then you can handle this job.",
        "content": "I enjoyed my time for the first month, however it became stressful, simply is difficult having people yelling at you on the phone. If you can handle that then you will enjoy it. It is good for some people but not for me.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Tired and under paid",
        "content": "The most mentally draining job. You are expected to call 100s  plus calls per day and document them properly. Very Unrealistic metrics, under paid and unappreciated. There is no such thing as excused absence so you are constantly hoping nothing goes wrong especially if you are a parent. You work from home but you are glued to your computer for hours and hours because you are monitored like a kindergartner.  By time you get of you are drained and your eyes are weak all for minimum wage. Never again!!!",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Back to back to back calls non stop all day!!!!",
        "content": "Turn over with this company is very high! Classroom training was decent depending on the trainer your new hire group is assigned to. I was told training was 4 solid weeks it was only two and was thrown out to the wolves and no mentor assigned when I was told that I would have one. There metrics are unrealistic wants calls to stay under 5 mins feels impossible when you have providers calling in with multiple request I have done as many as 25 on one call driving up the call time. There is little guidance leads are not help some micro manage and refer you to a guide straight out training. Response time when needing help on a call is ridiculous. If the training was more thorough and not so rushed and if we were assigned a mentor after training, I can see things running smoother and it wouldn't be so bad. If you have the tolerance to do this fine, but the calls are back to back due to not having the staff everyone ends of quitting within the 90 days or shortly after. I do not see myself staying with this company long due to this dept. I'm hoping now that Centene has took over that they can get this side of the company cleaned up and raise the pay. I would not recommend this job to anyone as you are set up for failure before you even begin.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Conduent",
    "reviews": [
      {
        "rating": 1,
        "title": "Poor administrative staff and management.",
        "content": "The left hand doesn't know what the right is doing there. I was there for 9 months and in that 9 month time frame my schedule changed 7 times with little to no notice.Constant administrative mistakes that caused issues with employee pay and other employee information. Hit or miss management that is given free range to teat their suburbanites poorly.  No set standard of performance. Was assigned to 13 different mangers in my 9 months each with their own standards for performance.Would avoid working here if possible.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Okay Company to work for",
        "content": "Condiment was a average company, nothing bad to nor good to say working for them. Compensation was good for entry level. Long hours and back to back calls.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Boring workplace. Fast paced. Not nearly enough training!",
        "content": "It was a job that paid the bills. Very stressful at times. You would get low scores because of unhappy customers. Even if it was not your fault. Working from home was cool but the customers are almost always mad because of the long hold tiles when they call. Most customers expect you to pull a rabbit out of a hat.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "didn’t make it past training",
        "content": "the training was horrible. then they throw you straight to work. hectic and very unprofessional. the onboarding and hiring process was fine. and the equipment shipping was simple.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Terrible company with even worse communication",
        "content": "Prob the worst company I had the benefit of working for. There is no structure between work and home life. Schedule will change with no notice. Never received a single coaching in the 11months with them.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Awful place to work",
        "content": "Management is terrible. Management does not take any suggestions from processors. Team leads are overworked and pay is not good. No room for advancement. My supervisor is great but other supervisors try to micromanage you. Company stopped matching 401k and did not notify employees until 9-10 months later. Health and dental insurance is no good, company bought it from the marketplace. People make up their own rules and don’t follow proper guidelines when processing applications.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Horrible place to work but pay is decent",
        "content": "There is no moving up in this place and management is a joke.  It will drain the life out of you.  Stayed for almost 8 years only because of pay. Other locations may be better but not Londons.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "No micro management, great management.",
        "content": "I literally have no cons about this job, it's the best one I ever had. Management is really down to earth, I really do enjoy working here. Pay could be a little better, but they do offer a shift differential.  Only gripe is my shift and inability to move to a different one.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "I enjoy my job",
        "content": "I love my job and the people I work with it has become my work family, it works with my schedule, no weekends unless we get behind reachable goals  great company",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "High turn over rate",
        "content": "Conduent itself may not be a bad company but the companies they are vendors to change constantly with the demands the companies want and everyone is expected to change how a process works on a daily basis. The jobs they say your going to do ends up being more than what your trained for and just have to figure it out on your own. Manager and supervisors don't really care and only talk about what your messing up on. People are put into management that don't even help their employees and that's sad because questions go unanswered or pushed off until more than one person asks about it.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "What an aweful experience",
        "content": "Sincerely worst job Ive ever had, fast food service is better than this. You can please a customer better in fast food rather than this place can. 90% of the job is saying \"no\" to the customer and feeling like horrible. Your a useless CSR, and Management and HR are a joke as well. They dont help do anything important at all. I bought a car while working here, and car loaner needed to verify my employment with my HR team. My HR was useless, they couldnt even verify my employment with them. I HAD TO DO IT MYSELF. This company is aweful, STAY AWAY.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Call Center",
        "content": "Not the greatest place to work. If you like a call center job than this is for you. It's a job..not a career place, pay is low not much room for advancement",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Unprofessional when spoken by other staff.",
        "content": "One trainer was helpful, the other had an attitude problem.  Management would spy on the trainees.  Basically treated and talked to like we were children.  I don’t think was necessary since all the trainers were eager to learn.  Training start late, but you must be on time of course.   The pay isn’t worth the amount of work, but it is a good experience to take to other jobs.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Awful",
        "content": "Just awful, I worked for a tech company through this job and the QA is awful. Also, I was told I’d move up quickly due to my skill, but once I took PTO for a vacation I planned for months in advance, suddenly the training was dropped. They basically dangling the promotion in my face but said it would start the day I left town and I either had to take the promotion and lose my vacation or go on vacation while losing my promotion.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "Jitterbit",
    "reviews": [
      {
        "rating": 1,
        "title": "Pay scale should be equal to education and experience",
        "content": "Outdated company that needs a face lift and modern technology  facilities. Extremely tight on budget. Low ball in salary, so they're loosing valuable employees. Frequent layoffs and uncertain future direction.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Not Recommended!",
        "content": "Administration is not particularly supportive (nor did many of them seem very happy). Also, when you are starting out, you are expected to double work (and they can give you as little as a few current accounts). The pay makes it very difficult to survive on their salary. Very little opportunity for advancement.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Poorly managed organization",
        "content": "If you want to work and don't get paid. The amount of hours worked and time invested help make a difference in your own professional development is wasted as it is not advance opportunities.  This was a Job that I interacted with a lot of different customers that have been very regretful to sign a contract with Jitterbit.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Over worked, under appreciated and under pay",
        "content": "Not Best for life to many hours and this job will take all of your energy. They will wait till You will burn out all of your energy and then ask for more or said good bye. Very disrespectful co workers and management which makes life miserable.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "cool company",
        "content": "I really like working there - good company culture - interesting product.  Good Partners. Good management. Fun people. Generally good attitudes. If you work hard you can advance.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Love it",
        "content": "I love working here. The platform is amazing. Management is more open-minded than anywhere else I've ever been. The work is exciting. They have a very bright future.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      }
    ]
  },
  {
    "company": "VSP Global",
    "reviews": [
      {
        "rating": 4,
        "title": "Good company but the best days are behind us.",
        "content": "I started with VSP about 6 years ago and they have been taking away benefits and perks every year since i started.  They are a good company but one of the reasons i went to work for them was all of the perks and benefits since the pay was average at best.  The pay has not increased but they have taken away medical benefits, 40 hours of extra vacation and many other smaller things that made them special.  Now i feel they are just another insurance company.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Boring very busy place",
        "content": "The experience  was ok. Avg call time was about 2.5 mins and they were busy all day long. Like back to back. Literally. Very repetitive monotonous work. Good health insurance.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Horrible company to work for.",
        "content": "WORST company to ever work for. Started out as a contractor, as soon as I got in permanent they gave me a pay decrease and said it’s because of the benefits that comes with the job - what benefits? My position was remote and there were many times where we couldn’t log in and work due to “system issues.” We would be forced to take days off without pay - even though they said we should be getting paid since the issue wasn’t our fault but theirs to begin with. We couldn’t work for 2 months straight and everyday they would send us emails/updates claiming that we should start working again soon… just to find out in the end that they decided to let us all go after all the constant lies and excuses. Shows that they really don’t care about their employees no matter what situation it is.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "It was ok",
        "content": "It was ok for the most part. Management is hard to get in contact with. You need to be able to train yourself because not all trainers have patience or know the update procedures. Management needs to be more accessible, no help when you get on the floor your by yourself. The knowledge base is not really helpful at all. Other departments will transfer every call to customer care and not do their jobs. When speaking to other departments most of the times those departments have attitudes and refuse to help.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Awful, stressful environment",
        "content": "At the interview they promise 4 weeks of training but that is likely to be cut short, hundreds of calls are stuck holding daily. Management is non existent and makes the worst decision possible and over works every agent as much as possible. Frustrations and complaints will fall on deaf ears as both your direct supervisor and upper management can’t even be bothered to pretend to care. Avoid this job during the busy season.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 4,
        "title": "Productive and safe",
        "content": "Work space work relationships and culture good environment for advancement a definite career builder also a very good environment for skill development",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "Just Okay",
        "content": "Work/Life balance is good, not many options to advance salary wise as many positions are lateral. Only 3% raises once a year. Company does not invest in its employees. People with little to no experience get hired on making extremely more than the people that have worked for the company 10+ years. Non Union so they do not care about cost of living adjustments.",
        "status": "Employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Best place I ever worked at",
        "content": "I left just because I realized the call center life wasn’t for me but this was by far the best employer I ever had. They’re a fantastic company which is why the call volume can be so high but they make you feel so valued! They recognize the work you do and celebrate you being there with cake day, customer service rep appreciate week. You get annual raises and a bonus. They have over time and even make it interesting where if you work the most over time you get additional cash on top of that or maybe an Amazon gift card, choose your shift etc. they’re amazing and the training is extensive and so detailed and well planned. They have amazing opportunities for growth and you can advance very quickly. I could go on and on about this place. The only thing that sucks a little is that every 3 months or so you have to go through a shift id but they base it off your performance. So my two years working there I never had a late shift. They’re amazing.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 5,
        "title": "Good teamwork",
        "content": "Good teamwork but pay was below average. Inclusive work environment. It’s nice having cafeterias on campus. The holiday parties/cake says were nice. Overall, I would work here again even though pay was lower than average, healthcare made up for it.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Work, work. Work, and then work, work, work some more.",
        "content": "Very \"clicky\". The company favorites are kept close to their heart, and then they hire temps,and work them to death. They call it a professional position in a warehouse/factory setting. When they moved to a new facility,with a huge overhaul that they believed would put them on top of the world, they thought nothing of the 15 mile difference in commute. Nor did they think twice,when, after three weeks without a single pair of glasses, of having us work on Thanksgiving! I was told that I would not be picked up after my six months, and I was so relieved! Went back to my old job where I was loved. No regrets.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 1,
        "title": "Customer Service",
        "content": "Told when we started we would get all our training and the job was to satisfy our caller. Follow through. U start at the lowest part of the customer service    Team.  If you are not a favorite or if you question you will stay there and everyone else will move on. Then they get chances at other jobs because you are then considered fully trained. While they keep others in the lowest tier. They don’t tell u that in the interview process. The supervisors they picked to run it have never been trained as supervisors. They bully, micro manage, do not have your back, ever, while they do nothing but listen to your calls.  O and you are only given 3 min to get through your call. It’s ridiculous. You are set up to fail from the beginning. Don’t do it.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "Used to be Great",
        "content": "Culture and management deteriorated starting in 2016. There have been several reorganizations and changes since then, each for the worse. The insurance side of the business is OK. The Columbus Optical Lab has now been downsized to a fraction of what it was in 2015, and it was small even then.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 3,
        "title": "its a job",
        "content": "This job was simply a job as soon as COVID hit they showed who they really are as a company. I am pleased to say I no longer and an employee of VSP work at home.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      },
      {
        "rating": 2,
        "title": "It’s simply a job- no room for advancement",
        "content": "If you’re just looking for a paycheck and no appreciation or room for advancement vsp is the place for you. The compensation isn’t enough for the stressful expectations and micro managing.",
        "status": "Previously employed",
        "pros": "",
        "cons": ""
      }
    ]
  }
]